[
  {
    "author": [
      "David J Murphy"
    ],
    "category": [
      "Web Development"
    ],
    "description": "<p>This book examines the software development process and how Trac and Subversion help fulfill the requirements of it. It combines theory with practical knowledge and experience that most developers will relate to. This book is aimed at developers of all calibres, but particularly those that lead teams or projects, especially if they have recently moved into the role or are simply looking for a “better way”.</p>",
    "download_link": "http://file.allitebooks.com/20170906/Managing%20Software%20Development%20with%20Trac%20and%20Subversion.pdf",
    "file_format": "PDF",
    "file_size": "3.4 MB",
    "image": "Managing-Software-Development-with-Trac-and-Subversion.jpg",
    "isbn_10": "1847191665",
    "language": "English",
    "pages": "120",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28073",
    "title": "Managing Software Development with Trac and Subversion",
    "top_category": "Web Development",
    "year": "2007",
    "id": 1
  },
  {
    "author": [
      "Antonio Lopez"
    ],
    "category": [
      "PHP"
    ],
    "description": "<p>PHP is a great language for building web applications. It is essentially a server-side scripting language that is also used for general purpose programming. PHP 7 is the latest version with a host of new features, and it provides major backwards-compatibility breaks.</p>\n<p>This book begins with the fundamentals of PHP programming by covering the basic concepts such as variables, functions, class, and objects. You will set up PHP server on your machine and learn to read and write procedural PHP code. After getting an understanding of OOP as a paradigm, you will execute MySQL queries on your database. Moving on, you will find out how to use MVC to create applications from scratch and add tests. Then, you will build REST APIs and perform behavioral tests on your applications.</p>\n<p>By the end of the book, you will have the skills required to read and write files, debug, test, and work with MySQL.</p>\n<p>What you will learn</p>\n<ul>\n<li>Set up a server on your machine with PHP</li>\n<li>Use PHP syntax with the built-in server to create apps</li>\n<li>Apply the OOP paradigm to PHP to write richer code</li>\n<li>Use MySQL to manage data in your web applications</li>\n<li>Create a web application from scratch using MVC</li>\n<li>Add tests to your web application and write testable code</li>\n<li>Use an existing PHP framework to build and manage your applications</li>\n<li>Build REST APIs for your PHP applications</li>\n<li>Test the behavior of web applications with Behat</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170827/Learning%20PHP%207.pdf",
    "file_format": "PDF",
    "file_size": "5.8 MB",
    "image": "Learning-PHP-7.jpg",
    "isbn_10": "1785880543",
    "language": "English",
    "pages": "414",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28029",
    "title": "Learning PHP 7",
    "top_category": "Web Development",
    "year": "2016",
    "id": 2
  },
  {
    "author": [
      "Jose Argudo"
    ],
    "category": [
      "Web Development"
    ],
    "description": "<p>This book is for developers who are new to CodeIgniter. Basic skills in PHP and MySQL are required, but only rudimentary object-oriented knowledge is needed. If you’re looking for a better way to develop PHP applications, or want to find out more about the CodeIgniter framework as a viable option for one of your own projects, this book will help you. This book takes a step- by-step approach, presenting the main features of CodeIgniter in a systematic way and explaining them clearly. It is packed with examples, ideas, and screenshots to help you master this great framework. The code examples are very practical so you can even use them in your own projects. By following this book, you can use CodeIgniter in the best possible way and maximize your learning.</p>",
    "download_link": "http://file.allitebooks.com/20170820/CodeIgniter%201.7.pdf",
    "file_format": "PDF",
    "file_size": "3.1 MB",
    "image": "CodeIgniter-1.7.jpg",
    "isbn_10": "1847199488",
    "language": "English",
    "pages": "300",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28002",
    "title": "CodeIgniter 1.7",
    "top_category": "Web Development",
    "year": "2009",
    "id": 3
  },
  {
    "author": [
      "Harry J.W. Percival"
    ],
    "category": [
      "Python"
    ],
    "description": "<p>By taking you through the development of a real web application from beginning to end, the second edition of this hands-on guide demonstrates the practical advantages of test-driven development (TDD) with Python. You’ll learn how to write and run tests&nbsp;before&nbsp;building each part of your app, and then develop the minimum amount of code required to pass those tests. The result? Clean code that works.</p>\n<p>In the process, you’ll learn the basics of Django, Selenium, Git, jQuery, and Mock, along with current web development techniques. If you’re ready to take your Python skills to the next level, this book—updated for Python 3.6—clearly demonstrates how TDD encourages simple designs and inspires confidence.</p>\n<ul>\n<li>Dive into the TDD workflow, including the unit test/code cycle and refactoring</li>\n<li>Use unit tests for classes and functions, and functional tests for user interactions within the browser</li>\n<li>Learn when and how to use mock objects, and the pros and cons of isolated vs. integrated tests</li>\n<li>Test and automate your deployments with a staging server</li>\n<li>Apply tests to the third-party plugins you integrate into your site</li>\n<li>Run tests automatically by using a Continuous Integration environment</li>\n<li>Use TDD to build a REST API with a front-end Ajax interface</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170822/Test-Driven%20Development%20with%20Python,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "11.6 MB",
    "image": "Test-Driven-Development-with-Python,-2nd-Edition.jpg",
    "isbn_10": "1491958707",
    "language": "English",
    "pages": "614",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28005",
    "title": "Test-Driven Development with Python, 2nd Edition",
    "top_category": "Web Development",
    "year": "2017",
    "id": 4
  },
  {
    "author": [
      "Adam Boduch"
    ],
    "category": [
      "JavaScript"
    ],
    "description": "<p>Whilst React has become Facebook’s poster-child for clean, complex, and modern web development, it has quietly been underpinned by its simplicity. It’s just a view. The real beauty in React is actually the architectural pattern that handles data in and out of React applications: Flux. With Flux, you’re able to build data-rich applications that engage your users, and scale to meet every demand. It is a key part of the Facebook technology stack that serves billions of users every day.</p>\n<p>This book will start by introducing the Flux pattern and help you get an understanding of what it is and how it works. After this, we’ll build real-world React applications that highlight the power and simplicity of Flux in action. Finally, we look at the landscape of Flux and explore the Alt and Redux libraries that make React and Flux developments easier.</p>\n<p>Filled with fully-worked examples and code-first explanations, by the end of the book, you’ll not only have a rock solid understanding of the architecture, but will be ready to implement Flux architecture in anger.</p>\n<p>What you will learn</p>\n<ul>\n<li>Understand the Flux pattern and how it will impact your React applications</li>\n<li>Build real-world applications that rely on Flux</li>\n<li>Handle asynchronous actions in your application</li>\n<li>Implement immutable stores with Immutable.js</li>\n<li>Replace React.js with alternate View components such as jQuery and Handlebars</li>\n<li>Test and benchmark your Flux architecture using Jest―Facebook’s enhancement of the Jasmine library</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170820/Flux%20Architecture.pdf",
    "file_format": "PDF",
    "file_size": "2.1 MB",
    "image": "Flux-Architecture.jpg",
    "isbn_10": "1786465817",
    "language": "English",
    "pages": "352",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27999",
    "title": "Flux Architecture",
    "top_category": "Web Development",
    "year": "2016",
    "id": 5
  },
  {
    "author": [
      "Bala Subrahmanyam Varanasi",
      "Rakesh Vidya Chandra"
    ],
    "category": [
      "Python"
    ],
    "description": "<p>Python is one of the most popular programming languages of our era; the Python Requests library is one of the world’s best clients, with the highest number of downloads. It allows hassle-free interactions with web applications using simple procedures.</p>\n<p>You will be shown how to mock HTTP Requests using HTTPretty, and will learn to interact with social media using Requests. This book will help you to grasp the art of web scraping with the BeautifulSoup and Python Requests libraries, and will then paddle you through Requests impressive ability to interact with APIs. It will empower you with the best practices for seamlessly drawing data from web apps. Last but not least, you will get the chance to polish your skills by implementing a RESTful Web API with Python and Flask!</p>\n<p>Who This Book Is For</p>\n<p>If you are a Python administrator or developer interested in interacting with web APIs and have a passion for creating your own web applications, this is the book for you. Basic knowledge of Python programming, APIs, and web services will be an advantage.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Demonstrate the use of Python Requests with the help of examples</li>\n<li>Use the Requests module to deal with the inner sections of the request-response cycles</li>\n<li>Implement the RESTful Web API with Python Requests</li>\n<li>Authenticate Requests using different authentication methods</li>\n<li>Emulate server actions and interact with a mock server</li>\n<li>Interact with social networking sites such as Facebook, Twitter, and reddit</li>\n<li>Scrape the Web with Python Requests and BeautifulSoup</li>\n<li>Build your own web application with Flask</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170813/Python%20Requests%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "1.2 MB",
    "image": "Python-Requests-Essentials.jpg",
    "isbn_10": "1784395412",
    "language": "English",
    "pages": "122",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27982",
    "title": "Python Requests Essentials",
    "top_category": "Web Development",
    "year": "2015",
    "id": 6
  },
  {
    "author": [
      "Swizec Teller",
      "Ændrew Rininsland"
    ],
    "category": [
      "Web Development"
    ],
    "description": "<p>D3 has emerged as one of the leading platforms to develop beautiful, interactive visualizations over the web. We begin by setting up a strong foundation, then build on this foundation book will take you through the entire world of reimagining data using interactive, animated visualizations created in D3.js.</p>\n<p>In addition to covering the various features of D3.js to build a wide range of visualizations, we also focus on the entire process of representing data through visualizations so that developers and those interested in data visualization will get the entire process right.</p>\n<p>We also include chapters that explore a wide range of visualizations through practical use cases. By the end of this book, you will have unlocked the mystery behind successful data visualizations and will be ready to use D3 to transform any data into a more engaging and sophisticated visualization.</p>\n<p>What you will learn</p>\n<ul>\n<li>Gain a solid understanding of the common D3 development idioms</li>\n<li>Be able to input data, transform it, and output it as a visualization</li>\n<li>Add simple effects and user interactions to a visualization</li>\n<li>Find out how to write basic D3 code for server using Node.js</li>\n<li>Automate testing visualizations using Mocha</li>\n<li>Achieve fluency in ES2015, the most modern version of JavaScript</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170812/Learning%20d3.js%20Data%20Visualization,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "8.1 MB",
    "image": "Learning-d3.js-Data-Visualization,-2nd-Edition.jpg",
    "isbn_10": "1785889044",
    "language": "English",
    "pages": "272",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27973",
    "title": "Learning d3.js Data Visualization, 2nd Edition",
    "top_category": "Web Development",
    "year": "2016",
    "id": 7
  },
  {
    "author": [
      "Pedro Teixeira"
    ],
    "category": [
      "JavaScript"
    ],
    "description": "<p>Node.js is a platform that lets you use JavaScript to easily program scalable network applications and web services. Learn about the main concepts behind Node.js to get you started with this exciting technology.</p>\n<p>Instant NodeJS Starter will begin with installation and your first Hello World HTTP server. This book will show you how you can use Node.js core modules and also how you can use patterns to create your own modules. It will also teach you about NPM and how you can use it to install any of the many available third-party libraries. The book then goes on to explain the three main patterns you need to understand to be able to fully use Node.js: the callback pattern, EventEmitter, and streams. All these patterns are presented with practical code examples that you can use immediately, getting you started quickly on this exciting technology.</p>\n<p>Instant NodeJS Starter starts with the installation of Node.js and then shows you how to create your first Node.js HTTP server. By showing you the main Node.js concepts together with some working code samples, by the end of the book you will have created a set of working Node.js scripts to create servers and clients.You will learn how you can include and use Node.js core modules, and how you can use patterns to create your own modules. You will also learn how you can use NPM to pick, install, and use any of the many available third-party modules in your applications. You will learn how you can use the callback pattern and EventEmitter to control the asynchronous flow and the power of Node.js streams to make your application more scalable and responsive.</p>\n<p>Instant Node.js Starter will show you the main concepts behind Node.js so that you feel comfortable to start building your scalable, event-driven network applications using JavaScript.</p>\n<p>What you will learn from this book</p>\n<ul>\n<li>Create your first Node.js HTTP server</li>\n<li>Include Node.js core modules</li>\n<li>Manage asynchronous flow using callback patterns</li>\n<li>Explore EventEmitter patterns</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170809/Instant%20Node.js%20Starter.pdf",
    "file_format": "PDF",
    "file_size": "0.9 MB",
    "image": "Instant-Node.js-Starter.jpg",
    "isbn_10": "1782165568",
    "language": "English",
    "pages": "48",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27928",
    "title": "Instant Node.js Starter",
    "top_category": "Web Development",
    "year": "2013",
    "id": 8
  },
  {
    "author": [
      "Andrew Psaltis"
    ],
    "category": [
      "Web Development"
    ],
    "description": "<p>Streaming Data&nbsp;introduces the concepts and requirements of streaming and real-time data systems. The book is an idea-rich tutorial that teaches you to think about how to efficiently interact with fast-flowing data.</p>",
    "download_link": "http://file.allitebooks.com/20170805/Streaming%20Data.pdf",
    "file_format": "PDF",
    "file_size": "3.7 MB",
    "image": "Streaming-Data.jpg",
    "isbn_10": "1617292281",
    "language": "English",
    "pages": "216",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27919",
    "title": "Streaming Data",
    "top_category": "Web Development",
    "year": "2017",
    "id": 9
  },
  {
    "author": [
      "Luis Atencio",
      "Paul P. Daniels"
    ],
    "category": [
      "JavaScript"
    ],
    "description": "<p>RxJS in Action&nbsp;gives you the development skills you need to create reactive applications with RxJS. This book is full of theory and practical examples that build on each other and help you begin thinking in a reactive manner. Foreword by Ben Lesh, Project lead, RxJS 5.</p>",
    "download_link": "http://file.allitebooks.com/20170805/RxJS%20in%20Action.pdf",
    "file_format": "PDF",
    "file_size": "16.1 MB",
    "image": "RxJS-in-Action.jpg",
    "isbn_10": "1617293415",
    "language": "English",
    "pages": "352",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27916",
    "title": "RxJS in Action",
    "top_category": "Web Development",
    "year": "2017",
    "id": 10
  },
  {
    "author": [
      "Pradeep Macharla"
    ],
    "category": [
      "Programming"
    ],
    "description": "<div>Master continuous integration, deployment and automated testing for Android apps. You’ll see how to set up and tear down sandbox environments to test the end-user experience, where you’ll learn how to manage a mobile device in addition to the build machine.&nbsp;Android Continuous Integration&nbsp;applies a real-world CI pattern that has been thoroughly tested and implemented.<p></p>\n</div>\n<div></div>\n<div>This book starts with continuous integration concepts and the tools and code needed to become proficient in continuous integration for Android apps. You’ll also follow acceptance test driven development (ATDD) best practice, giving you all the skills you need to become a better, more effective developer. Finally, you’ll learn about the Appium mobile automation library and the Jenkins continuous integration tool.<p></p>\n</div>\n<div></div>\n<div>What You Will Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Understand how to build an Android mobile app from source</li>\n<li>Set up a development or debuggi</li>\n</ul>\n</div>\n<p>ng environment for mobile apps</p>\n<ul>\n<li>Integrate with the Nexus dependency management and application release tool</li>\n<li>Work with the SonarQube code quality analyzer</li>\n<li>Use debugging tools in Android</li>\n</ul>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>Product owners/business analysts, QA/test engineers, developers and build/deploy engineers.</div>",
    "download_link": "http://file.allitebooks.com/20170826/Android%20Continuous%20Integration.pdf",
    "file_format": "PDF",
    "file_size": "7.8 MB",
    "image": "Android-Continuous-Integration.jpg",
    "isbn_10": "1484227956",
    "language": "English",
    "pages": "141",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28017",
    "title": "Android Continuous Integration",
    "top_category": "Programming",
    "year": "2017",
    "id": 11
  },
  {
    "author": [
      "Bryan WC Chung"
    ],
    "category": [
      "Programming"
    ],
    "description": "<div>Apply the Processing language to tasks involved in computer vision–tasks such as edge and corner detection, recognition of motion between frames in a video, recognition of objects, matching of feature points and shapes in different frames for tracking purposes, and more. You will manipulate images through creative effects, geometric transformation, blending of multiple images, and so forth. Examples are provided.</div>\n<div></div>\n<div>Pro Processing for Images and Computer Vision with OpenCV&nbsp;is a step-by-step training tool that guides you through a series of worked examples in linear order. Each chapter begins with a basic demonstration, including the code to recreate it on your own system. Then comes a creative challenge by which to engage and develop mastery of the chapter’s topic. The book also includes hints and tips relating to visual arts, interaction design, and industrial best practices.</div>\n<div></div>\n<div>This book is intended for any developer of artistic and otherwise visual applications, such as in augmented reality and digital effects, with a need to manipulate images, and to recognize and manipulate objects within those images. The book is specifically targeted at those making use of the Processing language that is common in artistic fields, and to Java programmers because of Processing’s easy integration into the Java programming environment.</div>\n<div></div>\n<div>What You’ll Learn</div>\n<div>\n<div>\n<ul>\n<li>Make use of OpenCV, the open source library for computer vision in the Processing environment</li>\n<li>Capture live video streams and examine them frame-by-frame for objects in motion</li>\n<li>Recognize shapes and objects through techniques of detecting lines, edges, corners, and more</li>\n<li>Transform images by scaling, translating, rotating, and additionally through various distortion effects</li>\n<li>Apply techniques such as background subtraction to isolate motion of objects in live video streams</li>\n<li>Detect and track human faces and other objects by matching feature points in different images or video frames</li>\n</ul>\n</div>\n<div></div>\n</div>\n<div>Who This Book Is For</div>\n<div></div>\n<div>Media artists, designers, and creative coders</div>",
    "download_link": "http://file.allitebooks.com/20170827/Pro%20Processing%20for%20Images%20and%20Computer%20Vision%20with%20OpenCV.pdf",
    "file_format": "PDF",
    "file_size": "11.6 MB",
    "image": "Pro-Processing-for-Images-and-Computer-Vision-with-OpenCV.jpg",
    "isbn_10": "1484227743",
    "language": "English",
    "pages": "292",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28026",
    "title": "Pro Processing for Images and Computer Vision with OpenCV",
    "top_category": "Programming",
    "year": "2017",
    "id": 12
  },
  {
    "author": [
      "Mark McDonnell"
    ],
    "category": [
      "Programming"
    ],
    "description": "<div>Get up to speed with Clojure in this quick and practical primer. You’ll learn the nuts and bolts of functional programming, data structures, sequences, destructuring, pattern matching, polymorphism, concurrency, conventions, and more. Author Mark McDonnell talks about organization with namespaces; how to change the language via macros; object-oriented programming; and creating command-line apps. Finally, he shows you how to write Clojure from shell languages and interfaces such as Vim.<p></p>\n</div>\n<div></div>\n<div>After reading and using&nbsp;Quick Clojure, you’ll come away with first-hand knowledge and advice on how to quickly adopt, use, and apply Clojure without all the theoretical baggage that bigger books can sometimes bring.<p></p>\n</div>\n<div></div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Work with data structures and their syntax</li>\n<li>Discover OOP in Clojure with patterns, polymorphisms, pattern matching, and concurrency</li>\n<li>Use conventions, organization, and namespaces in Clojure</li>\n<li>Create command-line apps</li>\n<li>Build various Clojure projects with the Leiningen IDE tool and framework</li>\n</ul>\n</div>\n<div></div>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>Programmers with experience. &nbsp;A Java background would be helpful, but not required.</div>",
    "download_link": "http://file.allitebooks.com/20170825/Quick%20Clojure.pdf",
    "file_format": "PDF",
    "file_size": "2.3 MB",
    "image": "Quick-Clojure.jpg",
    "isbn_10": "1484229517",
    "language": "English",
    "pages": "200",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28008",
    "title": "Quick Clojure",
    "top_category": "Programming",
    "year": "2017",
    "id": 13
  },
  {
    "author": [
      "Jagdeep Jain",
      "Sai Matam"
    ],
    "category": [
      "Programming"
    ],
    "description": "<p>Quickly ramp up your practical knowledge of Apache JMeter for software performance testing and focus on actual business problems. This step-by-step guide covers what you will need to know to write and execute test scripts, and verify the results.</p>\n<p>Pro Apache JMeter&nbsp;covers almost every aspect of Apache JMeter in detail and includes helpful screenshots and a case study. A performance primer chapter provides a high-level summary of terms used in performance testing on a day-to-day basis that also is useful for non-technical readers.</p>\n<p>A sample web application Digital Toys has been developed and test scripts are provided for you to try while progressing through the chapters.</p>\n<p>What You’ll Learn</p>\n<ul>\n<li>Create and execute an Apache JMeter test plan</li>\n<li>Interpret the results of your test plan</li>\n<li>Understand distributed testing using Apache JMeter</li>\n<li>Use Apache JMeter advanced features such as JDBC, REST, FTP, AJAX, SOAP, and mobile performance testing</li>\n<li>Read a sample case study covering end-to-end planning and execution of a performance testing project</li>\n<li>Generate and analyze a performance dashboard</li>\n</ul>\n<p>Who This Book Is For</p>\n<p>Software performance testing professionals, quality assurance professionals, architects, engineers, project managers, product managers</p>",
    "download_link": "http://file.allitebooks.com/20170818/Pro%20Apache%20JMeter.pdf",
    "file_format": "PDF",
    "file_size": "21.3 MB",
    "image": "Pro-Apache-JMeter.jpg",
    "isbn_10": "1484229606",
    "language": "English",
    "pages": "335",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27993",
    "title": "Pro Apache JMeter",
    "top_category": "Programming",
    "year": "2017",
    "id": 14
  },
  {
    "author": [
      "Nishith Pathak"
    ],
    "category": [
      ".NET"
    ],
    "description": "<div>\n<div>\n<p>Get introduced to the world of artificial intelligence with this accessible and practical guide. Build applications that make intelligent use of language and user interaction to better compete in today’s marketplace. Discover how your application can deeply understand and interpret content on the web or a user’s machine, intelligently react to direct user interaction through speech or text, or make smart recommendations on products or services that are tailored to each individual user.</p>\n<p>With Microsoft Cognitive Services, you can do all this and more utilizing a set of easy-to-use APIs that can be consumed on the desktop, web, or mobile devices. Developers normally think of AI implementation as a tough task involving writing complex algorithms. This book aims to remove the anxiety by creating a cognitive application with a few lines of code. There is a wide range of Cognitive Services APIs available. This book focuses on some of the most useful and powerful ways that your application can make intelligent use of language.</p>\n<p>Artificial Intelligence for .NET: Speech, Language, and Search&nbsp;will show you how you can start building amazing capabilities into your applications today.</p>\n</div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Understand the underpinnings of artificial intelligence through practical examples and scenarios</li>\n<li>Get started building an AI-based application in Visual Studio</li>\n<li>Build a text-based conversational interface for direct user interaction</li>\n<li>Use the Cognitive Services Speech API to recognize and interpret speech</li>\n<li>Look at different models of language, including natural language processing, and how to apply them in your Visual Studio application</li>\n<li>Reuse Bing search capabilities to better understand a user’s intention</li>\n<li>Work with recommendation engines and integrate them into your apps</li>\n</ul>\n</div>\n<div></div>\n</div>\n<div>Who This Book Is For<p></p>\n</div>\n<div>Developers working on a range of platforms, from .NET and Windows to mobile devices. Examples are given in C#. No prior experience with AI techniques or theory is required.</div>",
    "download_link": "http://file.allitebooks.com/20170817/Artificial%20Intelligence%20for%20.NET.pdf",
    "file_format": "PDF",
    "file_size": "9.1 MB",
    "image": "Artificial-Intelligence-for-.NET.jpg",
    "isbn_10": "1484229487",
    "language": "English",
    "pages": "264",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27988",
    "title": "Artificial Intelligence for .NET",
    "top_category": "Programming",
    "year": "2017",
    "id": 15
  },
  {
    "author": [
      "James Cabrera"
    ],
    "category": [
      "Programming",
      "Administration"
    ],
    "description": "<div>\n<p>Learn the basic principles of modular design, and then put them into action to create sites that are easy to use, look great, and can be adapted within the context of your business needs.</p>\n<p>With author James Cabrera―one of the thought leaders in the modular-design movement―you’ll create a single, scalable project for a sample nameplate site and then adapt that same project to work successfully as a portfolio site, an e-commerce site, and finally as a news/publishing content site. Along the way, you’ll learn the scientific approach to devising a sound and scalable design strategy, followed by establishing a basic foundation using various criteria relevant to that type of site. As each chapter progresses, you’ll add new concepts appropriate for the project type.</p>\n<p>Modular web and app design isn’t just for so-called “creatives.” It’s a teachable science with principles that can be replicated in a creative manner. This approach makes the design decision making process for businesses much easier (and easier to live with). And modular design is a powerful tool for software designers to replicate effective successful designs across a spectrum of needs.</p>\n</div>\n<div>\n<div>What You’ll Learn</div>\n<div>\n</div>\n<div>\n<ul>\n<li>Examine the design process in a modular way</li>\n<li>Adapt your&nbsp;HTML code to create different types of applications</li>\n<li>Establish your own modular framework for your specific site’s goals</li>\n<li>Design for scale</li>\n<li>Develop a strong foundation skeleton for design</li>\n</ul>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>User&nbsp;experience designers, user interface designers, information architects, developers with an interest in design, developers who want to create their own design frameworks.</div>\n</div>\n</div>",
    "download_link": "http://file.allitebooks.com/20170811/Modular%20Design%20Frameworks.pdf",
    "file_format": "PDF",
    "file_size": "3.7 MB",
    "image": "Modular-Design-Frameworks.jpg",
    "isbn_10": "1484216873",
    "language": "English",
    "pages": "86",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27944",
    "title": "Modular Design Frameworks",
    "top_category": "Programming",
    "year": "2017",
    "id": 16
  },
  {
    "author": [
      "Paul Kimmel"
    ],
    "category": [
      "Programming"
    ],
    "description": "<p>There’s no easier, faster, or more practical way to learn the really tough subjects</p>\n<p>UML Demystified&nbsp;explains how to read, model, and use UML to create well-structured, stable software products. This self-teaching guide comes complete with key points, background information, quizzes at the end of each chapter, and even a final exam. Simple enough for beginners but challenging enough for advanced students, this is a lively and entertaining brush-up, introductory text, or classroom supplement.</p>",
    "download_link": "http://file.allitebooks.com/20170802/UML%20Demystified.pdf",
    "file_format": "PDF",
    "file_size": "11.7 MB",
    "image": "UML-Demystified.jpg",
    "isbn_10": "007226182X",
    "language": "English",
    "pages": "235",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27907",
    "title": "UML Demystified",
    "top_category": "Programming",
    "year": "2005",
    "id": 17
  },
  {
    "author": [
      "Barry A. Burd"
    ],
    "category": [
      "Java"
    ],
    "description": "<p>Develop the next killer Android App using Java programming!</p>\n<p>Android is everywhere! It runs more than half the smartphones in the U.S.—and Java makes it go. If you want to cash in on its popularity by learning to build Android apps with Java, all the easy-to-follow guidance you need to get started is at your fingertips. Inside, you’ll learn the basics of Java and grasp how it works with Android; then, you’ll go on to create your first real, working application. How cool is that?</p>\n<p>The demand for Android apps isn’t showing any signs of slowing, but if you’re a mobile developer who wants to get in on the action, it’s vital that you get the necessary Java background to be a success. With the help of&nbsp;Java Programming for Android Developers For Dummies, you’ll quickly and painlessly discover the ins and outs of using Java to create groundbreaking Android apps—no prior knowledge or experience required!</p>\n<ul>\n<li>Get the know-how to create an Android program from the ground up</li>\n<li>Make sense of basic Java development concepts and techniques</li>\n<li>Develop the skills to handle programming challenges</li>\n<li>Find out how to debug your app</li>\n</ul>\n<p>Don’t sit back and watch other developers release apps that bring in the bucks! Everything you need to create that next killer Android app is just a page away!</p>",
    "download_link": "http://file.allitebooks.com/20170801/Java%20Programming%20for%20Android%20Developers%20For%20Dummies,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "13.7 MB",
    "image": "Java-Programming-for-Android-Developers-For-Dummies,-2nd-Edition.jpg",
    "isbn_10": "1119301084",
    "language": "English",
    "pages": "456",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27903",
    "title": "Java Programming for Android Developers For Dummies, 2nd Edition",
    "top_category": "Programming",
    "year": "2016",
    "id": 18
  },
  {
    "author": [
      "Shirish Chavan"
    ],
    "category": [
      "C C++"
    ],
    "description": "<div>\n<p>Solve your C programming problems with practical and informative recipes. This book covers various aspects of C programming including the fundamentals of C, operators and expressions, control statements, recursion, and user-defined functions. Each chapter contains a series of recipes that you can easily reference to quickly find the answers you are looking for.</p>\n<p>C Recipes&nbsp;also contains recipes and solutions for problems in memory management, arrays, standard input and output, structures and unions, pointers, self-referential structures, data files, pre-processor directives, and library functions.</p>\n</div>\n<div></div>\n<div>What You Will Learn<p></p>\n</div>\n<div>\n<div>\n<ul>\n<li>Master operators and expressions</li>\n<li>Write user-defined functions</li>\n<li>Work with structures and unions</li>\n<li>Use pointers</li>\n<li>Define self referential structures</li>\n<li>Leverage library functions</li>\n</ul>\n<div></div>\n</div>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>Those with some experience in C programming.</div>\n</div>",
    "download_link": "http://file.allitebooks.com/20170729/C%20Recipes.pdf",
    "file_format": "PDF",
    "file_size": "6.1 MB",
    "image": "C-Recipes.jpg",
    "isbn_10": "1484229665",
    "language": "English",
    "pages": "446",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27890",
    "title": "C Recipes",
    "top_category": "Programming",
    "year": "2017",
    "id": 19
  },
  {
    "author": [
      "Cay S. Horstmann"
    ],
    "category": [
      "Java"
    ],
    "description": "<p>Interest in the Scala programming language continues to grow for many reasons. Scala embraces the functional programming style without abandoning the object-oriented paradigm, and it allows you to write programs more concisely than in Java. Because Scala runs on the JVM, it can access any Java library and is interoperable with familiar Java frameworks. Scala also makes it easier to leverage the full power of concurrency.</p>\n<p>Written for experienced Java, C++, or C# programmers who are new to Scala or functional programming,&nbsp;Scala for the Impatient, Second Edition,&nbsp;introduces the key Scala concepts and techniques you need in order to be productive quickly. It is the perfect introduction to the language, particularly for impatient readers who want to learn the fundamentals of Scala so they can start coding quickly. It doesn’t attempt to exhaustively list all the features of the language or make you suffer through long and contrived examples. Instead, carefully crafted examples and hands-on activities guide you through well-defined stages of competency, from basic to expert.</p>\n<p>This revised edition has been thoroughly updated for Scala 2.12 and reflects current Scala usage. It includes added coverage of recent Scala features, including string interpolation, dynamic invocation, implicit classes, and futures. Scala is a big language, but you can use it effectively without knowing all of its details intimately. This title provides precisely the information that you need to get started in compact, easy-to-understand chunks.</p>\n<ul>\n<li>Get started quickly with Scala’s interpreter, syntax, tools, and unique idioms</li>\n<li>Master core language features: functions, arrays, maps, tuples, packages, imports, exception handling, and more</li>\n<li>Become familiar with object-oriented programming in Scala: classes, inheritance, and traits</li>\n<li>Use Scala for real-world programming tasks: working with files, regular expressions, and XML</li>\n<li>Work with higher-order functions and the powerful Scala collections library</li>\n<li>Leverage Scala’s powerful pattern matching and case classes</li>\n<li>Create concurrent programs with Scala futures</li>\n<li>Implement domain-specific languages</li>\n<li>Understand the Scala type system</li>\n<li>Apply advanced “power tools,” such as annotations, implicits, and type classes</li>\n</ul>\n<p>Register your product at informit.com/register for convenient access to downloads, updates, and corrections as they become available.</p>",
    "download_link": "http://file.allitebooks.com/20170728/Scala%20for%20the%20Impatient,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "15.5 MB",
    "image": "Scala-for-the-Impatient,-2nd-Edition.jpg",
    "isbn_10": "0134540565",
    "language": "English",
    "pages": "384",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27887",
    "title": "Scala for the Impatient, 2nd Edition",
    "top_category": "Programming",
    "year": "2016",
    "id": 20
  },
  {
    "author": [
      "Eben Hewitt",
      "Jeff Carpenter"
    ],
    "category": [
      "Databases"
    ],
    "description": "<p>Imagine what you could do if scalability wasn’t a problem. With this hands-on guide, you’ll learn how the Cassandra database management system handles hundreds of terabytes of data while remaining highly available across multiple data centers. This expanded second edition—updated for Cassandra 3.0—provides the technical details and practical examples you need to put this database to work in a production environment.</p>\n<p>Authors Jeff Carpenter and Eben Hewitt demonstrate the advantages of Cassandra’s non-relational design, with special attention to data modeling. If you’re a developer, DBA, or application architect looking to solve a database scaling issue or future-proof your application, this guide helps you harness Cassandra’s speed and flexibility.</p>\n<ul>\n<li>Understand Cassandra’s distributed and decentralized structure</li>\n<li>Use the Cassandra Query Language (CQL) and&nbsp;cqlsh—the CQL shell</li>\n<li>Create a working data model and compare it with an equivalent relational model</li>\n<li>Develop sample applications using client drivers for languages including Java, Python, and Node.js</li>\n<li>Explore cluster topology and learn how nodes exchange data</li>\n<li>Maintain a high level of performance in your cluster</li>\n<li>Deploy Cassandra on site, in the Cloud, or with Docker</li>\n<li>Integrate Cassandra with Spark, Hadoop, Elasticsearch, Solr, and Lucene</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170901/Cassandra%20The%20Definitive%20Guide,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "7.8 MB",
    "image": "Cassandra:-The-Definitive-Guide,-2nd-Edition.jpg",
    "isbn_10": "1491933666",
    "language": "English",
    "pages": "370",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28050",
    "title": "Cassandra: The Definitive Guide, 2nd Edition",
    "top_category": "Databases",
    "year": "2016",
    "id": 21
  },
  {
    "author": [
      "Matthew Kirk"
    ],
    "category": [
      "Data Mining"
    ],
    "description": "<p>Gain the confidence you need to apply machine learning in your daily work. With this practical guide, author Matthew Kirk shows you how to integrate and test machine learning algorithms in your code, without the academic subtext.</p>\n<p>Featuring graphs and highlighted code examples throughout, the book features tests with Python’s Numpy, Pandas, Scikit-Learn, and SciPy data science libraries. If you’re a software engineer or business analyst interested in data science, this book will help you:</p>\n<ul>\n<li>Reference real-world examples to test each algorithm through engaging, hands-on exercises</li>\n<li>Apply test-driven development (TDD) to write and run tests before you start coding</li>\n<li>Explore techniques for improving your machine-learning models with data extraction and feature development</li>\n<li>Watch out for the risks of machine learning, such as underfitting or overfitting data</li>\n<li>Work with K-Nearest Neighbors, neural networks, clustering, and other algorithms</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170831/Thoughtful%20Machine%20Learning%20with%20Python.pdf",
    "file_format": "PDF",
    "file_size": "8.6 MB",
    "image": "Thoughtful-Machine-Learning-with-Python.jpg",
    "isbn_10": "1491924136",
    "language": "English",
    "pages": "216",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28047",
    "title": "Thoughtful Machine Learning with Python",
    "top_category": "Databases",
    "year": "2017",
    "id": 22
  },
  {
    "author": [
      "Holden Karau",
      "Rachel Warren"
    ],
    "category": [
      "Databases"
    ],
    "description": "<p>Apache Spark is amazing when everything clicks. But if you haven’t seen the performance improvements you expected, or still don’t feel confident enough to use Spark in production, this practical book is for you. Authors Holden Karau and Rachel Warren demonstrate performance optimizations to help your Spark queries run faster and handle larger data sizes, while using fewer resources.</p>\n<p>Ideal for software engineers, data engineers, developers, and system administrators working with large-scale data applications, this book describes techniques that can reduce data infrastructure costs and developer hours. Not only will you gain a more comprehensive understanding of Spark, you’ll also learn how to make it sing.</p>\n<p>With this book, you’ll explore:</p>\n<ul>\n<li>How Spark SQL’s new interfaces improve performance over SQL’s RDD data structure</li>\n<li>The choice between data joins in Core Spark and Spark SQL</li>\n<li>Techniques for getting the most out of standard RDD transformations</li>\n<li>How to work around performance issues in Spark’s key/value pair paradigm</li>\n<li>Writing high-performance Spark code without Scala or the JVM</li>\n<li>How to test for functionality and performance when applying suggested improvements</li>\n<li>Using Spark MLlib and Spark ML machine learning libraries</li>\n<li>Spark’s Streaming components and external community packages</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170831/High%20Performance%20Spark.pdf",
    "file_format": "PDF",
    "file_size": "7.1 MB",
    "image": "High-Performance-Spark.jpg",
    "isbn_10": "1491943203",
    "language": "English",
    "pages": "358",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28044",
    "title": "High Performance Spark",
    "top_category": "Databases",
    "year": "2017",
    "id": 23
  },
  {
    "author": [
      "Joshua Cook"
    ],
    "category": [
      "Data Processing"
    ],
    "description": "<div>Learn Docker “infrastructure as code” technology to define a system for performing standard but non-trivial data tasks on medium- to large-scale data sets, using Jupyter as the master controller.<p></p>\n</div>\n<div></div>\n<div>It is not uncommon for a real-world data set to fail to be easily managed. The set may not fit well into access memory or may require prohibitively long processing. These are significant challenges to skilled software engineers and they can render the standard Jupyter system unusable.<p></p>\n</div>\n<div></div>\n<div>As a solution to this problem,&nbsp;Docker for Data Science&nbsp;proposes using Docker. You will learn how to use existing pre-compiled public images created by the major open-source technologies―Python, Jupyter, Postgres―as well as using the Dockerfile to extend these images to suit your specific purposes. The Docker-Compose technology is examined and you will learn how it can be used to build a linked system with Python churning data behind the scenes and Jupyter managing these background tasks. Best practices in using existing images are explored as well as developing your own images to deploy state-of-the-art machine learning and optimization algorithms.<p></p>\n</div>\n<div></div>\n<div>\n<div>What &nbsp;You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Master interactive development using the Jupyter platform</li>\n<li>Run and build Docker containers from scratch and from publicly available open-source images</li>\n<li>Write infrastructure as code using the docker-compose tool and its docker-compose.yml file type</li>\n<li>Deploy a multi-service data science application&nbsp;across a cloud-based system</li>\n</ul>\n<div></div>\n</div>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>\n<div>Data scientists, machine learning engineers, artificial intelligence researchers,&nbsp;Kagglers, and software developers</div>\n</div>\n</div>",
    "download_link": "http://file.allitebooks.com/20170825/Docker%20for%20Data%20Science.pdf",
    "file_format": "PDF",
    "file_size": "7.1 MB",
    "image": "Docker-for-Data-Science.jpg",
    "isbn_10": "1484230116",
    "language": "English",
    "pages": "257",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28012",
    "title": "Docker for Data Science",
    "top_category": "Databases",
    "year": "2017",
    "id": 24
  },
  {
    "author": [
      "Bihag Thaker",
      "Ritesh Shah"
    ],
    "category": [
      "SQL"
    ],
    "description": "<p>As a DBA you must have encountered a slow running application on SQL Server, but there are various factors that could be affecting the performance. If you find yourself in this situation, don’t wait, pick up this book and start working towards improving performance of your SQL Server 2012. SQL Server 2012 Performance Tuning Cookbook is divided into three major parts — Performance Monitoring, Performance Tuning, and Performance Management–that are mandatory to deal with performance in any capacity.</p>\n<p>SQL Server 2012 Performance Tuning Cookbook offers a great way to manage performance with effective, concise, and practical recipes. You will learn how to diagnose performance issues, fix them, and take precaution to avoid common mistakes.</p>\n<p>Each recipe given in this book is an individual task that will address different performance aspects to take your SQL Server’s Performance to a higher level.</p>\n<p>The first part of this book covers Monitoring with SQL Server Profiler, DTA, System statistical function, SPs with DBCC commands, Resource Monitor &amp; Reliability, and Performance Monitor and Execution Plan.</p>\n<p>The second part of the book offers Execution Plan, Dynamic Management Views, and Dynamic Management Functions, SQL Server Cache and Stored Procedure Recompilations, Indexes, Important ways to write effective TSQL, Statistics, Table and Index Partitioning, Advanced Query tuning with Query Hints and Plan Guide, Dealing with Locking, Blocking and Deadlocking and Configuring SQL Server for optimization to boost performance.</p>\n<p>The third and final part gives you knowledge of performance management with help of Policy Based Management and Management with Resource Governor.</p>\n<p>What will you learn from this book</p>\n<ul>\n<li>Monitoring SQL Server Performance with Profiler, Execution Plan, and system statistical function</li>\n<li>Finding performance bottleneck with the help of Resource Monitor and DTA</li>\n<li>Creating and Managing Indexes efficiently to boost performance</li>\n<li>Creating and Managing Partition efficiently</li>\n<li>Managing database files efficiently</li>\n<li>Planning Guide and Query Hints</li>\n<li>Dealing with locking, blocking, and deadlocking</li>\n<li>Configuring SQL Server instance option for achieving performance benefit</li>\n<li>Managing Performance with Policy based management and Resource Governor</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170814/Microsoft%20SQL%20Server%202012%20Performance%20Tuning%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "8.9 MB",
    "image": "Microsoft-SQL-Server-2012-Performance-Tuning-Cookbook.jpg",
    "isbn_10": "1849685746",
    "language": "English",
    "pages": "478",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27985",
    "title": "Microsoft SQL Server 2012 Performance Tuning Cookbook",
    "top_category": "Databases",
    "year": "2012",
    "id": 25
  },
  {
    "author": [
      "Adam Gibson",
      "Josh Patterson"
    ],
    "category": [
      "Data Mining"
    ],
    "description": "<p>Although interest in machine learning has reached a high point, lofty expectations often scuttle projects before they get very far. How can machine learning—especially deep neural networks—make a real difference in your organization? This hands-on guide not only provides the most practical information available on the subject, but also helps you get started building efficient deep learning networks.</p>\n<p>Authors Adam Gibson and Josh Patterson provide theory on deep learning before introducing their open-source Deeplearning4j (DL4J) library for developing production-class workflows. Through real-world examples, you’ll learn methods and strategies for training deep network architectures and running deep learning workflows on Spark and Hadoop with DL4J.</p>\n<ul>\n<li>Dive into machine learning concepts in general, as well as deep learning in particular</li>\n<li>Understand how deep networks evolved from neural network fundamentals</li>\n<li>Explore the major deep network architectures, including Convolutional and Recurrent</li>\n<li>Learn how to map specific deep networks to the right problem</li>\n<li>Walk through the fundamentals of tuning general neural networks and specific deep network architectures</li>\n<li>Use vectorization techniques for different data types with DataVec, DL4J’s workflow tool</li>\n<li>Learn how to use DL4J natively on Spark and Hadoop</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170813/Deep%20Learning.pdf",
    "file_format": "PDF",
    "file_size": "19.8 MB",
    "image": "Deep-Learning.jpg",
    "isbn_10": "1491914254",
    "language": "English",
    "pages": "536",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27976",
    "title": "Deep Learning",
    "top_category": "Databases",
    "year": "2017",
    "id": 26
  },
  {
    "author": [
      "Andy Leonard",
      "Jessica M. Moss",
      "Matt Masson",
      "Michelle Ufford",
      "Tim Mitchell"
    ],
    "category": [
      "Databases",
      "Computer Science"
    ],
    "description": "<p>SQL Server 2012 Integration Services Design Patterns&nbsp;is a book of recipes for SQL Server Integration Services (SSIS). Design patterns&nbsp;in the book show how to&nbsp;solve common problems encountered when developing data integration solutions.&nbsp;Because you do not have to build the code from scratch each time, using design patterns improves your efficiency as an SSIS developer. In&nbsp;SSIS Design Patterns, we take you through several of these snippets in detail, providing the technical details of the resolution.</p>\n<p>SQL Server 2012 Integration Services Design Patterns&nbsp;does not focus on the problems to be solved; instead, the book delves into why particular problems should be solved in certain ways. You’ll learn more about SSIS as a result, and you’ll learn by practical example. Where appropriate,&nbsp;SQL Server 2012 Integration Services Design Patternsprovides examples of alternative patterns and discusses when and where they should be used. Highlights of the book include sections on ETL Instrumentation, SSIS Frameworks, and Dependency Services.</p>\n<ul>\n<li>Takes you through solutions to several common data integration challenges</li>\n<li>Demonstrates new features in SQL Server 2012 Integration Services</li>\n<li>Teaches SSIS using practical examples</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170811/SQL%20Server%202012%20Integration%20Services%20Design%20Patterns.pdf",
    "file_format": "PDF",
    "file_size": "41.9 MB",
    "image": "SQL-Server-2012-Integration-Services-Design-Patterns.jpg",
    "isbn_10": "1430237716",
    "language": "English",
    "pages": "456",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27940",
    "title": "SQL Server 2012 Integration Services Design Patterns",
    "top_category": "Databases",
    "year": "2012",
    "id": 27
  },
  {
    "author": [
      "Michael R. Brzustowicz PhD"
    ],
    "category": [
      "Data Mining"
    ],
    "description": "<p>Data Science is booming thanks to R and Python, but Java brings the robustness, convenience, and ability to scale critical to today’s data science applications. With this practical book, Java software engineers looking to add data science skills will take a logical journey through the data science pipeline. Author Michael Brzustowicz explains the basic math theory behind each step of the data science process, as well as how to apply these concepts with Java.</p>\n<p>You’ll learn the critical roles that data IO, linear algebra, statistics, data operations, learning and prediction, and Hadoop MapReduce play in the process. Throughout this book, you’ll find code examples you can use in your applications.</p>\n<ul>\n<li>Examine methods for obtaining, cleaning, and arranging data into its purest form</li>\n<li>Understand the matrix structure that your data should take</li>\n<li>Learn basic concepts for testing the origin and validity of data</li>\n<li>Transform your data into stable and usable numerical values</li>\n<li>Understand supervised and unsupervised learning algorithms, and methods for evaluating their success</li>\n<li>Get up and running with MapReduce, using customized components suitable for data science algorithms</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170728/Data%20Science%20with%20Java%20Practical%20Methods%20for%20Scientists%20and%20Engineers.pdf",
    "file_format": "PDF",
    "file_size": "7.1 MB",
    "image": "Data-Science-with-Java.jpg",
    "isbn_10": "1491934115",
    "language": "English",
    "pages": "236",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27881",
    "title": "Data Science with Java",
    "top_category": "Databases",
    "year": "2017",
    "id": 28
  },
  {
    "author": [
      "Andrew Bruce",
      "Peter Bruce"
    ],
    "category": [
      "Databases"
    ],
    "description": "<p>Statistical methods are a key part of of data science, yet very few data scientists have any formal statistics training. Courses and books on basic statistics rarely cover the topic from a data science perspective. This practical guide explains how to apply various statistical methods to data science, tells you how to avoid their misuse, and gives you advice on what’s important and what’s not.</p>\n<p>Many data science resources incorporate statistical methods but lack a deeper statistical perspective. If you’re familiar with the R programming language, and have some exposure to statistics, this quick reference bridges the gap in an accessible, readable format.</p>\n<p>With this book, you’ll learn:</p>\n<ul>\n<li>Why exploratory data analysis is a key preliminary step in data science</li>\n<li>How random sampling can reduce bias and yield a higher quality dataset, even with big data</li>\n<li>How the principles of experimental design yield definitive answers to questions</li>\n<li>How to use regression to estimate outcomes and detect anomalies</li>\n<li>Key classification techniques for predicting which categories a record belongs to</li>\n<li>Statistical machine learning methods that “learn” from data</li>\n<li>Unsupervised learning methods for extracting meaning from unlabeled data</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170726/Practical%20Statistics%20for%20Data%20Scientists.pdf",
    "file_format": "PDF",
    "file_size": "13.7 MB",
    "image": "Practical-Statistics-for-Data-Scientists.jpg",
    "isbn_10": "1491952962",
    "language": "English",
    "pages": "318",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27868",
    "title": "Practical Statistics for Data Scientists",
    "top_category": "Databases",
    "year": "2017",
    "id": 29
  },
  {
    "author": [
      "Saptaparna Mukherjee (Das)",
      "Suman Mukherjee"
    ],
    "category": [
      "Data Processing"
    ],
    "description": "<div>\n<div>Leverage the flexibility and power of SAP MII to integrate your business operations with your manufacturing processes. You’ll explore important new features of the product and see how to apply best practices to connect all the stakeholders in your business.<p></p>\n</div>\n<div></div>\n<div>This book&nbsp;starts with an overview of SAP’s manufacturing integration and intelligence application and explains why it is so important. You’ll then see how it is applied in various manufacturing sectors.<p></p>\n</div>\n<div></div>\n<div>The biggest challenge in manufacturing industries is to reduce the manual work and human intervention so that the process becomes automatic.&nbsp;SAP MII&nbsp;explains how to bridge the gap&nbsp;between management and production and bring sound vital information to the shop floor in real time.<p></p>\n</div>\n<div></div>\n<div>With this book you’ll see how to ensure existing manufacturing and information systems share a common interface for all users in your enterprise.<p></p>\n</div>\n<div></div>\n</div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Understand the functional aspects of SAP MII</li>\n<li>Implement SAP MII in different Manufacturing sectors</li>\n<li>Explore new technical features of SAP MII 12.x</li>\n<li>Integrate scenarios with SAP MII</li>\n<li>Discover practice guidelines</li>\n</ul>\n<div>Who This Book is for<p></p>\n</div>\n<div></div>\n<div>All levels of SAP manufacturing professionals.</div>\n</div>",
    "download_link": "http://file.allitebooks.com/20170721/SAP%20MII.pdf",
    "file_format": "PDF",
    "file_size": "17.8 MB",
    "image": "SAP-MII.jpg",
    "isbn_10": "1484228138",
    "language": "English",
    "pages": "337",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27827",
    "title": "SAP MII",
    "top_category": "Databases",
    "year": "2017",
    "id": 30
  },
  {
    "author": [
      "Phillip Whitt"
    ],
    "category": [
      "Graphics Design"
    ],
    "description": "<p>Learn digital image editing without the expense of using subscription-based editors. This book&nbsp;will pave the way for you to leverage Pixlr Editor,&nbsp;a free, web-based image editing solution that works on virtually any computer platform.</p>\n<p>You’ll learn image editing first hand by using the practice images with the corresponding tutorials―everything from creating simple graphics to enhancing and retouching photos. Explore all of the features you’d expect in a high end photo editing application; layers, history (multiple undos), and an array of powerful tools for handling almost any editing task.</p>\n<p>Powerful image editing used to require purchasing and installing expensive, complicated image editing software on your computer.&nbsp;Beginning Pixlr Editor&nbsp;takes an easy-to-access and convenient look at the alternative from the Pixlr family of tools and utilities and offers you advanced editing techniques so you can enhance, retouch, and edit your digital images like a pro.</p>\n<div>\n<div></div>\n<div>What You’ll Learn:</div>\n<div>\n<ul>\n<li>Easily access Pixlr Editor from any computer with a high speed Internet connection</li>\n<li>Create an new image, or open an image from your computer, a URL, or the Pixlr library</li>\n<li>Save your images on to your computer or the Pixlr library</li>\n<li>Navigate the the Pixlr interface</li>\n<li>Use the Tools, Layers, image Adjustments, History, and much more</li>\n</ul>\n<div>Who This Book Is For:</div>\n</div>\n</div>\n<div></div>\n<div>Beginner and those with some image editing experience (anyone accustomed to Adobe Photoshop will instantly feel at home with Pixlr Editor).</div>",
    "download_link": "http://file.allitebooks.com/20170806/Beginning%20Pixlr%20Editor.pdf",
    "file_format": "PDF",
    "file_size": "14.2 MB",
    "image": "Beginning-Pixlr-Editor.jpg",
    "isbn_10": "1484226976",
    "language": "English",
    "pages": "237",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27922",
    "title": "Beginning Pixlr Editor",
    "top_category": "Graphics Design",
    "year": "2017",
    "id": 31
  },
  {
    "author": [
      "Joan Horvath",
      "Rich Cameron"
    ],
    "category": [
      "3D Printing"
    ],
    "description": "<div>\n<p>Learn physics, engineering, and geology concepts usually seen in high school and college in an easy, accessible style.</p>\n<p>This second volume addresses these topics for advanced science fair participants or those who just like reading about and understanding science.&nbsp;3D Printed Science Project&nbsp;Volume 2&nbsp;describes eight open-source 3D printable models, as well as creative activities using the resulting 3D printed pieces. The files are designed to print as easily as possible, and the authors give tips for printing them on open source printers.</p>\n<p>As 3D printers become more and more common and affordable, hobbyists, teachers, parents, and students stall out once they’ve printed some toys and a few household items.&nbsp;To get beyond this, most people benefit from a “starter set” of objects as a beginning point in their explorations, partially just to see what is possible. This book tells you the solid science stories that these models offer, and provides them in open-source repositories.</p>\n</div>\n<div></div>\n<div>\n<div>What You Will Learn:<p></p>\n</div>\n<div>\n<ul>\n<li>Create (and present the science behind) 3D printed models</li>\n<li>Review innovative ideas for tactile ways to learn concepts in engineering, geology and physics</li>\n<li>Learn what makes a models easy or hard to 3D print</li>\n</ul>\n</div>\n<div>Who This Book Is For:<p></p>\n</div>\n</div>\n<div></div>\n<div>The technology- squeamish teacher and parents who want their kids to learn something from their 3D printer but don’t know how, as well as high schoolers and undergraduates.</div>",
    "download_link": "http://file.allitebooks.com/20170524/3D%20Printed%20Science%20Projects%20Volume%202.pdf",
    "file_format": "PDF",
    "file_size": "5.5 MB",
    "image": "3D-Printed-Science-Projects-Volume-2.jpg",
    "isbn_10": "1484226941",
    "language": "English",
    "pages": "181",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27494",
    "title": "3D Printed Science Projects Volume 2",
    "top_category": "Graphics Design",
    "year": "2017",
    "id": 32
  },
  {
    "author": [
      "Eric Wing"
    ],
    "category": [
      "CAD"
    ],
    "description": "<p>The only Revit tutorial guide based on a real project workflow</p>\n<p>Autodesk Revit Architecture No Experience Required is the ultimate real-world guide for mastering this increasingly prevalent BIM software package. Using a continuous, step-by-step tutorial, this book walks you through all project phases as you learn the basics of Revit by designing, documenting, and presenting a four-story office building. You’ll begin by learning your way around the interface and conventions, then jump right into design by placing walls, doors, and windows. Next you’ll work with grids, beams, foundations, dimensions, and text as you build floors layer by layer, join walls, create ceilings and roofs, and place stairs, ramps, and railings. The instruction covers construction documentation, advanced detailing, and families, as well as site considerations including grading and top surface features to provide a well-rounded, real-world Revit skill set. The companion website features downloadable ‘before and after’ tutorial files that allow you to jump in at any point and compare your work to the pros.</p>\n<p>The shift from 2D drafting to 3D building information modeling has made Revit a must-have skill for an increasing number of design, engineering, and construction professionals. This book is designed to teach you the basics quickly, using a real-world workflow, process, and pacing.</p>\n<ul>\n<li>Get acquainted with the Revit interface, then immediately start building</li>\n<li>Learn to place structural components, text, dimensions, and more</li>\n<li>Understand views, grids, editing, importing, exporting, and work sharing</li>\n<li>Generate construction documentation including schedules and material takeoffs</li>\n</ul>\n<p>This simple yet engaging tutorial brings together all of the major skills a Revit user needs to know to complete real workplace projects. Whether read from beginning to end as a comprehensive lesson, or used as ‘dip-in’ reference for unfamiliar tasks, Autodesk Revit Architecture No Experience Required provides invaluable practical BIM instruction for every phase of a project.</p>",
    "download_link": "http://file.allitebooks.com/20170409/Autodesk%20Revit%202017%20for%20Architecture%20No%20Experience%20Required.pdf",
    "file_format": "PDF",
    "file_size": "41.1 MB",
    "image": "Autodesk-Revit-2017-for-Architecture-No-Experience-Required.jpg",
    "isbn_10": "1119243300",
    "language": "English",
    "pages": "720",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27181",
    "title": "Autodesk Revit 2017 for Architecture No Experience Required",
    "top_category": "Graphics Design",
    "year": "2016",
    "id": 33
  },
  {
    "author": [
      "Elizabeth Staley"
    ],
    "category": [
      "Graphics & Design"
    ],
    "description": "<p>Manga Studio is a software application for the digital creation of comics and manga. Manga Studio EX 5 has all the features of Manga Studio 5, professional story creation tools, and other special features that make it the ultimate illustration tool for serious comic, manga, and graphic artists. Made specifically for comic artists and illustrators, it has some of the most powerful digital art creation tools available. From digital perspective rulers to a library of screentones, Manga Studio 5 works for the artist with an intuitive, customizable interface and tools. With Manga Studio EX 5, you can create custom page templates, save commonly used designs, make custom brushes, mimic traditional media, pose 3D objects directly on the art canvas, and export all of your comic pages for print or the Web.</p>\n<p>The book starts with everything you need to know to set up custom pages for your comic or Manga project. These recipes will take you all the way through to exporting your illustrations for print or to display them on the Web. You will learn how to create custom brushes that you will use for inking, or for repetitive tasks such as drawing foliage or rubble. Next, you will move on to understanding Layer Modes and Layer Masks. Then, you’ll learn how to finish up your illustrations with color, screentones, special effects, and 3D objects. Finally, you will be taught to export your hard work and share it with the world, either through the Web or in print.</p>\n<p>This cookbook will give you just the right recipes to turn on the power of Manga Studio EX 5 and get you creating more illustrations faster and more efficiently.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Create story files and custom pages for any Web or publishing project</li>\n<li>Customize brushes for special ink effects, hatching and cross-hatching, and much more</li>\n<li>Work with vector images in Manga Studio EX 5</li>\n<li>Use the new Symmetry ruler and the new Line tools to create your illustrations faster and more efficiently</li>\n<li>Make and save custom screentones, and add them to your comic pages</li>\n<li>Punch up your illustrations with color palettes and special effects</li>\n<li>Add 3D models to create or accentuate your comic scenes</li>\n<li>Finish a project by exporting it for the Web or for a printed collection</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170415/Manga%20Studio%20Ex%205%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "14.7 MB",
    "image": "Manga-Studio-Ex-5-Cookbook.jpg",
    "isbn_10": "1785881078",
    "language": "English",
    "pages": "316",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27223",
    "title": "Manga Studio Ex 5 Cookbook",
    "top_category": "Graphics Design",
    "year": "2015",
    "id": 34
  },
  {
    "author": [
      "Laurie McCanna"
    ],
    "category": [
      "Photoshop",
      "Software"
    ],
    "description": "<p>The world’s most popular photo editing tool just got easier to use. This user-friendly step-by-step resource breaks down the full range of features and shows you how to become more productive in Photoshop, and even points out potential stumbling blocks for beginners.</p>",
    "download_link": "http://file.allitebooks.com/20170409/How%20to%20Do%20Everything%20with%20Photoshop%207.pdf",
    "file_format": "PDF",
    "file_size": "10.2 MB",
    "image": "How-to-Do-Everything-with-Photoshop-7.jpg",
    "isbn_10": "0072195541",
    "language": "English",
    "pages": "341",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27168",
    "title": "How to Do Everything with Photoshop 7",
    "top_category": "Graphics Design",
    "year": "2002",
    "id": 35
  },
  {
    "author": [
      "Paul Ekert"
    ],
    "category": [
      "Premiere"
    ],
    "description": "<p>Adobe Premiere Pro has become synonymous with video editing, in the same way Photoshop has become a byword for image manipulation. To unlock the true potential of this powerful software you don’t need you to take expensive training courses or spend hours trying to get your footage “just right”. Work through this practical guide and truly master Premiere Pro CS6 using real footage with engaging examples.</p>\n<p>Using the included source material (available via digital download), this book will help you discover a plethora of features and functionality hidden within Adobe Premiere Pro CS6 that can truly augment your skills and take your footage to the next level. By covering a diverse array of topics in a practical manner, you will gain a full understanding of how to approach pretty much any video editing project you want to tackle with Adobe Premiere Pro CS6.</p>\n<p>Starting off with an entry-level project to get both new and existing users up to speed, “Mastering Adobe Premiere Pro CS6″ dives right into a series of engaging real-world projects that help you understand how you can harness Premiere Pro’s full potential. With an explicit focus on practical real-world projects from concept to publication, this is the definitive guide for people who want to make the most out of this powerful software.</p>\n<p>As you progress through the book you’ll encounter problems of poorly shot footage; news reporters who stumble over their dialog and camera crews who fail to deliver key scenes, leaving you to scavenge and then hide your trail. Not only will you develop a full understanding of how core features work, you’ll also have a clear grasp on how to make your footage stand out from the crowd.</p>\n<p>What you will learn from this book</p>\n<ul>\n<li>Use actual real-world examples to learn advanced editing workflows.</li>\n<li>Find out how you can manipulate sounds and images.</li>\n<li>Work with real-life effects; explosions, smoke, and exported 3D models.</li>\n<li>Master automatic features that save you time and help create a better edit.</li>\n<li>Delve into the world of frame accurate editing using keyboard shortcuts.</li>\n<li>Learn how the different trim modes, Ripple and Rolling, actually work.</li>\n<li>Speed up your Timeline workflow with the Insert and Extract functions.</li>\n<li>Tame long clips using the sub-clip function.</li>\n<li>Create frame accurate edits using the 3 and 4-Point edit technique.</li>\n<li>Use CS6 filters to create special effects (muzzle flashes and SF effects) and even motion backgrounds.</li>\n<li>Construct multi-layered effect compositions using the Nested Sequence function</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170320/Mastering%20Adobe%20Premiere%20Pro%20CS6%20Hotshot.pdf",
    "file_format": "PDF",
    "file_size": "8.1 MB",
    "image": "Mastering-Adobe-Premiere-Pro-CS6-Hotshot.jpg",
    "isbn_10": "284",
    "language": "English",
    "pages": "284",
    "read_link": "http://www.allitebooks.com/read/index.php?id=26997",
    "title": "Mastering Adobe Premiere Pro CS6 Hotshot",
    "top_category": "Graphics Design",
    "year": "2013",
    "id": 36
  },
  {
    "author": [
      "Dariush Derakhshani"
    ],
    "category": [
      "Maya"
    ],
    "description": "<p>Learn Autodesk Maya from an award-winning insider</p>\n<p>Best-selling author, visual effects supervisor, and technical educator Dariush Derakhshani brings you a newly-updated, step-by-step guide to the most popular and complex 3D application on the market, Autodesk Maya. Introducing Autodesk Maya 2015 includes straightforward lessons, real-world examples, detailed tutorials, and downloadable project files that get you modeling and animating your own digital models and scenes right away.</p>\n<p>The book starts you with the latest CG concepts and production workflows, and then shows you how to create a solar system to help get you acquainted with the basic tool set in Maya. From there, the books helps you:</p>\n<ul>\n<li>Learn the Maya user interface, including menus and plug-ins</li>\n<li>Build simple animations and 3D images right away</li>\n<li>Explore polygons, modeling, and NEX tools</li>\n<li>Get started with HDRI lighting, rendering, dynamics, simulations, and effects</li>\n</ul>\n<p>Whether you’re new to 3D or migrating from another 3D application, Introducing Autodesk Maya 2015 will kick-start your creativity and get you up and running with Maya.&nbsp; Author Derakhshani has worked on movies such as The Fantastic Four and Pan’s Labyrinth, the South Park TV series, and numerous commercials and music videos.</p>",
    "download_link": "http://file.allitebooks.com/20170225/Introducing%20Autodesk%20Maya%202015.pdf",
    "file_format": "PDF",
    "file_size": "131.1 MB",
    "image": "Introducing-Autodesk-Maya-2015.jpg",
    "isbn_10": "1118862848",
    "language": "English",
    "pages": "610",
    "read_link": "http://www.allitebooks.com/read/index.php?id=26624",
    "title": "Introducing Autodesk Maya 2015",
    "top_category": "Graphics Design",
    "year": "2014",
    "id": 37
  },
  {
    "author": [
      "Scott Onstott"
    ],
    "category": [
      "CAD"
    ],
    "description": "<p>Hands-on AutoCAD 2017 instruction for a real-world workflow</p>\n<p>AutoCAD 2017 and AutoCAD LT 2017 Essentials is the unique task-based tutorial designed for both students and the professional AutoCAD user. Concise, straightforward explanations and real-world, hands-on exercises provide an authoritative, easy-to-follow guide to the platform’s core features and functions. Step-by-step tutorials are backed by full-color screenshots, and each chapter ends with an open-ended project to reinforce the chapter’s lessons and provide a fully immersive learning experience. The companion website features downloadable before-and-after tutorial files, so you can jump in at any point and compare your work with the pros. This new edition has been fully updated to align with AutoCAD’s newest features and capabilities, and features a more approachable, easy-to-read style based on instructor and reader feedback to help you get up to speed and quickly become productive with the software.</p>\n<p>AutoCAD is the leading design and drawing software, and an essential skill for designers, architects, and engineers. Whether you’re new to the software, upgrading, or preparing for certification, this no-nonsense guide is your ideal resource for complete AutoCAD instruction.</p>\n<ul>\n<li>Master 2D drawing using splines, polylines, layers, and objects</li>\n<li>Add detail with hatching, gradients, text, and dimensions</li>\n<li>Convert your design into a 3D model for a walk-through tour</li>\n<li>Import, print, edit, and present your final design</li>\n</ul>\n<p>By following a real-world professional workflow throughout the learning process, you develop a highly relevant set of skills that easily transfer into real-world projects. This book walks you through the design of a house, emphasizing skills rather than tools to equip you with an array of solutions for any AutoCAD task. If you’re serious about AutoCAD and ready to get down to work, AutoCAD 2017 and AutoCAD LT 2017 Essentials is the guide you need at your fingertips.</p>",
    "download_link": "http://file.allitebooks.com/20170208/AutoCAD%202017%20and%20AutoCAD%20LT%202017%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "13.4 MB",
    "image": "AutoCAD-2017-and-AutoCAD-LT-2017-Essentials.jpg",
    "isbn_10": "1119243335",
    "language": "English",
    "pages": "432",
    "read_link": "http://www.allitebooks.com/read/index.php?id=26461",
    "title": "AutoCAD 2017 and AutoCAD LT 2017 Essentials",
    "top_category": "Graphics Design",
    "year": "2016",
    "id": 38
  },
  {
    "author": [
      "Ezra Schwartz"
    ],
    "category": [
      "Graphics & Design"
    ],
    "description": "<p>Axure RP 6 Prototyping Essentials is a detailed, practical primer on the leading rapid prototyping tool. Short on jargon and high on concepts, real-life scenarios and step-by-step guidance through hands-on examples, this book will show you how to integrate Axure into your UX workflow. This book is written for UX practitioners, business analysts, product managers, and anyone else who is involved in UX projects. The book assumes that you have no or very little familiarity with Axure. It will help you if you are evaluating the tool for an upcoming project or are required to quickly get up to speed in a project you just joined. The book assumes some familiarity with the principles of the User Centred Design methodology.</p>",
    "download_link": "http://file.allitebooks.com/20170204/Axure%20RP%206%20Prototyping%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "41.4 MB",
    "image": "Axure-RP-6-Prototyping-Essentials.jpg",
    "isbn_10": "1849691649",
    "language": "English",
    "pages": "446",
    "read_link": "http://www.allitebooks.com/read/index.php?id=26392",
    "title": "Axure RP 6 Prototyping Essentials",
    "top_category": "Graphics Design",
    "year": "2012",
    "id": 39
  },
  {
    "author": [
      "David Wolff"
    ],
    "category": [
      "Programming",
      "3D Graphics"
    ],
    "description": "<p>With over 60 recipes, this Cookbook will teach you both the elementary and finer points of the OpenGL Shading Language, and get you familiar with the specific features of GLSL 4.0. A totally practical, hands-on guide. Overview A full set of recipes demonstrating simple and advanced techniques for producing high-quality, real-time 3D graphics using GLSL 4.0 How to use the OpenGL Shading Language to implement lighting and shading techniques Use the new features of GLSL 4.0 including tessellation and geometry shaders How to use textures in GLSL as part of a wide variety of techniques from basic texture mapping to deferred shading Simple, easy-to-follow examples with GLSL source code, as well as a basic description of the theory behind each technique What you will learn from this book Compile, install, and communicate with shader programs Use new features of GLSL 4.0 such as subroutines and uniform blocks Implement basic lighting and shading techniques such as diffuse and specular shading, per-fragment shading, and spotlights Apply single or multiple textures Use textures as environment maps for simulating reflection or refraction Implement screen-space techniques such as gamma correction, blur filters, and deferred shading Implement geometry and tessellation shaders Learn shadowing techniques including shadow mapping and screen space ambient occlusion Use noise in shaders Use shaders for animation Approach This hands-on guide cuts short the preamble and gets straight to the point – actually creating graphics, instead of just theoretical learning. Each recipe is specifically tailored to satisfy your appetite for producing real-time 3-D graphics using GLSL 4.0. Who this book is written for If you are an OpenGL programmer looking to use the modern features of GLSL 4.0 to create real-time, three-dimensional graphics, then this book is for you. Familiarity with OpenGL programming, along with the typical 3D coordinate syste</p>",
    "download_link": "http://file.allitebooks.com/20161209/OpenGL%204.0%20Shading%20Language%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "9.2 MB",
    "image": "OpenGL-4.0-Shading-Language-Cookbook.jpg",
    "isbn_10": "1849514763",
    "language": "English",
    "pages": "340",
    "read_link": "http://www.allitebooks.com/read/index.php?id=25484",
    "title": "OpenGL 4.0 Shading Language Cookbook",
    "top_category": "Graphics Design",
    "year": "2011",
    "id": 40
  },
  {
    "author": [
      "Nathan Haines"
    ],
    "category": [
      "Operating Systems"
    ],
    "description": "<p>Discover how to get the most out of Ubuntu for work, home, and play. &nbsp;Learning a new operating system can feel daunting, especially if you’re used to Windows or OS X. If you’ve been afraid to try Ubuntu because you don’t know where to start, this book introduces you to a wide selection of software and settings that will make your computer ready to work for you.</p>\n<div>You’ll see how Ubuntu can make your computing life easy. In addition to a tour of Ubuntu’s modern and easy-to-use interface, you’ll also learn how Ubuntu’s Software Updater keeps all of your software secure and up-to-date. Browsing the Internet becomes faster and safer. Creating documents and sharing with others is built right in. Enjoying your music and movie libraries helps you unwind.<p></p>\n</div>\n<div></div>\n<div>Ubuntu is the world’s third most popular operating system and powers desktop and laptop computers, servers, private and public clouds, and embedded devices. There’s never been a better time to install Ubuntu and move to an open source way of life. Completely updated for this exciting second edition,&nbsp;Beginning Ubuntu for Windows and Mac Users&nbsp;will help you start your journey into Free and Open Source Software with Ubuntu 16.04 LTS.<p></p>\n</div>\n<div></div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<ul>\n<li>Understand the advantages of Ubuntu and its variants―Kubuntu, Xubuntu, and more</li>\n<li>Install Ubuntu on its own or alongside your computer’s existing operating system</li>\n<li>Search Ubuntu’s catalog of thousands of applications―all ready to install with a single click</li>\n<li>Work with files and disks that were created with Windows and OS X</li>\n<li>Run simple, interesting tasks and games using the command line</li>\n<li>Customize Ubuntu in powerful ways and get work done with virtual machines</li>\n</ul>\n<div>Who This Book Is For<p></p>\n</div>\n</div>\n<div>\n<p>Anyone who wants to move to using an open source operating system.</p>\n</div>",
    "download_link": "http://file.allitebooks.com/20170826/Beginning%20Ubuntu%20for%20Windows%20and%20Mac%20Users,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "11.9 MB",
    "image": "Beginning-Ubuntu-for-Windows-and-Mac-Users,-2nd-Edition.jpg",
    "isbn_10": "1484229991",
    "language": "English",
    "pages": "196",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28022",
    "title": "Beginning Ubuntu for Windows and Mac Users, 2nd Edition",
    "top_category": "Operating Systems",
    "year": "2017",
    "id": 41
  },
  {
    "author": [
      "Martin Bergljung"
    ],
    "category": [
      "Linux & Unix"
    ],
    "description": "<p>Content Management Servers (CMS) have been around for a very long time, both proprietary and open source ones, but there has not been a standard way of talking to them until recently. The Content Management Interoperability Services (CMIS) standard provides both an application programming interface and a search language (based on SQL-92). Alfresco CMIS implementation is the basis for many existing CMIS applications, and you can use CMIS too to integrate your application with Alfresco.</p>\n<p>Alfresco CMIS is a practical, hands-on guide that provides you with a number of clear step-by-step exercises that will help you take advantage of the real power of CMIS, and give you a good foundation in using it via HTTP/XML, Java, or scripting.It starts off with an introduction to the CMIS standard, in order to update you on the service API, object model, and query language.</p>\n<p>The first part of the book explains how to use the service API with HTTP and XML/JSON; this is done in order to show that any library, system, or tool that can make HTTP calls and parse XML or JSON, is able to talk to a content management server that supports CMIS. Next, you learn to demonstrate how a higher abstraction library can be used to talk to a CMIS server in an easy way, hiding some of the complexities of the API using the OpenCMIS Java library. Since most of the applications that are built today are web applications, the book teaches readers how CMIS can be used from JavaScript and Groovy; enterprise application integration, taking Drupal and Mule as references.</p>\n<p>Finally, you will learn how to talk to Alfresco Cloud service via CMIS!</p>\n<p>Who This Book Is For</p>\n<p>If you are a developer who wants to learn how to build applications that talk to content management servers in a standard way using CMIS, this book is ideal for you. It will be helpful if you have a bit of programming experience, although it is not necessary.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Add, update, delete, and search for content with increasing efficiency using HTTP and XML/JSON, OpenCMIS , JavaScript, and Groovy</li>\n<li>Feed content directly into a JavaScript widget from a CMIS call JSON response, so you can see how content management servers can be accessed directly via AJAX calls from a web application</li>\n<li>Integrate Drupal with a content management server via CMIS, so Drupal does not have to store documents and images</li>\n<li>Integrate multiple content management systems in a standard way via an enterprise service bus and a CMIS connector</li>\n<li>Handle advanced concepts such as versioning, permissions, and relationships between content items</li>\n<li>Talk to the Alfresco Cloud service via CMIS, so you can make content available outside the company firewall</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170723/Alfresco%20CMIS.pdf",
    "file_format": "PDF",
    "file_size": "3.9 MB",
    "image": "Alfresco-CMIS.jpg",
    "isbn_10": "1782163522",
    "language": "English",
    "pages": "200",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27839",
    "title": "Alfresco CMIS",
    "top_category": "Operating Systems",
    "year": "201",
    "id": 42
  },
  {
    "author": [
      "Ayan Chatterjee"
    ],
    "category": [
      "Windows"
    ],
    "description": "<div>\n<p>Develop Windows 10 applications faster and more efficiently using the Universal Windows Platform. You will use Xamarin to create apps for macOS, iOS, and Android devices.</p>\n<p>Building Apps for the Universal Windows Platform&nbsp;is a complete guide covering PCs, tablets, phones, and other devices such as HoloLens. You will use Windows 10 to develop apps for desktop, mobile, holographic, wearable, and IoT devices. You will reuse code to easily create cross-platform apps.</p>\n</div>\n<div>What You Will Learn</div>\n<div>\n<ul>\n<li>Design and develop apps using Visual Studio and Blend</li>\n<li>Create Cortana-enabled apps for a hands-free experience</li>\n<li>Build IoT apps and apps for wearables such as the Microsoft HoloLens</li>\n<li>Monitor apps post-publication to gain insights from actionable data using Windows Store Analytics and Azure</li>\n</ul>\n</div>\n<div>Who This Book Is For</div>\n<div>\n<div></div>\n<div>Professional developers working independently or in a team on Windows 10 applications, and students coming into the world of software development</div>\n</div>",
    "download_link": "http://file.allitebooks.com/20170630/Building%20Apps%20for%20the%20Universal%20Windows%20Platform.pdf",
    "file_format": "PDF",
    "file_size": "10.4 MB",
    "image": "Building-Apps-for-the-Universal-Windows-Platform.jpg",
    "isbn_10": "1484226283",
    "language": "English",
    "pages": "270",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27717",
    "title": "Building Apps for the Universal Windows Platform",
    "top_category": "Operating Systems",
    "year": "2017",
    "id": 43
  },
  {
    "author": [
      "Pradyumna Dash"
    ],
    "category": [
      "Linux & Unix"
    ],
    "description": "<p>Oracle VM VirtualBox is an open source, cross-platform virtualization software package. Desktop virtualization software gives you the ability to install and run multiple operating systems on your computer in a virtual environment without disturbing the host OS. VirtualBox helps you create a completely isolated virtual environment and therefore prevents viruses, malware, or any other kinds of threats spreading from the guest-to-host machine.</p>\n<p>Getting Started with Oracle VM VirtualBox is a step-by-step guide designed to help you understand the concepts of virtualization and start running VirtualBox on your system. This book will show you how to install, configure, and manage VirtualBox. It will also show you how to install Oracle Enterprise Linux as a guest VM and make use of the essential features of VirtualBox.</p>\n<p>This book will show you how to install and configure VirtualBox on your desktop. You will then learn how to create a guest machine as well as features like starting, stopping, removal, and cloning of the guest machine. This book will also introduce you to some advanced features like snapshot, Clone, and VM Groups.</p>\n<p>You will then discover how you can install Oracle Enterprise Linux 6.0 as a guest OS and also how to share a folder both in Windows and Linux operating systems. You will then learn about the different networking options available on VirtualBox and discover how they work. Finally, this book will introduce you to the different virtual storage options available in VirtualBox and show you how they work.</p>\n<p>What you will learn from this book</p>\n<ul>\n<li>Install VirtualBox on your desktop and create a guest virtual machine</li>\n<li>Discover advanced features like snapshot, Clone, and VM Groups</li>\n<li>Install Oracle Enterprise Linux 6.0 as a guest OS</li>\n<li>Explore the different networking and storage options available in VirtualBox</li>\n<li>Discover the memory management techniques available in VirtualBox</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170608/Getting%20Started%20with%20Oracle%20VM%20VirtualBox.pdf",
    "file_format": "PDF",
    "file_size": "5.3 MB",
    "image": "Getting-Started-with-Oracle-VM-VirtualBox.jpg",
    "isbn_10": "1782177825",
    "language": "English",
    "pages": "86",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27581",
    "title": "Getting Started with Oracle VM VirtualBox",
    "top_category": "Operating Systems",
    "year": "201",
    "id": 44
  },
  {
    "author": [
      "Bo Weaver",
      "Wolf Halton"
    ],
    "category": [
      "Linux & Unix"
    ],
    "description": "<p>Microsoft Windows is one of the two most common OS and managing its security has spawned the discipline of IT security. Kali Linux is the premier platform for testing and maintaining Windows security. Kali is built on the Debian distribution of Linux and shares the legendary stability of that OS. This lets you focus on using the network penetration, password cracking, forensics tools and not the OS.</p>\n<p>This book has the most advanced tools and techniques to reproduce the methods used by sophisticated hackers to make you an expert in Kali Linux penetration testing. First, you are introduced to Kali’s top ten tools and other useful reporting tools. Then, you will find your way around your target network and determine known vulnerabilities to be able to exploit a system remotely. Next, you will prove that the vulnerabilities you have found are real and exploitable. You will learn to use tools in seven categories of exploitation tools. Further, you perform web access exploits using tools like websploit and more. Security is only as strong as the weakest link in the chain. Passwords are often that weak link. Thus, you learn about password attacks that can be used in concert with other approaches to break into and own a network. Moreover, you come to terms with network sniffing, which helps you understand which users are using services you can exploit, and IP spoofing, which can be used to poison a system’s DNS cache. Once you gain access to a machine or network, maintaining access is important.</p>\n<p>Thus, you not only learn penetrating in the machine you also learn Windows privilege’s escalations. With easy to follow step-by-step instructions and support images, you will be able to quickly pen test your system and network.</p>\n<p>Who This Book Is For</p>\n<p>If you are a working ethical hacker who is looking to expand the offensive skillset with a thorough understanding of Kali Linux, then this is the book for you. Prior knowledge about Linux operating systems and the BASH terminal emulator along with Windows desktop and command line would be highly beneficial.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Set up Kali Linux for pen testing</li>\n<li>Map and enumerate your Windows network</li>\n<li>Exploit several common Windows network vulnerabilities</li>\n<li>Attack and defeat password schemes on Windows</li>\n<li>Debug and reverse-engineer Windows programs</li>\n<li>Recover lost files, investigate successful hacks and discover hidden data in innocent-looking files</li>\n<li>Catch and hold admin rights on the network, and maintain backdoors on the network after your initial testing is done</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170608/Kali%20Linux%202%20Windows%20Penetration%20Testing.pdf",
    "file_format": "PDF",
    "file_size": "23.1 MB",
    "image": "Kali-Linux-2:-Windows-Penetration-Testing.jpg",
    "isbn_10": "1782168494",
    "language": "English",
    "pages": "422",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27578",
    "title": "Kali Linux 2: Windows Penetration Testing",
    "top_category": "Operating Systems",
    "year": "2016",
    "id": 45
  },
  {
    "author": [
      "Matt Bailey"
    ],
    "category": [
      "Linux & Unix"
    ],
    "description": "<p>CoreOS in Action is a clear tutorial for deploying container-based systems on CoreOS Container Linux.</p>\n<p>CoreOS in Action is a clear tutorial for deploying container-based systems on CoreOS Container Linux. Inside, you’ll follow along with examples that teach you to set up CoreOS on both private and cloud systems, and to practice common sense monitoring and upgrade techniques with real code. You’ll also explore important container-aware application designs, including microservices, web, and Big Data examples with real-world use cases to put your learning into perspective.</p>\n<p>Summary</p>\n<ul>\n<li>Handling scaling and failures gracefully</li>\n<li>Container-driven application designs</li>\n<li>Cloud, on-premises, and hybrid deployment</li>\n<li>Smart logging and backup practices</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170529/CoreOS%20in%20Action.pdf",
    "file_format": "PDF",
    "file_size": "4.9 MB",
    "image": "CoreOS-in-Action.jpg",
    "isbn_10": "1617293741",
    "language": "English",
    "pages": "200",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27522",
    "title": "CoreOS in Action",
    "top_category": "Operating Systems",
    "year": "2017",
    "id": 46
  },
  {
    "author": [
      "M. L. Srinivasan"
    ],
    "category": [
      "Linux & Unix",
      "Security"
    ],
    "description": "<p>Certified Information Systems Security Professional (CISSP) is an internationally recognized and coveted qualification. Success in this respected exam opens the door to your dream job as a security expert with an eye-catching salary. But passing the final exam is challenging. This happens when they cover everything but do not revise properly and hence lack confidence.</p>\n<p>This simple yet informative book provides concise explanations of important concepts in all 10 domains of the CISSP Common Body of Knowledge (CBK). This book will take you through the final weeks before the exam with a day-by-day plan covering all of the exam topics. It will build your confidence and enable you to crack the Gold Standard exam, knowing that you have done all you can to prepare for the big day. This book is not a replacement for full study guides; instead, it builds on and re-emphasizes concepts learned from them.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Review Exam Cram and Practice review questions to reinforce the required concepts</li>\n<li>Follow the day-by-day plan to revise important concepts a month before the CISSP® exam</li>\n<li>Boost your time management for the exam by attempting the mock question paper</li>\n<li>Develop a structured study plan for all 10 CISSP® domains</li>\n<li>Build your understanding of myriad concepts in the information security domain</li>\n<li>Practice the full-blown mock test to evaluate your knowledge and exam preparation</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170523/CISSP%20in%2021%20Days,%20Second%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "12.4 MB",
    "image": "CISSP-in-21-Days,-Second-Edition.jpg",
    "isbn_10": "1785884492",
    "language": "English",
    "pages": "402",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27485",
    "title": "CISSP in 21 Days, Second Edition",
    "top_category": "Operating Systems",
    "year": "2016",
    "id": 47
  },
  {
    "author": [
      "Jordan Krause"
    ],
    "category": [
      "Windows"
    ],
    "description": "<p>This book will help you to understand the essential administrative tasks in Windows Server 2012, and will also introduce you to the new features in R2. Starting with familiarizing yourself with the look and feel of Windows Server 2012 R2, you will learn how to navigate through some daily tasks in R2 using the graphical interface, and then reflect on the most common infrastructure tasks needed to create a successful Windows Active Directory environment. You will learn how to compose optimal Group Policies and facilitate task automation with PowerShell scripting.</p>\n<p>By the end of this book, you will know how to take your Windows Server 2012 R2-powered server and turn it into any common infrastructure role that might be required in your company.</p>\n<p>Who This Book Is For</p>\n<p>This book is intended for system administrators and IT professionals with experience in Windows Server 2008 or Windows Server 2012 environments who are looking to acquire the skills and knowledge necessary to manage and maintain the core infrastructure required for a Windows Server 2012 and Windows Server 2012 R2 environment.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Build the infrastructure required for a successful Windows network</li>\n<li>Navigate the new Server 2012 R2 interface efficiently</li>\n<li>Implement solid networking and security practices into your Windows Server environment</li>\n<li>Design your own PKI and start issuing certificates today</li>\n<li>Connect your remote laptops back to the corporate network using Microsoft’s own remote access technologies, including DirectAccess</li>\n<li>Provide a centralized point for users to access applications and data by configuring Remote Desktop Services</li>\n<li>Compose optimal Group Policies</li>\n<li>Facilitate task automation with PowerShell scripting</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170509/Windows%20Server%202012%20R2%20Administrator%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "12.7 MB",
    "image": "Windows-Server-2012-R2-Administrator-Cookbook.jpg",
    "isbn_10": "178439307X",
    "language": "English",
    "pages": "322",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27398",
    "title": "Windows Server 2012 R2 Administrator Cookbook",
    "top_category": "Operating Systems",
    "year": "2015",
    "id": 48
  },
  {
    "author": [
      "Tajinder Kalsi"
    ],
    "category": [
      "Linux & Unix"
    ],
    "description": "<p>With the growing popularity of Linux, more and more administrators have started moving to the system to create networks or servers for any task. This also makes Linux the first choice for any attacker now. Due to the lack of information about security-related attacks, administrators now face issues in dealing with these attackers as quickly as possible. Learning about the different types of Linux security will help create a more secure Linux system.</p>\n<p>Whether you are new to Linux administration or experienced, this book will provide you with the skills to make systems more secure.</p>\n<p>With lots of step-by-step recipes, the book starts by introducing you to various threats to Linux systems. You then get to walk through customizing the Linux kernel and securing local files. Next you will move on to manage user authentication locally and remotely and also mitigate network attacks. Finally, you will learn to patch bash vulnerability and monitor system logs for security.</p>\n<p>With several screenshots in each example, the book will supply a great learning experience and help you create more secure Linux systems.</p>\n<p>What you will learn</p>\n<ul>\n<li>Learn about various vulnerabilities and exploits in relation to Linux systems</li>\n<li>Configure and build a secure kernel and test it</li>\n<li>Learn about file permissions and security and how to securely modify files</li>\n<li>Explore various ways to authenticate local users while monitoring their activities.</li>\n<li>Authenticate users remotely and securely copy files on remote systems</li>\n<li>Review various network security methods including firewalls using iptables and TCP Wrapper</li>\n<li>Explore various security tools including Port Sentry, Squid Proxy, Shorewall, and many more</li>\n<li>Understand Bash vulnerability/security and patch management</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170507/Practical%20Linux%20Security%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "16.2 MB",
    "image": "Practical-Linux-Security-Cookbook.jpg",
    "isbn_10": "1785286420",
    "language": "English",
    "pages": "276",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27376",
    "title": "Practical Linux Security Cookbook",
    "top_category": "Operating Systems",
    "year": "2016",
    "id": 49
  },
  {
    "author": [
      "Richard Boddington"
    ],
    "category": [
      "Operating Systems",
      "Hardware DIY",
      "Security"
    ],
    "description": "<p>Digital Forensics is a methodology which includes using various tools, techniques, and programming language. This book will get you started with digital forensics and then follow on to preparing investigation plan and preparing toolkit for investigation.</p>\n<p>In this book you will explore new and promising forensic processes and tools based on ‘disruptive technology’ that offer experienced and budding practitioners the means to regain control of their caseloads. During the course of the book, you will get to know about the technical side of digital forensics and various tools that are needed to perform digital forensics. This book will begin with giving a quick insight into the nature of digital evidence, where it is located and how it can be recovered and forensically examined to assist investigators. This book will take you through a series of chapters that look at the nature and circumstances of digital forensic examinations and explains the processes of evidence recovery and preservation from a range of digital devices, including mobile phones, and other media. This book has a range of case studies and simulations will allow you to apply the knowledge of the theory gained to real-life situations.</p>\n<p>By the end of this book you will have gained a sound insight into digital forensics and its key components.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Gain familiarity with a range of different digital devices and operating and application systems that store digital evidence.</li>\n<li>Appreciate and understand the function and capability of forensic processes and tools to locate and recover digital evidence.</li>\n<li>Develop an understanding of the critical importance of recovering digital evidence in pristine condition and ensuring its safe handling from seizure to tendering it in evidence in court.</li>\n<li>Recognise the attributes of digital evidence and where it may be hidden and is often located on a range of digital devices.</li>\n<li>Understand the importance and challenge of digital evidence analysis and how it can assist investigations and court cases.</li>\n<li>Explore emerging technologies and processes that empower forensic practitioners and other stakeholders to harness digital evidence more effectively.</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170428/Practical%20Digital%20Forensics.pdf",
    "file_format": "PDF",
    "file_size": "13.4 MB",
    "image": "Practical-Digital-Forensics.jpg",
    "isbn_10": "1785887106",
    "language": "English",
    "pages": "372",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27324",
    "title": "Practical Digital Forensics",
    "top_category": "Operating Systems",
    "year": "2016",
    "id": 50
  },
  {
    "author": [
      "Kelly Goetsch"
    ],
    "category": [
      "Data in the Enterprise"
    ],
    "description": "<p>Is your eCommerce solution ready for the cloud? This practical guide shows experienced and aspiring web architects alike how to adopt cloud computing incrementally, using public Infrastructure-as-a-Service and Platform-as-a-Service. You will learn how to marshal as much capacity as you need to handle peak holiday or special-event traffic.Written by eCommerce expert Kelly Goetsch, this book helps architects leverage recent technological advances that have made it possible to run an entire enterprise-level eCommerce platform from a cloud.</p>\n<ul>\n<li>Explore cloud service models: Infrastructure-as-a-Service, Platform-as-a-Service, and Software-as-a-Service</li>\n<li>Learn about public, hybrid, and private cloud deployment models</li>\n<li>Understand the impact of omnichannel retailing on platform and deployment architectures</li>\n<li>Build an auto-scaling solution that can quickly add or subtract hardware in response to real-time traffic</li>\n<li>Re-apply what you already know about security to the cloud</li>\n<li>Run a single eCommerce platform from multiple data centers, including several forms of multi-master</li>\n<li>Build a hybrid solution or deploy your entire platform to the cloud</li>\n<li>Learn application and deployment architecture for “cloud native” through legacy eCommerce platforms</li>\n<li>Use Software-as-a-Service for eCommerce, including Content Delivery Networks and Global Site Load Balancing services</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170903/eCommerce%20in%20the%20Cloud.pdf",
    "file_format": "PDF",
    "file_size": "19.1 MB",
    "image": "eCommerce-in-the-Cloud.jpg",
    "isbn_10": "1491946636",
    "language": "English",
    "pages": "286",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28060",
    "title": "eCommerce in the Cloud",
    "top_category": "Networking Cloud Computing",
    "year": "2014",
    "id": 51
  },
  {
    "author": [
      "Dmitri Korotkevitch"
    ],
    "category": [
      "Network Administration"
    ],
    "description": "<div>\n<div>Take a deep dive into one of the most significant SQL Server features–support for In-Memory Online Transaction Processing. The latest developments are covered, including support of off-row storage, columnstore indexes and operational analytics, changes in programmability and native compilation, and more. This book describes the architecture and internals of the In-Memory OLTP Engine and explains how to develop, deploy, and maintain systems using it. With it you can dramatically increase transaction throughput to handle thousands of transactions per second supporting millions of customers.<p></p>\n</div>\n<div></div>\n<div>Learn the architecture and the internals of In-Memory OLTP in order to recognize when technology can make a difference. Recognize opportunities for In-Memory OLTP in new development and understand how to benefit from it in existing systems. Don’t be without Dmitri Korotkevitch and the deep expertise he imparts in&nbsp;Expert SQL Server In-Memory OLTP, 2nd Edition&nbsp;as you move forward in using SQL Server’s In-Memory OLTP technology.<p></p>\n</div>\n<div></div>\n<div>Dmitri Korotkevitch is the five-star author of&nbsp;Pro SQL Server Internals, and brings the same combination of clear thinking and deep expertise to help you in this second edition. The book:<p></p>\n</div>\n<div>\n<ul>\n<ul>\n<ul>\n<li>Explains In-Memory OLTP internals, architecture and programmability, including data storage, indexing, multi-version concurrency control, transaction logging and recovery, and native compilation</li>\n<li>Covers SQL Server 2016 technology enhancements, including columnstore indexes and off-row storage</li>\n</ul>\n</ul>\n</ul>\n<p>Guides in using In-Memory OLTP in new development and existing systems</p>\n</div>\n<div>What You’ll Learn<p></p>\n</div>\n<div>\n<div>\n<ul>\n<li>Grasp how SQL Server stores and works with data in memory-optimized tables</li>\n<li>Properly design and index memory-optimized tables</li>\n<li>Plan successful deployments, including the required memory size and I/O configuration</li>\n<li>Accelerate T-SQL processing through the creation of natively compiled modules</li>\n<li>Monitor and report on the benefits and performance of your In-Memory OLTP solutions</li>\n<li>Benefit from the technology in existing systems and in the systems with the mixed workload</li>\n</ul>\n</div>\n</div>\n<div>Who This Book Is For<p></p>\n</div>\n</div>\n<div></div>\n<p>Application developers and database administrators who create and manage online transaction processing (OLTP) systems; in particular, those wanting to take advantage of SQL Server’s new offering of in-memory OLTP to dramatically improve performance and throughput of their systems</p>\n<p><span style=\"font-family: Arial, sans-serif; font-size: 14px;\">&nbsp;</span></p>",
    "download_link": "http://file.allitebooks.com/20170904/Expert%20SQL%20Server%20In-Memory%20OLTP,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "12.1 MB",
    "image": "Expert-SQL-Server-In-Memory-OLTP,-2nd-Edition.jpg",
    "isbn_10": "1484227719",
    "language": "English",
    "pages": "304",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28065",
    "title": "Expert SQL Server In-Memory OLTP, 2nd Edition",
    "top_category": "Networking Cloud Computing",
    "year": "2017",
    "id": 52
  },
  {
    "author": [
      "Adam Gordon",
      "Steven Hernandez"
    ],
    "category": [
      "Network Security"
    ],
    "description": "<p>The fourth edition of the&nbsp;Official (ISC)<sup>2</sup>® Guide to the SSCP&nbsp;CBK®&nbsp;is a comprehensive resource providing an in-depth look at the seven domains of the SSCP Common Body of Knowledge (CBK).&nbsp; This latest edition provides an updated, detailed guide that is considered one of the best tools for candidates striving to become an SSCP.</p>\n<p>The book offers step-by-step guidance through each of SSCP’s domains, including best practices and techniques used by the world’s most experienced practitioners. Endorsed by (ISC)² and compiled and reviewed by SSCPs and subject matter experts, this book brings together a global, thorough perspective to not only prepare for the SSCP exam, but it also provides a reference that will serve you well into your career.</p>",
    "download_link": "http://file.allitebooks.com/20170828/The%20Official%20(ISC)2%20Guide%20to%20the%20SSCP%20CBK,%204th%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "86.2 MB",
    "image": "The-Official-(ISC)2-Guide-to-the-SSCP-CBK,-4th-Edition.jpg",
    "isbn_10": "1119278635",
    "language": "English",
    "pages": "928",
    "read_link": "http://www.allitebooks.com/read/index.php?id=28032",
    "title": "The Official (ISC)2 Guide to the SSCP CBK, 4th Edition",
    "top_category": "Networking Cloud Computing",
    "year": "2016",
    "id": 53
  },
  {
    "author": [
      "Mansib Rahman"
    ],
    "category": [
      "Data in the Enterprise"
    ],
    "description": "<div>\n<div>\n<p>Develop applications in Microsoft Kinect 2 using gesture and speech recognition, scanning of objects in 3D, and body tracking. Create motion-sensing applications for entertainment and practical uses, including for commercial products and industrial applications.</p>\n<p>Beginning Microsoft Kinect for Windows SDK 2.0&nbsp;is dense with code and examples to ensure that you understand how to build Kinect applications that can be used in the real world. Techniques and ideas are presented to facilitate incorporation of the Kinect with other technologies.</p>\n</div>\n</div>\n<p>What You Will Learn</p>\n<div>\n<div>\n<ul>\n<li>Set up Kinect 2 and a workspace for Kinect application development</li>\n<li>Access audio, color, infrared, and skeletal data streams from Kinect</li>\n<li>Use gesture and speech recognition</li>\n<li>Perform computer vision manipulations on image data streams</li>\n<li>Develop Windows Store apps and Unity3D applications with Kinect 2</li>\n<li>Take advantage of Kinect Fusion (3D object mapping technology) and Kinect Ripple (Kinect projector infotainment system)</li>\n</ul>\n</div>\n</div>\n<div>Who This Book Is For</div>\n<div></div>\n<div>Developers who want to include the simple but powerful Kinect technology into their projects, including amateurs and hobbyists, and professional developers</div>",
    "download_link": "http://file.allitebooks.com/20170812/Beginning%20Microsoft%20Kinect%20for%20Windows%20SDK%202.0.pdf",
    "file_format": "PDF",
    "file_size": "11.2 MB",
    "image": "Beginning-Microsoft-Kinect-for-Windows-SDK-2.0.jpg",
    "isbn_10": "1484223152",
    "language": "English",
    "pages": "297",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27969",
    "title": "Beginning Microsoft Kinect for Windows SDK 2.0",
    "top_category": "Networking Cloud Computing",
    "year": "201",
    "id": 54
  },
  {
    "author": [
      "James Denton"
    ],
    "category": [
      "Cloud Computing"
    ],
    "description": "<p>The OpenStack Networking API offers users the ability to create and manage both basic and complex network architectures that blend the virtual and physical network infrastructure.</p>\n<p>This book kicks off by describing various components of Openstack Neutron and installing Ubuntu OpenStack based on Canonical’s process. Further on, you will use various methods to interface with Neutron to create and manage network resources. You will also get to grips with the relationship between ports, networks, and subnets through diagrams and explanations, and see how the logical components are implemented via plugins and agents.</p>\n<p>Moving forward, you will learn how virtual switches are implemented and how to build Neutron routers. You will also configure networks, subnets, and routers to provide connectivity to instances using simple examples. At the end, you will configure and manage security groups, and will observe how these rules translate to iptables rules on the host machines.</p>\n<p>By the end of the book, you will be able to build basic network architectures using Neutron networks and routers in no time.</p>\n<p>What you will learn</p>\n<ul>\n<li>Install the latest Liberty (2015.2) release of OpenStack using RDO in VirtualBox</li>\n<li>Discover the basics of the Neutron API, including networks, subnets, and ports</li>\n<li>Interact with Neutron using the CLI and Horizon dashboard</li>\n<li>Create networks and subnets that provide connectivity to instances</li>\n<li>Implement software routers that connect networks and provide network address translation</li>\n<li>Secure instances using Neutron’s security group functionality</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170810/OpenStack%20Networking%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "14.6 MB",
    "image": "OpenStack-Networking-Essentials.jpg",
    "isbn_10": "1785283278",
    "language": "English",
    "pages": "174",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27937",
    "title": "OpenStack Networking Essentials",
    "top_category": "Networking Cloud Computing",
    "year": "2016",
    "id": 55
  },
  {
    "author": [
      "Chandan Dutta Chowdhury",
      "Sriram Subramanian"
    ],
    "category": [
      "Cloud Computing"
    ],
    "description": "<p>Networking in OpenStack has evolved from Nova Network to Neutron. This has resulted in a rich suite of networking services available to OpenStack users and administrators. Advanced services such as routers, firewall, and load balancers use building blocks such as network and subnets. Recent improvements support powerful customization using plugins. The evolution of Neutron continues as it integrates with tools like Ceilometer and Heat.</p>\n<p>This book will explore the built-in capabilities of Neutron to effectively deploy cloud solutions. You will begin with the most fundamental constructs of OpenStack Networking for switching and routing. You will then learn how to provide your tenants with services like firewalls and load-balancers. The step-by-step recipes will help you configure and troubleshoot networking problems in your cloud. This book will also introduce you to advanced topics like Ceilometer, Heat, and other upcoming tools in OpenStack</p>\n<p>Who This Book Is For</p>\n<p>This book is aimed at network and system administrators who want to deploy and manage OpenStack-based cloud and IT infrastructure. If you have basic knowledge of OpenStack and virtualization, this book will help you leverage the rich functionality of OpenStack Networking in your cloud deployments.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Operate OpenStack Networking for public and private clouds</li>\n<li>Configure advanced routing services for your workloads</li>\n<li>Secure data traffic using firewall-as-a-service capabilities of OpenStack</li>\n<li>Discover how to leverage VXLAN to implement SDN in your OpenStack cloud</li>\n<li>Monitor the virtual networks using Ceilometer</li>\n<li>Develop plugins to enhance and customize OpenStack Networking</li>\n<li>Provide HA and VPN connectivity for your virtual machines</li>\n<li>Troubleshoot and solve common problems with OpenStack Networking</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170810/OpenStack%20Networking%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "15.1 MB",
    "image": "OpenStack-Networking-Cookbook.jpg",
    "isbn_10": "1785286102",
    "language": "English",
    "pages": "282",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27934",
    "title": "OpenStack Networking Cookbook",
    "top_category": "Networking Cloud Computing",
    "year": "2015",
    "id": 56
  },
  {
    "author": [
      "Sailesh Bharati",
      "Weihua Zhuang"
    ],
    "category": [
      "Networking & Cloud Computing"
    ],
    "description": "<p>This book presents link-layer cooperative frameworks to improve transmission reliability and network throughput of distributed TDMA MAC protocols in vehicular ad hoc networks (VANETs). The main objective of this book is to present link-layer node cooperation schemes to enhance the link-layer performance of vehicular networks, in terms of reliability and system throughput. The authors present approaches proposed for the medium access control (MAC) and node cooperation in VANETs. The authors also cover cooperative ADHOC MAC for point-to-point communication between a pair of source and destination nodes, and cooperative relay broadcasting for broadcast services in this book. The performance of node cooperation frameworks is evaluated via mathematical analysis and computer simulations, in comparison with distributed TDMA MAC protocols without cooperation. The proposed node cooperation frameworks enhance the performance of distributed TDMA MAC and make it more robust to tackle the dynamic networking conditions in VANETs. Furthermore, with cooperation enabled transmission, the performance of distributed TMDA MAC is more suitable to support the wide range of mobile applications and their strict service requirements which is discussed in this book.</p>\n<p>The proposed node cooperation schemes and distributed cooperation decisions can be extended to wireless systems other than distributed TDMA MAC, such as cellular communication, for vehicular communications introduced in this book. This book is useful for researchers from academia and industry, as well as advanced level students interested in vehicular communication networks.&nbsp; It is also useful for professionals and engineers developing applications that use cooperative wireless communication systems.</p>",
    "download_link": "http://file.allitebooks.com/20170731/Link-Layer%20Cooperative%20Communication%20in%20Vehicular%20Networks.pdf",
    "file_format": "PDF",
    "file_size": "3.1 MB",
    "image": "Link-Layer-Cooperative-Communication-in-Vehicular-Networks.jpg",
    "isbn_10": "331958720X",
    "language": "English",
    "pages": "111",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27900",
    "title": "Link-Layer Cooperative Communication in Vehicular Networks",
    "top_category": "Networking Cloud Computing",
    "year": "2017",
    "id": 57
  },
  {
    "author": [
      "Chris Sanders"
    ],
    "category": [
      "Networks Protocols APIs"
    ],
    "description": "<p>It’s easy to capture packets with Wireshark, the world’s most popular network sniffer, whether off the wire or from the air. But how do you use those packets to understand what’s happening on your network?</p>\n<p>Updated to cover Wireshark 2.x, the third edition of&nbsp;Practical Packet Analysis&nbsp;will teach you to make sense of your packet captures so that you can better troubleshoot network problems. You’ll find added coverage of IPv6 and SMTP, a new chapter on the powerful command line packet analyzers tcpdump and TShark, and an appendix on how to read and reference packet values using a packet map.</p>\n<p>Practical Packet Analysis&nbsp;will show you how to:</p>\n<ul>\n<li>Monitor your network in real time and tap live network communications</li>\n<li>Build customized capture and display filters</li>\n<li>Use packet analysis to troubleshoot and resolve common network problems, like loss of connectivity, DNS issues, and slow speeds</li>\n<li>Explore modern exploits and malware at the packet level</li>\n<li>Extract files sent across a network from packet captures</li>\n<li>Graph traffic patterns to visualize the data flowing across your network</li>\n<li>Use advanced Wireshark features to understand confusing captures</li>\n<li>Build statistics and reports to help you better explain technical network information to non-techies</li>\n</ul>\n<p>No matter what your level of experience is,&nbsp;Practical Packet Analysis&nbsp;will show you how to use Wireshark to make sense of any network and get things done.</p>",
    "download_link": "http://file.allitebooks.com/20170730/Practical%20Packet%20Analysis,%203rd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "15.2 MB",
    "image": "Practical-Packet-Analysis,-3rd-Edition.jpg",
    "isbn_10": "1593278020",
    "language": "English",
    "pages": "368",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27894",
    "title": "Practical Packet Analysis, 3rd Edition",
    "top_category": "Networking Cloud Computing",
    "year": "2017",
    "id": 58
  },
  {
    "author": [
      "Amanda Berlin",
      "Lee Brotherston"
    ],
    "category": [
      "Network Administration"
    ],
    "description": "<p>Despite the increase of high-profile hacks, record-breaking data leaks, and ransomware attacks, many organizations don’t have the budget to establish or outsource an information security (InfoSec) program, forcing them to learn on the job. For companies obliged to improvise, this pragmatic guide provides a security-101 handbook with steps, tools, processes, and ideas to help you drive maximum-security improvement at little or no cost.</p>\n<p>Each chapter in this book provides step-by-step instructions for dealing with a specific issue, including breaches and disasters, compliance, network infrastructure and password management, vulnerability scanning, and penetration testing, among others. Network engineers, system administrators, and security professionals will learn tools and techniques to help improve security in sensible, manageable chunks.</p>\n<ul>\n<li>Learn fundamentals of starting or redesigning an InfoSec program</li>\n<li>Create a base set of policies, standards, and procedures</li>\n<li>Plan and design incident response, disaster recovery, compliance, and physical security</li>\n<li>Bolster Microsoft and Unix systems, network infrastructure, and password management</li>\n<li>Use segmentation practices and designs to compartmentalize your network</li>\n<li>Explore automated process and tools for vulnerability management</li>\n<li>Securely develop code to reduce exploitable errors</li>\n<li>Understand basic penetration testing concepts through purple teaming</li>\n<li>Delve into IDS, IPS, SOC, logging, and monitoring</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20170724/Defensive%20Security%20Handbook.pdf",
    "file_format": "PDF",
    "file_size": "29.9 MB",
    "image": "Defensive-Security-Handbook.jpg",
    "isbn_10": "1491960388",
    "language": "English",
    "pages": "284",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27855",
    "title": "Defensive Security Handbook",
    "top_category": "Networking Cloud Computing",
    "year": "2017",
    "id": 59
  },
  {
    "author": [
      "Richard Siddaway"
    ],
    "category": [
      "Network Administration"
    ],
    "description": "<p>Windows PowerShell is a scripting language that simplifies Windows system administration.&nbsp;PowerShell in Practiceis a hands-on reference for administrators wanting to learn and use PowerShell. Following the “in Practice” style, individual related techniques are clustered into chapters. Each technique is presented in the form: problem, solution, discussion, and includes annotated code listings.</p>\n<p>Written to answer the question “How can PowerShell make my job as an administrator easier?” this book concentrates on practical tasks and automation. Starting with an a brief tutorial and review, the majority of the book focuses on two major PowerShell usage areas: People – user accounts, mailboxes, desktop configuration; and Servers – Active Directory, Exchange, IIS, and more.</p>",
    "download_link": "http://file.allitebooks.com/20170712/PowerShell%20in%20Practice.pdf",
    "file_format": "PDF",
    "file_size": "8.1 MB",
    "image": "PowerShell-in-Practice.jpg",
    "isbn_10": "1935182005",
    "language": "English",
    "pages": "500",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27783",
    "title": "PowerShell in Practice",
    "top_category": "Networking Cloud Computing",
    "year": "2010",
    "id": 60
  },
  {
    "author": [
      "James Cabrera"
    ],
    "category": [
      "Programming",
      "Administration"
    ],
    "description": "<div>\n<p>Learn the basic principles of modular design, and then put them into action to create sites that are easy to use, look great, and can be adapted within the context of your business needs.</p>\n<p>With author James Cabrera―one of the thought leaders in the modular-design movement―you’ll create a single, scalable project for a sample nameplate site and then adapt that same project to work successfully as a portfolio site, an e-commerce site, and finally as a news/publishing content site. Along the way, you’ll learn the scientific approach to devising a sound and scalable design strategy, followed by establishing a basic foundation using various criteria relevant to that type of site. As each chapter progresses, you’ll add new concepts appropriate for the project type.</p>\n<p>Modular web and app design isn’t just for so-called “creatives.” It’s a teachable science with principles that can be replicated in a creative manner. This approach makes the design decision making process for businesses much easier (and easier to live with). And modular design is a powerful tool for software designers to replicate effective successful designs across a spectrum of needs.</p>\n</div>\n<div>\n<div>What You’ll Learn</div>\n<div>\n</div>\n<div>\n<ul>\n<li>Examine the design process in a modular way</li>\n<li>Adapt your&nbsp;HTML code to create different types of applications</li>\n<li>Establish your own modular framework for your specific site’s goals</li>\n<li>Design for scale</li>\n<li>Develop a strong foundation skeleton for design</li>\n</ul>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>User&nbsp;experience designers, user interface designers, information architects, developers with an interest in design, developers who want to create their own design frameworks.</div>\n</div>\n</div>",
    "download_link": "http://file.allitebooks.com/20170811/Modular%20Design%20Frameworks.pdf",
    "file_format": "PDF",
    "file_size": "3.7 MB",
    "image": "Modular-Design-Frameworks.jpg",
    "isbn_10": "1484216873",
    "language": "English",
    "pages": "86",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27944",
    "title": "Modular Design Frameworks",
    "top_category": "Administration",
    "year": "2017",
    "id": 61
  },
  {
    "author": [
      "Jorge Acetozi"
    ],
    "category": [
      "Administration"
    ],
    "description": "<div>Build clustered and scalable Java-based, real-time applications using Spring Framework, Boot, WebSocket, Cassandra, Redis and RabbitMQ. In this book, you’ll tie all this together with a dive-in case study, a real-time scalable chat application under differing scenarios.&nbsp;Pro Java Clustering and Scalabilityalso discusses how to horizontally scale the WebSocket chat application using a full STOMP broker such as RabbitMQ.<p></p>\n</div>\n<div></div>\n<div>Although this is a programming book, it also discusses many interesting infrastructure topics and tips about continuous delivery, Docker, NoSQL (Cassandra and Redis) and other related technologies.<p></p>\n</div>\n<div></div>\n<div>What You Will Learn</div>\n<div>\n<ul>\n<li>Handle clustering and scalability using various open source Java, microservices, and web services tools and technologies</li>\n<li>Use Spring Framework, Boot, and other Spring technologies</li>\n<li>Integrate with Redis, RabbitMQ, Cassandra, NoSQL,</li>\n</ul>\n</div>\n<p>and much more</p>\n<ul>\n<li>Test the case study code under various scenarios and stresses</li>\n</ul>\n<div></div>\n<div>Who This Book Is For<p></p>\n</div>\n<div></div>\n<div>Experienced Java developers with at least some prior experience with Java, especially Spring Framework, Boot and other tools, and some web services.</div>",
    "download_link": "http://file.allitebooks.com/20170811/Pro%20Java%20Clustering%20and%20Scalability.pdf",
    "file_format": "PDF",
    "file_size": "3.7 MB",
    "image": "Pro-Java-Clustering-and-Scalability.jpg",
    "isbn_10": "1484229843",
    "language": "English",
    "pages": "149",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27945",
    "title": "Pro Java Clustering and Scalability",
    "top_category": "Administration",
    "year": "2017",
    "id": 62
  },
  {
    "author": [
      "Uchit Vyas"
    ],
    "category": [
      "Cloud & Virtualization"
    ],
    "description": "<div>\n<div>Learn practical and applied OpenStack cloud design solutions to gain maximum control over your infrastructure. You will achieve a complete controlled and customizable platform.<p></p>\n</div>\n<div></div>\n<div></div>\n<div>Applied OpenStack Design Patterns starts off with the basics of OpenStack and teaches you how to map your application flow. Application behavior with OpenStack components is discussed. Once components and architectural design patterns are set up, you will learn how to map native infrastructure and applications using OpenStack.<p></p>\n</div>\n<div></div>\n<div></div>\n<p>Also covered is the use of storage management and computing to map user requests and allocations. The author takes a deep dive into the topic of High Availability and Native Cluster Management, including the best practices associated with it. The book concludes with solution patterns for networking components of OpenStack, to reduce latency and enable faster communication gateways between components of OpenStack and native applications.</p>\n</div>\n<div></div>\n<div>\n<div>What you will learn:<p></p>\n</div>\n<div>\n<ul>\n<li>Modern cloud infrastructure design techniques</li>\n<li>Complex application infrastructure design solutions</li>\n<li>Understanding of various OpenStack cloud infrastructure components</li>\n<li>Adoption and business impact analysis of OpenStack to support existing/new cloud infrastructure</li>\n<li>Use of specific components of OpenStack which can integrate with an existing tool-chain set to gain agility and a quick, continuous delivery model</li>\n</ul>\n</div>\n<div></div>\n<div>Who is this book for<p></p>\n</div>\n<div></div>\n<div>Seasoned solution architects, DevOps, and system engineers and analysts.</div>\n</div>",
    "download_link": "http://file.allitebooks.com/20170101/Applied%20OpenStack%20Design%20Patterns.pdf",
    "file_format": "PDF",
    "file_size": "6.8 MB",
    "image": "Applied-OpenStack-Design-Patterns.jpg",
    "isbn_10": "1484224531",
    "language": "English",
    "pages": "130",
    "read_link": "http://www.allitebooks.com/read/index.php?id=26020",
    "title": "Applied OpenStack Design Patterns",
    "top_category": "Administration",
    "year": "2016",
    "id": 63
  },
  {
    "author": [
      "Dale Green"
    ],
    "category": [
      "C C++",
      "Game Programming",
      "Cloud & Virtualization"
    ],
    "description": "<p>Procedural generation is a growing trend in game development. It allows developers to create games that are bigger and more dynamic, giving the games a higher level of replayability. Procedural generation isn’t just one technique, it’s a collection of techniques and approaches that are used together to create dynamic systems and objects. C++ is the industry-standard programming language to write computer games. It’s at the heart of most engines, and is incredibly powerful. SFML is an easy-to-use, cross-platform, and open-source multimedia library. Access to computer hardware is broken into succinct modules, making it a great choice if you want to develop cross-platform games with ease.</p>\n<p>Using C++ and SFML technologies, this book will guide you through the techniques and approaches used to generate content procedurally within game development.</p>\n<p>Throughout the course of this book, we’ll look at examples of these technologies, starting with setting up a roguelike project using the C++ template. We’ll then move on to using RNG with C++ data types and randomly scattering objects within a game map. We will create simple console examples to implement in a real game by creating unique and randomised game items, dynamic sprites, and effects, and procedurally generating game events. Then we will walk you through generating random game maps. At the end, we will have a retrospective look at the project.</p>\n<p>By the end of the book, not only will you have a solid understanding of procedural generation, but you’ll also have a working roguelike game that you will have extended using the examples provided.</p>",
    "download_link": "http://file.allitebooks.com/20170623/Procedural%20Content%20Generation%20for%20C++%20Game%20Development.pdf",
    "file_format": "PDF",
    "file_size": "3.4 MB",
    "image": "Procedural-Content-Generation-for-C++-Game-Development.jpg",
    "isbn_10": "1785886711",
    "language": "English",
    "pages": "304",
    "read_link": "http://www.allitebooks.com/read/index.php?id=27648",
    "title": "Procedural Content Generation for C++ Game Development",
    "top_category": "Administration",
    "year": "304",
    "id": 64
  },
  {
    "author": [
      "Daniel Langenhan"
    ],
    "category": [
      "Cloud & Virtualization"
    ],
    "description": "<p>VMware vRealize Orchestrator is a powerful automation tool designed for system administrators and IT operations staff who are planning to streamline their tasks and are waiting to integrate the functions with third-party operations software. This book is an update to VMware vRealize Orchestrator Cookbook and is blend of numerous recipes on vRealize Orchestrator 7.</p>\n<p>This book starts with installing and configuring vRealize Orchestrator. We will demonstrate how to upgrade from previous versions to vRealize Orchestrator 7. You will be taught all about orchestrator plugins and how to use and develop various plugins that have been enhanced in Orchestrator 7. Throughout this book, you will explore the new features of Orchestrator 7, such as the introduction of the control center, along with its uses.</p>\n<p>You will also come to understand visual programming, how to integrate base plugins into workflows, and how to automate VMware. You will also get to know how to troubleshoot vRealize Orchestrator.</p>\n<p>By the end of this book, you will be able to get the most out of your Orchestrator installation, and will be able to develop complex workflows and create your own highly integrated automations of vRealize environments.</p>\n<p>What You Will Learn</p>\n<ul>\n<li>Install, configure, and optimize Orchestrator installations (Windows, Appliance, and vRA integrated)</li>\n<li>Explore all the visual programming elements without needing additional infrastructure</li>\n<li>Work with plugins such as SSH, mail, SQL, PowerShell, AD, SOAP, SNMP, AMQP, and REST</li>\n<li>Discover how to create VMware automation</li>\n<li>Get to know about user management, import/export, and synchronization as well as the packaging application</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20161227/VMware%20vRealize%20Orchestrator%20Cookbook,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "14.1 MB",
    "image": "VMware-vRealize-Orchestrator-Cookbook,-2nd-Edition.jpg",
    "isbn_10": "1786462788",
    "language": "English",
    "pages": "840",
    "read_link": "http://www.allitebooks.com/read/index.php?id=25920",
    "title": "VMware vRealize Orchestrator Cookbook, 2nd Edition",
    "top_category": "Administration",
    "year": "2016",
    "id": 65
  },
  {
    "author": [
      "Christopher Kusek",
      "Matt Liebowitz",
      "Rynardt Spies"
    ],
    "category": [
      "Cloud & Virtualization"
    ],
    "description": "<p>Covering the latest VMware vSphere software, an essential book aimed at solving vSphere performance problems before they happen</p>\n<p>VMware vSphere is the industry’s most widely deployed virtualization solution. However, if you improperly deploy vSphere, performance problems occur. Aimed at VMware administrators and engineers and written by a team of VMware experts, this resource provides guidance on common CPU, memory, storage, and network-related problems. Plus, step-by-step instructions walk you through techniques for solving problems and shed light on possible causes behind the problems.</p>\n<ul>\n<li>Divulges troubleshooting methodologies, performance monitoring tools, and techniques and tools for isolating performance problems</li>\n<li>Details the necessary steps for handling CPU, memory, storage, and network-related problems</li>\n<li>Offers understanding on the interactions between VMware vSphere and CPU, memory, storage, and network</li>\n</ul>\n<p>VMware vSphere Performance is the resource you need to diagnose and handle VMware vSphere performance problems, and avoid them in the future.</p>",
    "download_link": "http://file.allitebooks.com/20161212/VMware%20vSphere%20Performance.pdf",
    "file_format": "PDF",
    "file_size": "5.6 MB",
    "image": "VMware-vSphere-Performance.jpg",
    "isbn_10": "1118008197",
    "language": "English",
    "pages": "266",
    "read_link": "http://www.allitebooks.com/read/index.php?id=25584",
    "title": "VMware vSphere Performance",
    "top_category": "Administration",
    "year": "2014",
    "id": 66
  },
  {
    "author": [
      "Vishal Sharma"
    ],
    "category": [
      "Administration"
    ],
    "description": "<div>\n<p>This book teaches you how to install, configure and implement the Elastic Stack (Elasticsearch, Logstash and Kibana) – the invaluable tool for anyone deploying a centralized log management solution for servers and apps. Supported by Puppet and available with various plugins, Elastic Stack is the best option for your server log management.</p>\n<p>You will learn how to use and configure Elastic Stack independently and alongside Puppet. Each chapter includes real-world examples and practical troubleshooting tips, enabling you to get up and running with Elastic Stack in record time. Fully customizable and easy to use, Elastic Stack enables you to be on top of your servers all the time, and resolve problems for your clients as fast as possible. Get started with it using this book today.</p>\n</div>\n<div></div>\n<div>What You Will Learn:<p></p>\n</div>\n<div>\n<div>\n<ul>\n<li>How to install and configure Logstash</li>\n<li>How to use Logstash with Elasticsearch and Kibana</li>\n<li>How to use Logstash with Puppet and Foreman</li>\n<li>How to centralize data processing</li>\n</ul>\n</div>\n</div>\n<div>Who This Book Is For:<p></p>\n</div>\n<div></div>\n<div>Beginning Elastic Stack&nbsp;is for anyone working on multiple servers who needs to search their logs using a web interface. It is ideal for server administrators who have just started their job and need to look after multiple servers efficiently.</div>",
    "download_link": "http://file.allitebooks.com/20161210/Beginning%20Elastic%20Stack.pdf",
    "file_format": "PDF",
    "file_size": "9.3 MB",
    "image": "Beginning-Elastic-Stack.jpg",
    "isbn_10": "1484216938",
    "language": "English",
    "pages": "171",
    "read_link": "http://www.allitebooks.com/read/index.php?id=25515",
    "title": "Beginning Elastic Stack",
    "top_category": "Administration",
    "year": "2017",
    "id": 67
  },
  {
    "author": [
      "Daniel Mitchell",
      "Tom Keegan"
    ],
    "category": [
      "Cloud & Virtualization"
    ],
    "description": "<p>A plain-English guide to the market-leading virtualization and cloud computing technology</p>\n<p>With virtualization, a single server can host dozens or hundreds of virtual machines running a variety of operating systems, and even hook them together in a virtual network or cloud infrastructure. This practical guide shows you how to create a virtual system using the VMware VSphere environment.&nbsp; You’ll find all the information you need to understand, design, and deploy one—without getting overwhelmed with technical detail. And once you’re up and running, this book is the perfect reference for maintenance and troubleshooting issues.</p>\n<ul>\n<li>Introduces you to virtualization and VMware’s virtualization/cloud computing technology, the most recent version is VMware vSphere Shows you how to design a vSphere environment</li>\n<li>Covers installation, deployment, management, maintenance, and troubleshooting</li>\n<li>Provides what IT managers and system administrators need to roll out their first virtualized or cloud infrastructure, or to get up to speed on VMware’s technology</li>\n</ul>\n<p>Get up and running on the cloud with VMware vSphere For Dummies!</p>",
    "download_link": "http://file.allitebooks.com/20161212/VMware%20vSphere%20For%20Dummies.pdf",
    "file_format": "PDF",
    "file_size": "28.7 MB",
    "image": "VMware-vSphere-For-Dummies.jpg",
    "isbn_10": "047076872X",
    "language": "English",
    "pages": "359",
    "read_link": "http://www.allitebooks.com/read/index.php?id=25568",
    "title": "VMware vSphere For Dummies",
    "top_category": "Administration",
    "year": "2011",
    "id": 68
  },
  {
    "author": [
      "Rahul Soni"
    ],
    "category": [
      "Web Servers"
    ],
    "description": "<div>Teaches you to start up Nginx and quickly take your expertise to a level where you can comfortably work with various aspects of the web server and make informed design decisions for your web farm. Nginx powers more than 40% of the top 1000 websites and is among the handful of web servers that can handle more than 10K simultaneous connections. It has some features which are simply unparalleled.</div>\n<div></div>\n<div>Nginx: From Beginner to Pro&nbsp;teaches the Nginx server in a practical way. Frequently, it is found that web administrators struggle to fix the skill set gaps that happen due to a platform change. Migration from IIS &amp; Apache becomes tedious at best. The book is targeted toward real-world administrators who would want to get up to speed as soon as possible and make good, informed design decisions. First you will set up Nginx and understand the architectural nuances. Then you will learn how to scale out, secure, monitor and troubleshoot the web server. Once you are fully comfortable with Nginx, you will start learning about migrating applications (or its part) from IIS or Apache web servers. Finally, you will learn to troubleshoot and maintain your Nginx professionally.</div>\n<div></div>\n<div>Written by an author who has gone through the rough phase while moving from IIS/Apache to Nginx, this book is practical and filled with step-by-step instructions to make your time with Nginx as straightforward as possible.</div>\n<div></div>\n<div>What You Will Learn</div>\n<div>\n<ul>\n<li>Install &amp; setup Nginx on CentOS, Ubuntu &amp; Mac.</li>\n<li>Understand Nginx modules and compiling Nginx with appropriate modules.</li>\n<li>Learn about basic configuration and architecture along with hosting nuances.</li>\n<li>How to load balance Nginx and use it as a highly available web platform.</li>\n<li>How to monitor traffic and automate common administrative tasks.</li>\n<li>How to use scripts to perform routine checks for health issues.</li>\n<li>Learn how to implement security and authentication in Nginx.</li>\n<li>Learn how and what to migrate from IIS &amp; Apache web servers.</li>\n</ul>\n</div>",
    "download_link": "http://file.allitebooks.com/20160828/Nginx%20From%20Beginner%20to%20Pro.pdf",
    "file_format": "PDF",
    "file_size": "10.2 MB",
    "image": "Nginx:-From-Beginner-to-Pro.jpg",
    "isbn_10": "1484216571",
    "language": "English",
    "pages": "240",
    "read_link": "http://www.allitebooks.com/read/index.php?id=23687",
    "title": "Nginx: From Beginner to Pro",
    "top_category": "Administration",
    "year": "2016",
    "id": 69
  },
  {
    "author": [
      "Boris Smus"
    ],
    "category": [
      "Web Development",
      "Administration"
    ],
    "description": "<p>Go beyond HTML5’s Audio tag and boost the audio capabilities of your web application with the Web Audio API. Packed with lots of code examples, crisp descriptions, and useful illustrations, this concise guide shows you how to use this JavaScript API to make the sounds and music of your games and interactive applications come alive.</p>\n<p>You need little or no digital audio expertise to get started. Author Boris Smus introduces you to digital audio concepts, then shows you how the Web Audio API solves specific application audio problems. If you’re an experienced JavaScript programmer, you’ll not only learn how to synthesize and process digital audio, you’ll also explore audio analysis and visualization with this API.</p>\n<ul>\n<li>Learn Web Audio API, including audio graphs and the audio nodes</li>\n<li>Provide quick feedback to user actions by scheduling sounds with the API’s precise timing model</li>\n<li>Control gain, volume, and loudness, and dive into clipping and crossfading</li>\n<li>Understand pitch and frequency: use tools to manipulate soundforms directly with JavaScript</li>\n<li>Generate synthetic sound effects and learn how to spatialize sound in 3D space</li>\n<li>Use Web Audio API with the Audio tag, getUserMedia, and the Page Visibility API</li>\n</ul>",
    "download_link": "http://file.allitebooks.com/20160701/Web%20Audio%20API.pdf",
    "file_format": "PDF",
    "file_size": "10.1 MB",
    "image": "Web-Audio-API.jpg",
    "isbn_10": "1449332684",
    "language": "English",
    "pages": "76",
    "read_link": "http://www.allitebooks.com/read/index.php?id=22753",
    "title": "Web Audio API",
    "top_category": "Administration",
    "year": "2013",
    "id": 70
  },
  {
    "author": [
      "Christine Bresnahan",
      "Richard Blum"
    ],
    "category": [
      "Linux"
    ],
    "description": "Book Description:\n\nFull coverage of the latest LPI-level 2 exams, with bonus online test bank\n\nLPIC-2 is the one-stop preparation resource for the Linux Professional Institute’s Advanced Level certification exam. With 100 percent coverage of all exam objectives, this book provides clear and concise coverage of the Linux administration topics you’ll need to know for exams 201 and 202. Practical examples highlight the real-world applications of important concepts, and together, the author team provides insights based on almost fifty years in the IT industry. This brand new second edition has been completely revamped to align with the latest versions of the exams, with authoritative coverage of the Linux kernel, system startup, advanced storage, network configuration, system maintenance, web services, security, troubleshooting, and more. You also get access to online learning tools including electronic flashcards, chapter tests, practice exams, and a glossary of critical terms to help you solidify your understanding of upper-level Linux administration topics.\n\nThe LPI-level 2 certification confirms your advanced Linux skill set, and the demand for qualified professionals continues to grow. This book gives you the conceptual guidance and hands-on practice you need to pass the exam with flying colors.\n\nUnderstand all of the material for both LPIC-2 exams\nGain insight into real-world applications\nTest your knowledge with chapter tests and practice exams\nAccess online study aids for more thorough preparation\nOrganizations are flocking to the open-source Linux as an excellent, low-cost, secure alternative to expensive operating systems like Microsoft Windows. As the Linux market share continues to climb, organizations are scrambling to find network and server administrators with expert Linux knowledge and highly practical skills. The LPI-level 2 certification makes you the professional they need, and LPIC-2 is your ideal guide to getting there.",
    "download_link": "http://file.allitebooks.com/20170829/PIC-2%20Linux%20Professional%20Institute%20Certification%20Study%20Guide,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "14.8 MB",
    "image": "PIC-2:-Linux-Professional-Institute-Certification-Study-Guide,-2nd-Edition.jpg",
    "isbn_10": "1119150795",
    "language": "English",
    "pages": 768,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28035",
    "sub_title": "Exam 201 and Exam 202",
    "title": "PIC-2: Linux Professional Institute Certification Study Guide, 2nd Edition",
    "year": 2016,
    "id": 4
  },
  {
    "author": [
      "Antonio Lopez"
    ],
    "category": [
      "PHP"
    ],
    "description": "Book Description:\n\nPHP is a great language for building web applications. It is essentially a server-side scripting language that is also used for general purpose programming. PHP 7 is the latest version with a host of new features, and it provides major backwards-compatibility breaks.\n\nThis book begins with the fundamentals of PHP programming by covering the basic concepts such as variables, functions, class, and objects. You will set up PHP server on your machine and learn to read and write procedural PHP code. After getting an understanding of OOP as a paradigm, you will execute MySQL queries on your database. Moving on, you will find out how to use MVC to create applications from scratch and add tests. Then, you will build REST APIs and perform behavioral tests on your applications.\n\nBy the end of the book, you will have the skills required to read and write files, debug, test, and work with MySQL.\n\nWhat you will learn\n\nSet up a server on your machine with PHP\nUse PHP syntax with the built-in server to create apps\nApply the OOP paradigm to PHP to write richer code\nUse MySQL to manage data in your web applications\nCreate a web application from scratch using MVC\nAdd tests to your web application and write testable code\nUse an existing PHP framework to build and manage your applications\nBuild REST APIs for your PHP applications\nTest the behavior of web applications with Behat",
    "download_link": "http://file.allitebooks.com/20170827/Learning%20PHP%207.pdf",
    "file_format": "PDF",
    "file_size": "5.8 MB",
    "image": "Learning-PHP-7.jpg",
    "isbn_10": "1785880543",
    "language": "English",
    "pages": 414,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28029",
    "sub_title": "Learn the art of PHP programming through this example-rich book filled to the brim with tutorials every PHP developer needs to know",
    "title": "Learning PHP 7",
    "year": 2016,
    "id": 5
  },
  {
    "author": [
      "Bryan WC Chung"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nApply the Processing language to tasks involved in computer vision–tasks such as edge and corner detection, recognition of motion between frames in a video, recognition of objects, matching of feature points and shapes in different frames for tracking purposes, and more. You will manipulate images through creative effects, geometric transformation, blending of multiple images, and so forth. Examples are provided.\nPro Processing for Images and Computer Vision with OpenCV is a step-by-step training tool that guides you through a series of worked examples in linear order. Each chapter begins with a basic demonstration, including the code to recreate it on your own system. Then comes a creative challenge by which to engage and develop mastery of the chapter’s topic. The book also includes hints and tips relating to visual arts, interaction design, and industrial best practices.\nThis book is intended for any developer of artistic and otherwise visual applications, such as in augmented reality and digital effects, with a need to manipulate images, and to recognize and manipulate objects within those images. The book is specifically targeted at those making use of the Processing language that is common in artistic fields, and to Java programmers because of Processing’s easy integration into the Java programming environment.\nWhat You’ll Learn\nMake use of OpenCV, the open source library for computer vision in the Processing environment\nCapture live video streams and examine them frame-by-frame for objects in motion\nRecognize shapes and objects through techniques of detecting lines, edges, corners, and more\nTransform images by scaling, translating, rotating, and additionally through various distortion effects\nApply techniques such as background subtraction to isolate motion of objects in live video streams\nDetect and track human faces and other objects by matching feature points in different images or video frames\nWho This Book Is For\nMedia artists, designers, and creative coders",
    "download_link": "http://file.allitebooks.com/20170827/Pro%20Processing%20for%20Images%20and%20Computer%20Vision%20with%20OpenCV.pdf",
    "file_format": "PDF",
    "file_size": "11.6 MB",
    "image": "Pro-Processing-for-Images-and-Computer-Vision-with-OpenCV.jpg",
    "isbn_10": "1484227743",
    "language": "English",
    "pages": 292,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28026",
    "sub_title": "Solutions for Media Artists and Creative Coders",
    "title": "Pro Processing for Images and Computer Vision with OpenCV",
    "year": 2017,
    "id": 6
  },
  {
    "author": [
      "Nathan Haines"
    ],
    "category": [
      "Operating Systems"
    ],
    "description": "Book Description:\n\nDiscover how to get the most out of Ubuntu for work, home, and play.  Learning a new operating system can feel daunting, especially if you’re used to Windows or OS X. If you’ve been afraid to try Ubuntu because you don’t know where to start, this book introduces you to a wide selection of software and settings that will make your computer ready to work for you.\n\nYou’ll see how Ubuntu can make your computing life easy. In addition to a tour of Ubuntu’s modern and easy-to-use interface, you’ll also learn how Ubuntu’s Software Updater keeps all of your software secure and up-to-date. Browsing the Internet becomes faster and safer. Creating documents and sharing with others is built right in. Enjoying your music and movie libraries helps you unwind.\nUbuntu is the world’s third most popular operating system and powers desktop and laptop computers, servers, private and public clouds, and embedded devices. There’s never been a better time to install Ubuntu and move to an open source way of life. Completely updated for this exciting second edition, Beginning Ubuntu for Windows and Mac Users will help you start your journey into Free and Open Source Software with Ubuntu 16.04 LTS.\nWhat You’ll Learn\nUnderstand the advantages of Ubuntu and its variants―Kubuntu, Xubuntu, and more\nInstall Ubuntu on its own or alongside your computer’s existing operating system\nSearch Ubuntu’s catalog of thousands of applications―all ready to install with a single click\nWork with files and disks that were created with Windows and OS X\nRun simple, interesting tasks and games using the command line\nCustomize Ubuntu in powerful ways and get work done with virtual machines\nWho This Book Is For\nAnyone who wants to move to using an open source operating system.",
    "download_link": "http://file.allitebooks.com/20170826/Beginning%20Ubuntu%20for%20Windows%20and%20Mac%20Users,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "11.9 MB",
    "image": "Beginning-Ubuntu-for-Windows-and-Mac-Users,-2nd-Edition.jpg",
    "isbn_10": "1484229991",
    "language": "English",
    "pages": 196,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28022",
    "sub_title": "Start your Journey into Free and Open Source Software",
    "title": "Beginning Ubuntu for Windows and Mac Users, 2nd Edition",
    "year": 2017,
    "id": 7
  },
  {
    "author": [
      "Pradeep Macharla"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nMaster continuous integration, deployment and automated testing for Android apps. You’ll see how to set up and tear down sandbox environments to test the end-user experience, where you’ll learn how to manage a mobile device in addition to the build machine. Android Continuous Integration applies a real-world CI pattern that has been thoroughly tested and implemented.\nThis book starts with continuous integration concepts and the tools and code needed to become proficient in continuous integration for Android apps. You’ll also follow acceptance test driven development (ATDD) best practice, giving you all the skills you need to become a better, more effective developer. Finally, you’ll learn about the Appium mobile automation library and the Jenkins continuous integration tool.\nWhat You Will Learn\nUnderstand how to build an Android mobile app from source\nSet up a development or debuggi\nng environment for mobile apps\n\nIntegrate with the Nexus dependency management and application release tool\nWork with the SonarQube code quality analyzer\nUse debugging tools in Android\nWho This Book Is For\nProduct owners/business analysts, QA/test engineers, developers and build/deploy engineers.",
    "download_link": "http://file.allitebooks.com/20170826/Android%20Continuous%20Integration.pdf",
    "file_format": "PDF",
    "file_size": "7.8 MB",
    "image": "Android-Continuous-Integration.jpg",
    "isbn_10": "1484227956",
    "language": "English",
    "pages": 141,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28017",
    "sub_title": "Build-Deploy-Test Automation for Android Mobile Apps",
    "title": "Android Continuous Integration",
    "year": 2017,
    "id": 8
  },
  {
    "author": [
      "Mark McDonnell"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nGet up to speed with Clojure in this quick and practical primer. You’ll learn the nuts and bolts of functional programming, data structures, sequences, destructuring, pattern matching, polymorphism, concurrency, conventions, and more. Author Mark McDonnell talks about organization with namespaces; how to change the language via macros; object-oriented programming; and creating command-line apps. Finally, he shows you how to write Clojure from shell languages and interfaces such as Vim.\nAfter reading and using Quick Clojure, you’ll come away with first-hand knowledge and advice on how to quickly adopt, use, and apply Clojure without all the theoretical baggage that bigger books can sometimes bring.\nWhat You’ll Learn\nWork with data structures and their syntax\nDiscover OOP in Clojure with patterns, polymorphisms, pattern matching, and concurrency\nUse conventions, organization, and namespaces in Clojure\nCreate command-line apps\nBuild various Clojure projects with the Leiningen IDE tool and framework\nWho This Book Is For\nProgrammers with experience.  A Java background would be helpful, but not required.",
    "download_link": "http://file.allitebooks.com/20170825/Quick%20Clojure.pdf",
    "file_format": "PDF",
    "file_size": "2.3 MB",
    "image": "Quick-Clojure.jpg",
    "isbn_10": "1484229517",
    "language": "English",
    "pages": 200,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28008",
    "sub_title": "Effective Functional Programming",
    "title": "Quick Clojure",
    "year": 2017,
    "id": 9
  },
  {
    "author": [
      "Joshua Cook"
    ],
    "category": [
      "Data Processing"
    ],
    "description": "Book Description:\n\nLearn Docker “infrastructure as code” technology to define a system for performing standard but non-trivial data tasks on medium- to large-scale data sets, using Jupyter as the master controller.\nIt is not uncommon for a real-world data set to fail to be easily managed. The set may not fit well into access memory or may require prohibitively long processing. These are significant challenges to skilled software engineers and they can render the standard Jupyter system unusable.\nAs a solution to this problem, Docker for Data Science proposes using Docker. You will learn how to use existing pre-compiled public images created by the major open-source technologies―Python, Jupyter, Postgres―as well as using the Dockerfile to extend these images to suit your specific purposes. The Docker-Compose technology is examined and you will learn how it can be used to build a linked system with Python churning data behind the scenes and Jupyter managing these background tasks. Best practices in using existing images are explored as well as developing your own images to deploy state-of-the-art machine learning and optimization algorithms.\nWhat  You’ll Learn\nMaster interactive development using the Jupyter platform\nRun and build Docker containers from scratch and from publicly available open-source images\nWrite infrastructure as code using the docker-compose tool and its docker-compose.yml file type\nDeploy a multi-service data science application across a cloud-based system\nWho This Book Is For\nData scientists, machine learning engineers, artificial intelligence researchers, Kagglers, and software developers",
    "download_link": "http://file.allitebooks.com/20170825/Docker%20for%20Data%20Science.pdf",
    "file_format": "PDF",
    "file_size": "7.1 MB",
    "image": "Docker-for-Data-Science.jpg",
    "isbn_10": "1484230116",
    "language": "English",
    "pages": 257,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28012",
    "sub_title": "Building Scalable and Extensible Data Infrastructure Around the Jupyter Notebook Server",
    "title": "Docker for Data Science",
    "year": 2017,
    "id": 10
  },
  {
    "author": [
      "Harry J.W. Percival"
    ],
    "category": [
      "Python"
    ],
    "description": "Book Description:\n\nBy taking you through the development of a real web application from beginning to end, the second edition of this hands-on guide demonstrates the practical advantages of test-driven development (TDD) with Python. You’ll learn how to write and run tests before building each part of your app, and then develop the minimum amount of code required to pass those tests. The result? Clean code that works.\n\nIn the process, you’ll learn the basics of Django, Selenium, Git, jQuery, and Mock, along with current web development techniques. If you’re ready to take your Python skills to the next level, this book—updated for Python 3.6—clearly demonstrates how TDD encourages simple designs and inspires confidence.\n\nDive into the TDD workflow, including the unit test/code cycle and refactoring\nUse unit tests for classes and functions, and functional tests for user interactions within the browser\nLearn when and how to use mock objects, and the pros and cons of isolated vs. integrated tests\nTest and automate your deployments with a staging server\nApply tests to the third-party plugins you integrate into your site\nRun tests automatically by using a Continuous Integration environment\nUse TDD to build a REST API with a front-end Ajax interface",
    "download_link": "http://file.allitebooks.com/20170822/Test-Driven%20Development%20with%20Python,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "11.6 MB",
    "image": "Test-Driven-Development-with-Python,-2nd-Edition.jpg",
    "isbn_10": "1491958707",
    "language": "English",
    "pages": 614,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28005",
    "sub_title": "Obey the Testing Goat: Using Django, Selenium, and JavaScript",
    "title": "Test-Driven Development with Python, 2nd Edition",
    "year": 2017,
    "id": 11
  },
  {
    "author": [
      "Jose Argudo"
    ],
    "category": [
      "Web Development"
    ],
    "description": "Book Description:\n\nThis book is for developers who are new to CodeIgniter. Basic skills in PHP and MySQL are required, but only rudimentary object-oriented knowledge is needed. If you’re looking for a better way to develop PHP applications, or want to find out more about the CodeIgniter framework as a viable option for one of your own projects, this book will help you. This book takes a step- by-step approach, presenting the main features of CodeIgniter in a systematic way and explaining them clearly. It is packed with examples, ideas, and screenshots to help you master this great framework. The code examples are very practical so you can even use them in your own projects. By following this book, you can use CodeIgniter in the best possible way and maximize your learning.",
    "download_link": "http://file.allitebooks.com/20170820/CodeIgniter%201.7.pdf",
    "file_format": "PDF",
    "file_size": "3.1 MB",
    "image": "CodeIgniter-1.7.jpg",
    "isbn_10": "1847199488",
    "language": "English",
    "pages": 300,
    "read_link": "http://www.allitebooks.com/read/index.php?id=28002",
    "sub_title": "Improve your PHP coding productivity with the free compact open source MVC CodeIgniter framework!",
    "title": "CodeIgniter 1.7",
    "year": 2009,
    "id": 12
  },
  {
    "author": [
      "Adam Boduch"
    ],
    "category": [
      "JavaScript"
    ],
    "description": "Book Description:\n\nWhilst React has become Facebook’s poster-child for clean, complex, and modern web development, it has quietly been underpinned by its simplicity. It’s just a view. The real beauty in React is actually the architectural pattern that handles data in and out of React applications: Flux. With Flux, you’re able to build data-rich applications that engage your users, and scale to meet every demand. It is a key part of the Facebook technology stack that serves billions of users every day.\n\nThis book will start by introducing the Flux pattern and help you get an understanding of what it is and how it works. After this, we’ll build real-world React applications that highlight the power and simplicity of Flux in action. Finally, we look at the landscape of Flux and explore the Alt and Redux libraries that make React and Flux developments easier.\n\nFilled with fully-worked examples and code-first explanations, by the end of the book, you’ll not only have a rock solid understanding of the architecture, but will be ready to implement Flux architecture in anger.\n\nWhat you will learn\n\nUnderstand the Flux pattern and how it will impact your React applications\nBuild real-world applications that rely on Flux\nHandle asynchronous actions in your application\nImplement immutable stores with Immutable.js\nReplace React.js with alternate View components such as jQuery and Handlebars\nTest and benchmark your Flux architecture using Jest―Facebook’s enhancement of the Jasmine library",
    "download_link": "http://file.allitebooks.com/20170820/Flux%20Architecture.pdf",
    "file_format": "PDF",
    "file_size": "2.1 MB",
    "image": "Flux-Architecture.jpg",
    "isbn_10": "1786465817",
    "language": "English",
    "pages": 352,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27999",
    "sub_title": "Learn to build powerful and scalable applications with Flux, the architecture that serves billons of Facebook users every day",
    "title": "Flux Architecture",
    "year": 2016,
    "id": 13
  },
  {
    "author": [
      "D. Young"
    ],
    "category": [
      "Computer Science"
    ],
    "description": "Book Description:\n\nTired of an e-mail BCC list that scrolls off the page, or fiddly and hard-to-manage bulk mailing systems? You need PHPList – a high-powered, robust, feature-packed mailing system that will get out of your way and get the job done! You want to know more about PHPList?\n\nPHPList is a popular open source e-mail campaign manager, sporting a powerful web frontend, rich message editor, and an advanced feature set.\n\nPHPList 2 E-mail Campaign Manager will guide you from basic installation and setup through management, reporting, and automation of PHPList, the world’s most popular open source e-mail campaign manager. It also covers advanced customization and configuration of PHPList.\n\nWe start with a basic configuration, and finish with a full-featured e-mail management engine. You will work your way up from basic installation to advanced topics such as bounce automation, user and click-through tracking, and integration with third-party tools such as WordPress, Joomla!, Drupal, and Blogger.\n\nAdvanced topics such as securing your installation against spammers, attacks, and vulnerabilities are covered, as well as additional advanced and experimental features offered by PHPList.\n\nThis book is an invaluable guide for any e-mail publisher who wants a robust and powerful engine to manage their small-to-huge e-mail distribution empire.\n\nThis book is a step-by-step, in-depth guide to the features and usage of the world’s most popular open source e-mail campaign manager, PHPList.\n\nWhat you will learn from this book\n\nInstall and set up PHPList on your web hosting platform\nIntegrate subscription with third-party publishing platforms\nConfigure intelligent bounce handling\nIntegrate membership and features with Joomla!, Drupal, WordPress, and Blogger\nAutomate list management and bounce processing\nGain insight with user and click tracking reports\nLeverage advanced features for greater flexibility and results\nSecure PHPList from attacks and future vulnerabilities\nTroubleshoot common issues\nAvoid dealing with spammers by implementing CAPTCHAs",
    "download_link": "http://file.allitebooks.com/20170819/PHPList%202%20E-mail%20Campaign%20Manager.pdf",
    "file_format": "PDF",
    "file_size": "18.5 MB",
    "image": "PHPList-2-E-mail-Campaign-Manager.jpg",
    "isbn_10": "1849511047",
    "language": "English",
    "pages": 236,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27996",
    "sub_title": "Get to grips with the PHPList e-mail announcement delivery system!",
    "title": "PHPList 2 E-mail Campaign Manager",
    "year": 2011,
    "id": 14
  },
  {
    "author": [
      "Jagdeep Jain",
      "Sai Matam"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nQuickly ramp up your practical knowledge of Apache JMeter for software performance testing and focus on actual business problems. This step-by-step guide covers what you will need to know to write and execute test scripts, and verify the results.\n\nPro Apache JMeter covers almost every aspect of Apache JMeter in detail and includes helpful screenshots and a case study. A performance primer chapter provides a high-level summary of terms used in performance testing on a day-to-day basis that also is useful for non-technical readers.\n\nA sample web application Digital Toys has been developed and test scripts are provided for you to try while progressing through the chapters.\n\nWhat You’ll Learn\n\nCreate and execute an Apache JMeter test plan\nInterpret the results of your test plan\nUnderstand distributed testing using Apache JMeter\nUse Apache JMeter advanced features such as JDBC, REST, FTP, AJAX, SOAP, and mobile performance testing\nRead a sample case study covering end-to-end planning and execution of a performance testing project\nGenerate and analyze a performance dashboard\nWho This Book Is For\n\nSoftware performance testing professionals, quality assurance professionals, architects, engineers, project managers, product managers",
    "download_link": "http://file.allitebooks.com/20170818/Pro%20Apache%20JMeter.pdf",
    "file_format": "PDF",
    "file_size": "21.3 MB",
    "image": "Pro-Apache-JMeter.jpg",
    "isbn_10": "1484229606",
    "language": "English",
    "pages": 335,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27993",
    "sub_title": "Web Application Performance Testing",
    "title": "Pro Apache JMeter",
    "year": 2017,
    "id": 15
  },
  {
    "author": [
      "Nishith Pathak"
    ],
    "category": [
      ".NET"
    ],
    "description": "Book Description:\n\nGet introduced to the world of artificial intelligence with this accessible and practical guide. Build applications that make intelligent use of language and user interaction to better compete in today’s marketplace. Discover how your application can deeply understand and interpret content on the web or a user’s machine, intelligently react to direct user interaction through speech or text, or make smart recommendations on products or services that are tailored to each individual user.\n\nWith Microsoft Cognitive Services, you can do all this and more utilizing a set of easy-to-use APIs that can be consumed on the desktop, web, or mobile devices. Developers normally think of AI implementation as a tough task involving writing complex algorithms. This book aims to remove the anxiety by creating a cognitive application with a few lines of code. There is a wide range of Cognitive Services APIs available. This book focuses on some of the most useful and powerful ways that your application can make intelligent use of language.\n\nArtificial Intelligence for .NET: Speech, Language, and Search will show you how you can start building amazing capabilities into your applications today.\n\nWhat You’ll Learn\nUnderstand the underpinnings of artificial intelligence through practical examples and scenarios\nGet started building an AI-based application in Visual Studio\nBuild a text-based conversational interface for direct user interaction\nUse the Cognitive Services Speech API to recognize and interpret speech\nLook at different models of language, including natural language processing, and how to apply them in your Visual Studio application\nReuse Bing search capabilities to better understand a user’s intention\nWork with recommendation engines and integrate them into your apps\nWho This Book Is For\nDevelopers working on a range of platforms, from .NET and Windows to mobile devices. Examples are given in C#. No prior experience with AI techniques or theory is required.",
    "download_link": "http://file.allitebooks.com/20170817/Artificial%20Intelligence%20for%20.NET.pdf",
    "file_format": "PDF",
    "file_size": "9.1 MB",
    "image": "Artificial-Intelligence-for-.NET.jpg",
    "isbn_10": "1484229487",
    "language": "English",
    "pages": 264,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27988",
    "sub_title": "Speech, Language, and Search: Building Smart Applications with Microsoft Cognitive Services APIs",
    "title": "Artificial Intelligence for .NET",
    "year": 2017,
    "id": 16
  },
  {
    "author": [
      "Bihag Thaker",
      "Ritesh Shah"
    ],
    "category": [
      "SQL"
    ],
    "description": "Book Description:\n\nAs a DBA you must have encountered a slow running application on SQL Server, but there are various factors that could be affecting the performance. If you find yourself in this situation, don’t wait, pick up this book and start working towards improving performance of your SQL Server 2012. SQL Server 2012 Performance Tuning Cookbook is divided into three major parts — Performance Monitoring, Performance Tuning, and Performance Management–that are mandatory to deal with performance in any capacity.\n\nSQL Server 2012 Performance Tuning Cookbook offers a great way to manage performance with effective, concise, and practical recipes. You will learn how to diagnose performance issues, fix them, and take precaution to avoid common mistakes.\n\nEach recipe given in this book is an individual task that will address different performance aspects to take your SQL Server’s Performance to a higher level.\n\nThe first part of this book covers Monitoring with SQL Server Profiler, DTA, System statistical function, SPs with DBCC commands, Resource Monitor & Reliability, and Performance Monitor and Execution Plan.\n\nThe second part of the book offers Execution Plan, Dynamic Management Views, and Dynamic Management Functions, SQL Server Cache and Stored Procedure Recompilations, Indexes, Important ways to write effective TSQL, Statistics, Table and Index Partitioning, Advanced Query tuning with Query Hints and Plan Guide, Dealing with Locking, Blocking and Deadlocking and Configuring SQL Server for optimization to boost performance.\n\nThe third and final part gives you knowledge of performance management with help of Policy Based Management and Management with Resource Governor.\n\nWhat will you learn from this book\n\nMonitoring SQL Server Performance with Profiler, Execution Plan, and system statistical function\nFinding performance bottleneck with the help of Resource Monitor and DTA\nCreating and Managing Indexes efficiently to boost performance\nCreating and Managing Partition efficiently\nManaging database files efficiently\nPlanning Guide and Query Hints\nDealing with locking, blocking, and deadlocking\nConfiguring SQL Server instance option for achieving performance benefit\nManaging Performance with Policy based management and Resource Governor",
    "download_link": "http://file.allitebooks.com/20170814/Microsoft%20SQL%20Server%202012%20Performance%20Tuning%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "8.9 MB",
    "image": "Microsoft-SQL-Server-2012-Performance-Tuning-Cookbook.jpg",
    "isbn_10": "1849685746",
    "language": "English",
    "pages": 478,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27985",
    "sub_title": "80 recipes to help you tune SQL Server 2012 and achieve optimal performance",
    "title": "Microsoft SQL Server 2012 Performance Tuning Cookbook",
    "year": 2012,
    "id": 17
  },
  {
    "author": [
      "Bala Subrahmanyam Varanasi",
      "Rakesh Vidya Chandra"
    ],
    "category": [
      "Python"
    ],
    "description": "Book Description:\n\nPython is one of the most popular programming languages of our era; the Python Requests library is one of the world’s best clients, with the highest number of downloads. It allows hassle-free interactions with web applications using simple procedures.\n\nYou will be shown how to mock HTTP Requests using HTTPretty, and will learn to interact with social media using Requests. This book will help you to grasp the art of web scraping with the BeautifulSoup and Python Requests libraries, and will then paddle you through Requests impressive ability to interact with APIs. It will empower you with the best practices for seamlessly drawing data from web apps. Last but not least, you will get the chance to polish your skills by implementing a RESTful Web API with Python and Flask!\n\nWho This Book Is For\n\nIf you are a Python administrator or developer interested in interacting with web APIs and have a passion for creating your own web applications, this is the book for you. Basic knowledge of Python programming, APIs, and web services will be an advantage.\n\nWhat You Will Learn\n\nDemonstrate the use of Python Requests with the help of examples\nUse the Requests module to deal with the inner sections of the request-response cycles\nImplement the RESTful Web API with Python Requests\nAuthenticate Requests using different authentication methods\nEmulate server actions and interact with a mock server\nInteract with social networking sites such as Facebook, Twitter, and reddit\nScrape the Web with Python Requests and BeautifulSoup\nBuild your own web application with Flask",
    "download_link": "http://file.allitebooks.com/20170813/Python%20Requests%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "1.2 MB",
    "image": "Python-Requests-Essentials.jpg",
    "isbn_10": "1784395412",
    "language": "English",
    "pages": 122,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27982",
    "sub_title": "Learn how to integrate your applications seamlessly with web services using Python Requests",
    "title": "Python Requests Essentials",
    "year": 2015,
    "id": 18
  },
  {
    "author": [
      "Amol Fasale",
      "Nirmal Kumar"
    ],
    "category": [
      "Computer Science"
    ],
    "description": "Book Description:\n\nYARN is the next generation generic resource platform used to manage resources in a typical cluster and is designed to support multitenancy in its core architecture. As optimal resource utilization is central to the design of YARN, learning how to fully utilize the available fine-grained resources (RAM, CPU cycles, and so on) in the cluster becomes vital.\n\nThis book is an easy-to-follow, self-learning guide to help you start working with YARN. Beginning with an overview of YARN and Hadoop, you will dive into the pitfalls of Hadoop 1.x and how YARN takes us to the next level. You will learn the concepts, terminology, architecture, core components, and key interactions, and cover the installation and administration of a YARN cluster as well as learning about YARN application development with new and emerging data processing frameworks.\n\nWho This Book Is For\n\nIf you have a working knowledge of Hadoop 1.x but want to start afresh with YARN, this book is ideal for you. You will be able to install and administer a YARN cluster and also discover the configuration settings to fine-tune your cluster both in terms of performance and scalability. This book will help you develop, deploy, and run multiple applications/frameworks on the same shared YARN cluster.\n\nWhat You Will Learn\n\nUnderstand how existing MapReduce applications can run on top of YARN and how they are backward compatible\nExplore the YARN concepts, terminologies, architecture, key components, and interaction between the components\nSet up a standalone and multi-node clustered YARN environment\nDesign, develop, and run different frameworks such as MapReduce, Apache Storm, Apache Tez, and Giraffe on top of YARN\nGet to grips with the built-in support for multitenancy in YARN\nDiscover the motivation behind YARN’s architecture design, implementations, and why YARN was needed\nLearn how failures at each level are gracefully handled by the new framework to achieve fault tolerance and scalability",
    "download_link": "http://file.allitebooks.com/20170813/YARN%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "4.4 MB",
    "image": "YARN-Essentials.jpg",
    "isbn_10": "1784391735",
    "language": "English",
    "pages": 185,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27979",
    "sub_title": "A comprehensive, hands-on guide to install, administer, and configure settings in YARN",
    "title": "YARN Essentials",
    "year": 2015,
    "id": 19
  },
  {
    "author": [
      "Adam Gibson",
      "Josh Patterson"
    ],
    "category": [
      "Data Mining"
    ],
    "description": "Book Description:\n\nAlthough interest in machine learning has reached a high point, lofty expectations often scuttle projects before they get very far. How can machine learning—especially deep neural networks—make a real difference in your organization? This hands-on guide not only provides the most practical information available on the subject, but also helps you get started building efficient deep learning networks.\n\nAuthors Adam Gibson and Josh Patterson provide theory on deep learning before introducing their open-source Deeplearning4j (DL4J) library for developing production-class workflows. Through real-world examples, you’ll learn methods and strategies for training deep network architectures and running deep learning workflows on Spark and Hadoop with DL4J.\n\nDive into machine learning concepts in general, as well as deep learning in particular\nUnderstand how deep networks evolved from neural network fundamentals\nExplore the major deep network architectures, including Convolutional and Recurrent\nLearn how to map specific deep networks to the right problem\nWalk through the fundamentals of tuning general neural networks and specific deep network architectures\nUse vectorization techniques for different data types with DataVec, DL4J’s workflow tool\nLearn how to use DL4J natively on Spark and Hadoop",
    "download_link": "http://file.allitebooks.com/20170813/Deep%20Learning.pdf",
    "file_format": "PDF",
    "file_size": "19.8 MB",
    "image": "Deep-Learning.jpg",
    "isbn_10": "1491914254",
    "language": "English",
    "pages": 536,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27976",
    "sub_title": "A Practitioner's Approach",
    "title": "Deep Learning",
    "year": 2017,
    "id": 20
  },
  {
    "author": [
      "Mansib Rahman"
    ],
    "category": [
      "Data in the Enterprise"
    ],
    "description": "Book Description:\n\nDevelop applications in Microsoft Kinect 2 using gesture and speech recognition, scanning of objects in 3D, and body tracking. Create motion-sensing applications for entertainment and practical uses, including for commercial products and industrial applications.\n\nBeginning Microsoft Kinect for Windows SDK 2.0 is dense with code and examples to ensure that you understand how to build Kinect applications that can be used in the real world. Techniques and ideas are presented to facilitate incorporation of the Kinect with other technologies.\n\nWhat You Will Learn\n\nSet up Kinect 2 and a workspace for Kinect application development\nAccess audio, color, infrared, and skeletal data streams from Kinect\nUse gesture and speech recognition\nPerform computer vision manipulations on image data streams\nDevelop Windows Store apps and Unity3D applications with Kinect 2\nTake advantage of Kinect Fusion (3D object mapping technology) and Kinect Ripple (Kinect projector infotainment system)\nWho This Book Is For\nDevelopers who want to include the simple but powerful Kinect technology into their projects, including amateurs and hobbyists, and professional developers",
    "download_link": "http://file.allitebooks.com/20170812/Beginning%20Microsoft%20Kinect%20for%20Windows%20SDK%202.0.pdf",
    "file_format": "PDF",
    "file_size": "11.2 MB",
    "image": "Beginning-Microsoft-Kinect-for-Windows-SDK-2.0.jpg",
    "isbn_10": "1484223152",
    "language": "English",
    "pages": 297,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27969",
    "sub_title": "Motion and Depth Sensing for Natural User Interfaces",
    "title": "Beginning Microsoft Kinect for Windows SDK 2.0",
    "year": 201,
    "id": 21
  },
  {
    "author": [
      "Ben Tyers"
    ],
    "category": [
      "Game Programming"
    ],
    "description": "Book Description:\n\nCarry out the pre-planning, design, and programming of role playing games (RPGs) using the popular GameMaker: Studio in this very practical and fun book. Author Ben Tyers teaches you how to create a story or plotline for the RPG, apply aesthetics, and develop core and extended gameplay.\n\nUsing Learn RPGs in GameMaker: Studio, you can design and build your own RPG using the GameMaker: Studio platform. Build your first game application and deploy in an app store, on Facebook, or just on a PC.  Maybe, even, make a few bucks.\n\nWhat You’ll Learn\n\nUse the GameMaker: Studio platform to design and build a role playing game\nCreate a story for game design purposes, using a plot line and defining characters\nDiscover the impact of aesthetics on art style, character separation, scene development, sound design and views\nMaster core gameplay elements such as battles, exploration, scoring, and endings\nWork with extended gameplay elements such as collectibles, quirks, management, and saving\nEmploy the various core and extended gameplay elements as appropriate to your RPG\nWho This Book Is For\n\nGame designers or developers looking to design and build their first role playing game using the GameMaker: Studio platform.",
    "download_link": "http://file.allitebooks.com/20170811/Learn%20RPGs%20in%20GameMaker%20Studio.pdf",
    "file_format": "PDF",
    "file_size": "13.6 MB",
    "image": "Learn-RPGs-in-GameMaker:-Studio.jpg",
    "isbn_10": "1484229452",
    "language": "English",
    "pages": 318,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27946",
    "sub_title": "Build and Design Role Playing Games",
    "title": "Learn RPGs in GameMaker: Studio",
    "year": 2017,
    "id": 22
  },
  {
    "author": [
      "Jorge Acetozi"
    ],
    "category": [
      "Administration"
    ],
    "description": "Book Description:\n\nBuild clustered and scalable Java-based, real-time applications using Spring Framework, Boot, WebSocket, Cassandra, Redis and RabbitMQ. In this book, you’ll tie all this together with a dive-in case study, a real-time scalable chat application under differing scenarios. Pro Java Clustering and Scalabilityalso discusses how to horizontally scale the WebSocket chat application using a full STOMP broker such as RabbitMQ.\nAlthough this is a programming book, it also discusses many interesting infrastructure topics and tips about continuous delivery, Docker, NoSQL (Cassandra and Redis) and other related technologies.\nWhat You Will Learn\nHandle clustering and scalability using various open source Java, microservices, and web services tools and technologies\nUse Spring Framework, Boot, and other Spring technologies\nIntegrate with Redis, RabbitMQ, Cassandra, NoSQL,\nand much more\n\nTest the case study code under various scenarios and stresses\nWho This Book Is For\nExperienced Java developers with at least some prior experience with Java, especially Spring Framework, Boot and other tools, and some web services.",
    "download_link": "http://file.allitebooks.com/20170811/Pro%20Java%20Clustering%20and%20Scalability.pdf",
    "file_format": "PDF",
    "file_size": "3.7 MB",
    "image": "Pro-Java-Clustering-and-Scalability.jpg",
    "isbn_10": "1484229843",
    "language": "English",
    "pages": 149,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27945",
    "sub_title": "Building Real-Time Apps with Spring, Cassandra, Redis, WebSocket and RabbitMQ",
    "title": "Pro Java Clustering and Scalability",
    "year": 2017,
    "id": 23
  },
  {
    "author": [
      "Jim Sterne"
    ],
    "category": [
      "Marketing & SEO"
    ],
    "description": "Book Description:\n\nA straightforward, non-technical guide to the next major marketing tool\n\nArtificial Intelligence for Marketing presents a tightly-focused introduction to machine learning, written specifically for marketing professionals. This book will not teach you to be a data scientist—but it does explain how Artificial Intelligence and Machine Learning will revolutionize your company’s marketing strategy, and teach you how to use it most effectively. Data and analytics have become table stakes in modern marketing, but the field is ever-evolving with data scientists continually developing new algorithms—where does that leave you? How can marketers use the latest data science developments to their advantage? This book walks you through the “need-to-know” aspects of Artificial Intelligence, including natural language processing, speech recognition, and the power of Machine Learning to show you how to make the most of this technology in a practical, tactical way.\n\nSimple illustrations clarify complex concepts, and case studies show how real-world companies are taking the next leap forward. Straightforward, pragmatic, and with no math required, this book will help you:\n\nSpeak intelligently about Artificial Intelligence and its advantages in marketing\nUnderstand how marketers without a Data Science degree can make use of machine learning technology\nCollaborate with data scientists as a subject matter expert to help develop focused-use applications\nHelp your company gain a competitive advantage by leveraging leading-edge technology in marketing\nMarketing and data science are two fast-moving, turbulent spheres that often intersect; that intersection is where marketing professionals pick up the tools and methods to move their company forward. Artificial Intelligence and Machine Learning provide a data-driven basis for more robust and intensely-targeted marketing strategies—and companies that effectively utilize these latest tools will reap the benefit in the marketplace. Artificial Intelligence for Marketing provides a nontechnical crash course to help you stay ahead of the curve.",
    "download_link": "http://file.allitebooks.com/20170811/Artificial%20Intelligence%20for%20Marketing.pdf",
    "file_format": "PDF",
    "file_size": "5.6 MB",
    "image": "Artificial-Intelligence-for-Marketing.jpg",
    "isbn_10": "1119406331",
    "language": "English",
    "pages": 368,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27943",
    "sub_title": "Practical Applications",
    "title": "Artificial Intelligence for Marketing",
    "year": 2017,
    "id": 24
  },
  {
    "author": [
      "James Cabrera"
    ],
    "category": [
      "Programming",
      "Administration"
    ],
    "description": "Book Description:\n\nLearn the basic principles of modular design, and then put them into action to create sites that are easy to use, look great, and can be adapted within the context of your business needs.\n\nWith author James Cabrera―one of the thought leaders in the modular-design movement―you’ll create a single, scalable project for a sample nameplate site and then adapt that same project to work successfully as a portfolio site, an e-commerce site, and finally as a news/publishing content site. Along the way, you’ll learn the scientific approach to devising a sound and scalable design strategy, followed by establishing a basic foundation using various criteria relevant to that type of site. As each chapter progresses, you’ll add new concepts appropriate for the project type.\n\nModular web and app design isn’t just for so-called “creatives.” It’s a teachable science with principles that can be replicated in a creative manner. This approach makes the design decision making process for businesses much easier (and easier to live with). And modular design is a powerful tool for software designers to replicate effective successful designs across a spectrum of needs.\n\nWhat You’ll Learn\nExamine the design process in a modular way\nAdapt your HTML code to create different types of applications\nEstablish your own modular framework for your specific site’s goals\nDesign for scale\nDevelop a strong foundation skeleton for design\nWho This Book Is For\nUser experience designers, user interface designers, information architects, developers with an interest in design, developers who want to create their own design frameworks.",
    "download_link": "http://file.allitebooks.com/20170811/Modular%20Design%20Frameworks.pdf",
    "file_format": "PDF",
    "file_size": "3.7 MB",
    "image": "Modular-Design-Frameworks.jpg",
    "isbn_10": "1484216873",
    "language": "English",
    "pages": 86,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27944",
    "sub_title": "A Projects-based Guide for UI/UX Designers",
    "title": "Modular Design Frameworks",
    "year": 2017,
    "id": 25
  },
  {
    "author": [
      "James Denton"
    ],
    "category": [
      "Cloud Computing"
    ],
    "description": "Book Description:\n\nThe OpenStack Networking API offers users the ability to create and manage both basic and complex network architectures that blend the virtual and physical network infrastructure.\n\nThis book kicks off by describing various components of Openstack Neutron and installing Ubuntu OpenStack based on Canonical’s process. Further on, you will use various methods to interface with Neutron to create and manage network resources. You will also get to grips with the relationship between ports, networks, and subnets through diagrams and explanations, and see how the logical components are implemented via plugins and agents.\n\nMoving forward, you will learn how virtual switches are implemented and how to build Neutron routers. You will also configure networks, subnets, and routers to provide connectivity to instances using simple examples. At the end, you will configure and manage security groups, and will observe how these rules translate to iptables rules on the host machines.\n\nBy the end of the book, you will be able to build basic network architectures using Neutron networks and routers in no time.\n\nWhat you will learn\n\nInstall the latest Liberty (2015.2) release of OpenStack using RDO in VirtualBox\nDiscover the basics of the Neutron API, including networks, subnets, and ports\nInteract with Neutron using the CLI and Horizon dashboard\nCreate networks and subnets that provide connectivity to instances\nImplement software routers that connect networks and provide network address translation\nSecure instances using Neutron’s security group functionality",
    "download_link": "http://file.allitebooks.com/20170810/OpenStack%20Networking%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "14.6 MB",
    "image": "OpenStack-Networking-Essentials.jpg",
    "isbn_10": "1785283278",
    "language": "English",
    "pages": 174,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27937",
    "sub_title": "Build and manage networks in OpenStack using Neutron",
    "title": "OpenStack Networking Essentials",
    "year": 2016,
    "id": 26
  },
  {
    "author": [
      "Rex van der Spuy"
    ],
    "category": [
      "Game Programming"
    ],
    "description": "Book Description:\n\nMaster the most important skills and techniques you need to know for professional HTML5 and JavaScript 2D game development. This book delves into many of the great classic techniques of video game design.\n\nYou’ll discover how to develop games and game levels using Tiled Editor, how to implement tile-based collision, how to design advanced pathfinding and enemy AI systems, the fundamentals of broad-phase collision, and how to make isometric games. All the techniques and supporting code are explained in an easy-to-understand manner and written in a general way so that they can be applied to any game engine or technology that you’re comfortable using.\n\nYou’ll find detailed working examples, with dozens of illustrations and many concepts you can freely apply to your own projects. All the math and programming techniques are elaborately explained and examples are open-ended to encourage you to think of original ways to use these techniques in your own games. You can use what you learn in this book as the basis for making games for desktops, mobile phones, tablets, or the Web.\n\nThe Advanced Game Developer’s Toolkit is a great next step if you already have some JavaScript game-making- experience, or a great continuation if you’ve already read Advanced Game Design with HTML5 and JavaScript by the same author.\n\nWhat You’ll Learn\n\nWork with advanced tile-based design techniques for puzzle, platform and maze games\nUse Tiled Editor to build game worlds\nBuild path-finding and AI systems using Line of Sight and A* (A-Star)\nMake isometric games\nManage complexity to build games of any size that scale seamlessly\nWho This Book Is For\n\nVideo game developers with some experience who want to learn the essential techniques they need to know to take their skills to the next level and for readers who want to understand and fine-tune every line of code they write, without resorting to quick fixes.",
    "download_link": "http://file.allitebooks.com/20170810/The%20Advanced%20Game%20Developer's%20Toolkit.pdf",
    "file_format": "PDF",
    "file_size": "5.4 MB",
    "image": "The-Advanced-Game-Developer’s-Toolkit.jpg",
    "isbn_10": "1484210980",
    "language": "English",
    "pages": 185,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27931",
    "sub_title": "Create Amazing Web-based Games with JavaScript and HTML5",
    "title": "The Advanced Game Developer’s Toolkit",
    "year": 2017,
    "id": 27
  },
  {
    "author": [
      "Chandan Dutta Chowdhury",
      "Sriram Subramanian"
    ],
    "category": [
      "Cloud Computing"
    ],
    "description": "Book Description:\n\nNetworking in OpenStack has evolved from Nova Network to Neutron. This has resulted in a rich suite of networking services available to OpenStack users and administrators. Advanced services such as routers, firewall, and load balancers use building blocks such as network and subnets. Recent improvements support powerful customization using plugins. The evolution of Neutron continues as it integrates with tools like Ceilometer and Heat.\n\nThis book will explore the built-in capabilities of Neutron to effectively deploy cloud solutions. You will begin with the most fundamental constructs of OpenStack Networking for switching and routing. You will then learn how to provide your tenants with services like firewalls and load-balancers. The step-by-step recipes will help you configure and troubleshoot networking problems in your cloud. This book will also introduce you to advanced topics like Ceilometer, Heat, and other upcoming tools in OpenStack\n\nWho This Book Is For\n\nThis book is aimed at network and system administrators who want to deploy and manage OpenStack-based cloud and IT infrastructure. If you have basic knowledge of OpenStack and virtualization, this book will help you leverage the rich functionality of OpenStack Networking in your cloud deployments.\n\nWhat You Will Learn\n\nOperate OpenStack Networking for public and private clouds\nConfigure advanced routing services for your workloads\nSecure data traffic using firewall-as-a-service capabilities of OpenStack\nDiscover how to leverage VXLAN to implement SDN in your OpenStack cloud\nMonitor the virtual networks using Ceilometer\nDevelop plugins to enhance and customize OpenStack Networking\nProvide HA and VPN connectivity for your virtual machines\nTroubleshoot and solve common problems with OpenStack Networking",
    "download_link": "http://file.allitebooks.com/20170810/OpenStack%20Networking%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "15.1 MB",
    "image": "OpenStack-Networking-Cookbook.jpg",
    "isbn_10": "1785286102",
    "language": "English",
    "pages": 282,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27934",
    "sub_title": "Harness the power of OpenStack Networking for public and private clouds using 90 hands-on recipes",
    "title": "OpenStack Networking Cookbook",
    "year": 2015,
    "id": 28
  },
  {
    "author": [
      "Pedro Teixeira"
    ],
    "category": [
      "JavaScript"
    ],
    "description": "Book Description:\n\nNode.js is a platform that lets you use JavaScript to easily program scalable network applications and web services. Learn about the main concepts behind Node.js to get you started with this exciting technology.\n\nInstant NodeJS Starter will begin with installation and your first Hello World HTTP server. This book will show you how you can use Node.js core modules and also how you can use patterns to create your own modules. It will also teach you about NPM and how you can use it to install any of the many available third-party libraries. The book then goes on to explain the three main patterns you need to understand to be able to fully use Node.js: the callback pattern, EventEmitter, and streams. All these patterns are presented with practical code examples that you can use immediately, getting you started quickly on this exciting technology.\n\nInstant NodeJS Starter starts with the installation of Node.js and then shows you how to create your first Node.js HTTP server. By showing you the main Node.js concepts together with some working code samples, by the end of the book you will have created a set of working Node.js scripts to create servers and clients.You will learn how you can include and use Node.js core modules, and how you can use patterns to create your own modules. You will also learn how you can use NPM to pick, install, and use any of the many available third-party modules in your applications. You will learn how you can use the callback pattern and EventEmitter to control the asynchronous flow and the power of Node.js streams to make your application more scalable and responsive.\n\nInstant Node.js Starter will show you the main concepts behind Node.js so that you feel comfortable to start building your scalable, event-driven network applications using JavaScript.\n\nWhat you will learn from this book\n\nCreate your first Node.js HTTP server\nInclude Node.js core modules\nManage asynchronous flow using callback patterns\nExplore EventEmitter patterns",
    "download_link": "http://file.allitebooks.com/20170809/Instant%20Node.js%20Starter.pdf",
    "file_format": "PDF",
    "file_size": "0.9 MB",
    "image": "Instant-Node.js-Starter.jpg",
    "isbn_10": "1782165568",
    "language": "English",
    "pages": 48,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27928",
    "sub_title": "Program your scalable network applications and web services with Node.js with this book and ebook",
    "title": "Instant Node.js Starter",
    "year": 2013,
    "id": 29
  },
  {
    "author": [
      "Phillip Whitt"
    ],
    "category": [
      "Graphics & Design"
    ],
    "description": "Book Description:\n\nLearn digital image editing without the expense of using subscription-based editors. This book will pave the way for you to leverage Pixlr Editor, a free, web-based image editing solution that works on virtually any computer platform.\n\nYou’ll learn image editing first hand by using the practice images with the corresponding tutorials―everything from creating simple graphics to enhancing and retouching photos. Explore all of the features you’d expect in a high end photo editing application; layers, history (multiple undos), and an array of powerful tools for handling almost any editing task.\n\nPowerful image editing used to require purchasing and installing expensive, complicated image editing software on your computer. Beginning Pixlr Editor takes an easy-to-access and convenient look at the alternative from the Pixlr family of tools and utilities and offers you advanced editing techniques so you can enhance, retouch, and edit your digital images like a pro.\n\nWhat You’ll Learn:\nEasily access Pixlr Editor from any computer with a high speed Internet connection\nCreate an new image, or open an image from your computer, a URL, or the Pixlr library\nSave your images on to your computer or the Pixlr library\nNavigate the the Pixlr interface\nUse the Tools, Layers, image Adjustments, History, and much more\nWho This Book Is For:\nBeginner and those with some image editing experience (anyone accustomed to Adobe Photoshop will instantly feel at home with Pixlr Editor).",
    "download_link": "http://file.allitebooks.com/20170806/Beginning%20Pixlr%20Editor.pdf",
    "file_format": "PDF",
    "file_size": "14.2 MB",
    "image": "Beginning-Pixlr-Editor.jpg",
    "isbn_10": "1484226976",
    "language": "English",
    "pages": 237,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27922",
    "sub_title": "Learn to Edit Digital Photos Using this Free Web-Based App",
    "title": "Beginning Pixlr Editor",
    "year": 2017,
    "id": 30
  },
  {
    "author": [
      "Chetan Giridhar"
    ],
    "category": [
      "Python"
    ],
    "description": "Book Description:\n\nThis book gives you a great selection of recipes to automate your business processes with Python, and provides a platform for you to understand how Python is useful to make time consuming and repetitive business tasks more efficient. Python is a mature high level language, has object-oriented programming features, powers various apps, has a huge set of modules, and great community support. Python is extremely easy to use, can help you get complex tasks done efficiently and is an apt choice for our needs.\nWith a classic problem-solution based approach and real-world examples, you will delve into things that automate your business processes. You will begin by learning about the Python modules to work with Web, Worksheets, Presentations and PDFs. You’ll leverage Python recipes to automate processes in HR, Finance and making them efficient and reliable. For instance, company payroll — an integral process in HR will be automated with Python recipes.\n\nA few chapters of this book will also help you gain knowledge on working with bots and computer vision. You will learn how to build bots for automating business use cases by integrating artificial intelligence. You’ll also understand how Python is helpful in face detection and building a scanner of your own. You will see how to effectively and easily use Python code to manage SMS and voice notifications, opening a world of possibilities using cloud telephony to solve your business needs. Moving forward, you will learn to work with APIs, Webhooks and Emails to automate Marketing and Customer Support processes.\n\nFinally, using the various Python libraries, this book will arm you with knowledge to customize data solutions and generate reports to meet your business needs. This book will help you up-skill and make your business processes efficient with the various Python recipes covered in this book.\n\nWhat you will learn\nTo automate business processes and make them efficient with Python recipes\nExplore the power of REST APIs and implement Web hooks. Work with Twitter  REST APIs and post automated tweets with Python.\nUnderstand the world of Cloud telephony and implement business use cases with SMS and Voice Notification with Python bindings.\nManipulate images and learn how to use Python’s Computer Vision for face detection and automate business tasks. Have you thought of making your organisation go paperless?\nLearn about conversational bots and implement one of your own using Python. You will also learn to integrate AI to your bots.\nUnderstand Data analysis and generate interesting insights on your data using Python’s modules for data filtering and visualisation.",
    "download_link": "http://file.allitebooks.com/20170804/Automate%20it.pdf",
    "file_format": "PDF",
    "file_size": "29.5 MB",
    "image": "Automate-it!.jpg",
    "isbn_10": "1786460513",
    "language": "English",
    "pages": 392,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27913",
    "sub_title": "Recipes to upskill your business",
    "title": "Automate it!",
    "year": 2017,
    "id": 31
  },
  {
    "author": [
      "Rex van der Spuy"
    ],
    "category": [
      "Game Programming"
    ],
    "description": "Book Description:\n\nMaster the most important skills and techniques you need to know for professional HTML5 and JavaScript 2D game development. This book delves into many of the great classic techniques of video game design.\n\nYou’ll discover how to develop games and game levels using Tiled Editor, how to implement tile-based collision, how to design advanced pathfinding and enemy AI systems, the fundamentals of broad-phase collision, and how to make isometric games. All the techniques and supporting code are explained in an easy-to-understand manner and written in a general way so that they can be applied to any game engine or technology that you’re comfortable using.\n\nYou’ll find detailed working examples, with dozens of illustrations and many concepts you can freely apply to your own projects. All the math and programming techniques are elaborately explained and examples are open-ended to encourage you to think of original ways to use these techniques in your own games. You can use what you learn in this book as the basis for making games for desktops, mobile phones, tablets, or the Web.\n\nThe Advanced Game Developer’s Toolkit is a great next step if you already have some JavaScript game-making- experience, or a great continuation if you’ve already read Advanced Game Design with HTML5 and JavaScript by the same author.\n\nWhat You’ll Learn\n\nWork with advanced tile-based design techniques for puzzle, platform and maze games\nUse Tiled Editor to build game worlds\nBuild path-finding and AI systems using Line of Sight and A* (A-Star)\nMake isometric games\nManage complexity to build games of any size that scale seamlessly\nWho This Book Is For\n\nVideo game developers with some experience who want to learn the essential techniques they need to know to take their skills to the next level and for readers who want to understand and fine-tune every line of code they write, without resorting to quick fixes.",
    "download_link": "http://file.allitebooks.com/20170810/The%20Advanced%20Game%20Developer's%20Toolkit.pdf",
    "file_format": "PDF",
    "file_size": "5.4 MB",
    "image": "The-Advanced-Game-Developer’s-Toolkit.jpg",
    "isbn_10": "1484210980",
    "language": "English",
    "pages": 185,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27931",
    "sub_title": "Create Amazing Web-based Games with JavaScript and HTML5",
    "title": "The Advanced Game Developer’s Toolkit",
    "year": 2017,
    "id": 32
  },
  {
    "author": [
      "Chandan Dutta Chowdhury",
      "Sriram Subramanian"
    ],
    "category": [
      "Cloud Computing"
    ],
    "description": "Book Description:\n\nNetworking in OpenStack has evolved from Nova Network to Neutron. This has resulted in a rich suite of networking services available to OpenStack users and administrators. Advanced services such as routers, firewall, and load balancers use building blocks such as network and subnets. Recent improvements support powerful customization using plugins. The evolution of Neutron continues as it integrates with tools like Ceilometer and Heat.\n\nThis book will explore the built-in capabilities of Neutron to effectively deploy cloud solutions. You will begin with the most fundamental constructs of OpenStack Networking for switching and routing. You will then learn how to provide your tenants with services like firewalls and load-balancers. The step-by-step recipes will help you configure and troubleshoot networking problems in your cloud. This book will also introduce you to advanced topics like Ceilometer, Heat, and other upcoming tools in OpenStack\n\nWho This Book Is For\n\nThis book is aimed at network and system administrators who want to deploy and manage OpenStack-based cloud and IT infrastructure. If you have basic knowledge of OpenStack and virtualization, this book will help you leverage the rich functionality of OpenStack Networking in your cloud deployments.\n\nWhat You Will Learn\n\nOperate OpenStack Networking for public and private clouds\nConfigure advanced routing services for your workloads\nSecure data traffic using firewall-as-a-service capabilities of OpenStack\nDiscover how to leverage VXLAN to implement SDN in your OpenStack cloud\nMonitor the virtual networks using Ceilometer\nDevelop plugins to enhance and customize OpenStack Networking\nProvide HA and VPN connectivity for your virtual machines\nTroubleshoot and solve common problems with OpenStack Networking",
    "download_link": "http://file.allitebooks.com/20170810/OpenStack%20Networking%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "15.1 MB",
    "image": "OpenStack-Networking-Cookbook.jpg",
    "isbn_10": "1785286102",
    "language": "English",
    "pages": 282,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27934",
    "sub_title": "Harness the power of OpenStack Networking for public and private clouds using 90 hands-on recipes",
    "title": "OpenStack Networking Cookbook",
    "year": 2015,
    "id": 33
  },
  {
    "author": [
      "Pedro Teixeira"
    ],
    "category": [
      "JavaScript"
    ],
    "description": "Book Description:\n\nNode.js is a platform that lets you use JavaScript to easily program scalable network applications and web services. Learn about the main concepts behind Node.js to get you started with this exciting technology.\n\nInstant NodeJS Starter will begin with installation and your first Hello World HTTP server. This book will show you how you can use Node.js core modules and also how you can use patterns to create your own modules. It will also teach you about NPM and how you can use it to install any of the many available third-party libraries. The book then goes on to explain the three main patterns you need to understand to be able to fully use Node.js: the callback pattern, EventEmitter, and streams. All these patterns are presented with practical code examples that you can use immediately, getting you started quickly on this exciting technology.\n\nInstant NodeJS Starter starts with the installation of Node.js and then shows you how to create your first Node.js HTTP server. By showing you the main Node.js concepts together with some working code samples, by the end of the book you will have created a set of working Node.js scripts to create servers and clients.You will learn how you can include and use Node.js core modules, and how you can use patterns to create your own modules. You will also learn how you can use NPM to pick, install, and use any of the many available third-party modules in your applications. You will learn how you can use the callback pattern and EventEmitter to control the asynchronous flow and the power of Node.js streams to make your application more scalable and responsive.\n\nInstant Node.js Starter will show you the main concepts behind Node.js so that you feel comfortable to start building your scalable, event-driven network applications using JavaScript.\n\nWhat you will learn from this book\n\nCreate your first Node.js HTTP server\nInclude Node.js core modules\nManage asynchronous flow using callback patterns\nExplore EventEmitter patterns",
    "download_link": "http://file.allitebooks.com/20170809/Instant%20Node.js%20Starter.pdf",
    "file_format": "PDF",
    "file_size": "0.9 MB",
    "image": "Instant-Node.js-Starter.jpg",
    "isbn_10": "1782165568",
    "language": "English",
    "pages": 48,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27928",
    "sub_title": "Program your scalable network applications and web services with Node.js with this book and ebook",
    "title": "Instant Node.js Starter",
    "year": 2013,
    "id": 34
  },
  {
    "author": [
      "Phillip Whitt"
    ],
    "category": [
      "Graphics & Design"
    ],
    "description": "Book Description:\n\nLearn digital image editing without the expense of using subscription-based editors. This book will pave the way for you to leverage Pixlr Editor, a free, web-based image editing solution that works on virtually any computer platform.\n\nYou’ll learn image editing first hand by using the practice images with the corresponding tutorials―everything from creating simple graphics to enhancing and retouching photos. Explore all of the features you’d expect in a high end photo editing application; layers, history (multiple undos), and an array of powerful tools for handling almost any editing task.\n\nPowerful image editing used to require purchasing and installing expensive, complicated image editing software on your computer. Beginning Pixlr Editor takes an easy-to-access and convenient look at the alternative from the Pixlr family of tools and utilities and offers you advanced editing techniques so you can enhance, retouch, and edit your digital images like a pro.\n\nWhat You’ll Learn:\nEasily access Pixlr Editor from any computer with a high speed Internet connection\nCreate an new image, or open an image from your computer, a URL, or the Pixlr library\nSave your images on to your computer or the Pixlr library\nNavigate the the Pixlr interface\nUse the Tools, Layers, image Adjustments, History, and much more\nWho This Book Is For:\nBeginner and those with some image editing experience (anyone accustomed to Adobe Photoshop will instantly feel at home with Pixlr Editor).",
    "download_link": "http://file.allitebooks.com/20170806/Beginning%20Pixlr%20Editor.pdf",
    "file_format": "PDF",
    "file_size": "14.2 MB",
    "image": "Beginning-Pixlr-Editor.jpg",
    "isbn_10": "1484226976",
    "language": "English",
    "pages": 237,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27922",
    "sub_title": "Learn to Edit Digital Photos Using this Free Web-Based App",
    "title": "Beginning Pixlr Editor",
    "year": 2017,
    "id": 35
  },
  {
    "author": [
      "Robert Ciesla"
    ],
    "category": [
      "Game Programming"
    ],
    "description": "Book Description:\n\nGet a head start in your game development career with this all-genre guide for absolute beginners. Whether you’re into action games, role-playing games, or interactive fiction, we’ve got you covered. Mostly Codeless Game Development empowers new developers with little or no previous programming experience and explores all major areas of game development in a succinct, entertaining fashion.\nHave you dreamed of making your own video game? Do you find the prospect daunting? Fear not. A new generation of game engines has emerged. Lengthy and complicated feats of programming are largely a thing of the past in video game development. To create commercially viable games you simply need the right tools, many of which are discussed in this book. A gigantic software team isn’t a must-have prerequisite for success. The one-person operation is back.\nWhat You Will Learn\nMaster the concepts and jargon used in game creation for the beginner\nFind the best game development suite for your project\nMake the most out of related graphics and audio production software\nDiscover video game marketing essentials\nWho This Book Is For\nPeople with no programming experience who desire a career in the video game industry as producers or independent, single-person developers.",
    "download_link": "http://file.allitebooks.com/20170721/Mostly%20Codeless%20Game%20Development.pdf",
    "file_format": "PDF",
    "file_size": "4.5 MB",
    "image": "Mostly-Codeless-Game-Development.jpg",
    "isbn_10": "148422969X",
    "language": "English",
    "pages": 219,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27830",
    "sub_title": "New School Game Engines",
    "title": "Mostly Codeless Game Development",
    "year": 2017,
    "id": 36
  },
  {
    "author": [
      "Taweh Beysolow II"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nUnderstand deep learning, the nuances of its different models, and where these models can be applied.\n\nThe abundance of data and demand for superior products/services have driven the development of advanced computer science techniques, among them image and speech recognition. Introduction to Deep Learning Using Rprovides a theoretical and practical understanding of the models that perform these tasks by building upon the fundamentals of data science through machine learning and deep learning. This step-by-step guide will help you understand the disciplines so that you can apply the methodology in a variety of contexts. All examples are taught in the R statistical language, allowing students and professionals to implement these techniques using open source tools.\n\nWhat You’ll Learn\n\nUnderstand the intuition and mathematics that power deep learning models\nUtilize various algorithms using the R programming language and its packages\nUse best practices for experimental design and variable selection\nPractice the methodology to approach and effectively solve problems as a data scientist\nEvaluate the effectiveness of algorithmic solutions and enhance their predictive power\nWho This Book Is For\nStudents, researchers, and data scientists who are familiar with programming using R. This book also is also of use for those who wish to learn how to appropriately deploy these algorithms in applications where they would be most useful.",
    "download_link": "http://file.allitebooks.com/20170721/Introduction%20to%20Deep%20Learning%20Using%20R.pdf",
    "file_format": "PDF",
    "file_size": "7.2 MB",
    "image": "Introduction-to-Deep-Learning-Using-R.jpg",
    "isbn_10": "1484227336",
    "language": "English",
    "pages": 277,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27835",
    "sub_title": "A Step-by-Step Guide to Learning and Implementing Deep Learning Models Using R",
    "title": "Introduction to Deep Learning Using R",
    "year": 2017,
    "id": 37
  },
  {
    "author": [
      "Saptaparna Mukherjee (Das)",
      "Suman Mukherjee"
    ],
    "category": [
      "Data Processing"
    ],
    "description": "Book Description:\n\nLeverage the flexibility and power of SAP MII to integrate your business operations with your manufacturing processes. You’ll explore important new features of the product and see how to apply best practices to connect all the stakeholders in your business.\nThis book starts with an overview of SAP’s manufacturing integration and intelligence application and explains why it is so important. You’ll then see how it is applied in various manufacturing sectors.\nThe biggest challenge in manufacturing industries is to reduce the manual work and human intervention so that the process becomes automatic. SAP MII explains how to bridge the gap between management and production and bring sound vital information to the shop floor in real time.\nWith this book you’ll see how to ensure existing manufacturing and information systems share a common interface for all users in your enterprise.\nWhat You’ll Learn\nUnderstand the functional aspects of SAP MII\nImplement SAP MII in different Manufacturing sectors\nExplore new technical features of SAP MII 12.x\nIntegrate scenarios with SAP MII\nDiscover practice guidelines\nWho This Book is for\nAll levels of SAP manufacturing professionals.",
    "download_link": "http://file.allitebooks.com/20170721/SAP%20MII.pdf",
    "file_format": "PDF",
    "file_size": "17.8 MB",
    "image": "SAP-MII.jpg",
    "isbn_10": "1484228138",
    "language": "English",
    "pages": 337,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27827",
    "sub_title": "Functional and Technical Concepts in Manufacturing Industries",
    "title": "SAP MII",
    "year": 2017,
    "id": 38
  },
  {
    "author": [
      "Javier Fernandez Gonzalez"
    ],
    "category": [
      "Java"
    ],
    "description": "Book Description:\n\nConcurrency programming allows several large tasks to be divided into smaller sub-tasks, which are further processed as individual tasks that run in parallel. All the sub-tasks are combined together once the required results are achieved; they are then merged to get the final output. The whole process is very complex. This process goes from the design of concurrent algorithms to the testing phase where concurrent applications need extra attention. Java includes a comprehensive API with a lot of ready-to-use components to implement powerful concurrency applications in an easy way, but with a high flexibility to adapt these components to your needs.\n\nThe book starts with a full description of design principles of concurrent applications and how to parallelize a sequential algorithm. We’ll show you how to use all the components of the Java Concurrency API from basics to the most advanced techniques to implement them in powerful concurrency applications in Java.\n\nYou will be using real-world examples of complex algorithms related to machine learning, data mining, natural language processing, image processing in client / server environments. Next, you will learn how to use the most important components of the Java 8 Concurrency API: the Executor framework to execute multiple tasks in your applications, the phaser class to implement concurrent tasks divided into phases, and the Fork/Join framework to implement concurrent tasks that can be split into smaller problems (using the divide and conquer technique). Toward the end, we will cover the new inclusions in Java 8 API, the Map and Reduce model, and the Map and Collect model. The book will also teach you about the data structures and synchronization utilities to avoid data-race conditions and other critical problems. Finally, the book ends with a detailed description of the tools and techniques that you can use to test a Java concurrent application.\n\nWho This Book Is For\n\nIf you are a competent Java developer with a good understanding of concurrency but have no knowledge of how to effectively implement concurrent programs or use streams to make processes more efficient, then this book is for you.\n\nWhat You Will Learn\n\nDesign concurrent applications by converting a sequential algorithm into a concurrent one\nDiscover how to avoid all the possible problems you can get in concurrent algorithms\nUse the Executor framework to manage concurrent tasks without creating threads\nExtend and modify Executors to adapt their behavior to your needs\nSolve problems using the divide and conquer technique and the Fork/Join framework\nProcess massive data sets with parallel streams and Map/Reduce implementation\nControl data-race conditions using concurrent data structures and synchronization mechanisms\nTest and monitor concurrent applications",
    "download_link": "http://file.allitebooks.com/20170720/Mastering%20Concurrency%20Programming%20with%20Java%208.pdf",
    "file_format": "PDF",
    "file_size": "30.6 MB",
    "image": "Mastering-Concurrency-Programming-with-Java-8.jpg",
    "isbn_10": "1785886126",
    "language": "English",
    "pages": 430,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27824",
    "sub_title": "Master the principles and techniques of multithreaded programming with the Java 8 Concurrency API",
    "title": "Mastering Concurrency Programming with Java 8",
    "year": 2016,
    "id": 39
  },
  {
    "author": [
      "Deepak Grover",
      "Hanu Prateek Kunduru"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nLearn ES6 best practices for code optimization and organization and walk through practical, common examples of how to implement complete components of your applications. While this book covers the basic concepts of modern JavaScript, it primarily focuses on the new syntax, data-types, functionalities, and everything else that’s new in ES6, the latest standard of JavaScript.\nYou’ll examine how to use ES6 in functional programming and explore the new more modular and object-oriented approach to JavaScript. This book will help you sharpen and upgrade your JavaScript language skills so you to easily explore modern ES6 based frameworks or libraries such as ReactJS, ReactNative, Angular4 and Vue.js.\nES6 for Humans  is a complete guide to writing ES6 and will enable you to start taking advantage of this exciting new version of JavaScript.\nWhat You’ll Learn\nUse all the new features added to JavaScript\nCompare ES5 and ES6 in varied situations\nRefresh your core JavaScript fundamentals\nUnderstand the modular and object-oriented approach to JavaScript\nWho this Book Is For\nAny Javascript developer who wants to fully understand and dive into the new features of ES6/ES2015.\nDevelopers with some background in programming, preferably in JavaScript.\nA basic understanding of coding concepts and exposure to object-oriented programming is expected.",
    "download_link": "http://file.allitebooks.com/20170719/ES6%20for%20Humans.pdf",
    "file_format": "PDF",
    "file_size": "1.6 MB",
    "image": "ES6-for-Humans.jpg",
    "isbn_10": "1484226224",
    "language": "English",
    "pages": 137,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27820",
    "sub_title": "The Latest Standard of JavaScript: ES2015 and Beyond",
    "title": "ES6 for Humans",
    "year": 2017,
    "id": 40
  },
  {
    "author": [
      "Marshall Copeland"
    ],
    "category": [
      ".NET"
    ],
    "description": "Book Description:\n\nPrevent destructive attacks to your Azure public cloud infrastructure, remove vulnerabilities, and instantly report cloud security readiness. This book provides comprehensive guidance from a security insider’s perspective.\nCyber Security on Azure explains how this ‘security as a service’ (SECaaS) business solution can help you better manage security risk and enable data security control using encryption options such as Advanced Encryption Standard (AES) cryptography. Discover best practices to support network security groups, web application firewalls, and database auditing for threat protection. Configure custom security notifications of potential cyberattack vectors to prevent unauthorized access by hackers, hacktivists, and industrial spies.\nWhat You’ll Learn\nThis book provides step-by-step guidance on how to:\nSupport enterprise security policies\nImprove cloud security\nConfigure intrusion detection\nIdentify potential vulnerabilities\nPrevent enterprise security failures\nWho This Book Is For\n\nIT, cloud, and security administrators; CEOs, CIOs, and other business professionals",
    "download_link": "http://file.allitebooks.com/20170719/Cyber%20Security%20on%20Azure.pdf",
    "file_format": "PDF",
    "file_size": "12.3 MB",
    "image": "Cyber-Security-on-Azure.jpg",
    "isbn_10": "1484227395",
    "language": "English",
    "pages": 208,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27814",
    "sub_title": "An IT Professional’s Guide to Microsoft Azure Security Center",
    "title": "Cyber Security on Azure",
    "year": 2017,
    "id": 41
  },
  {
    "author": [
      "Ram Kulkarni"
    ],
    "category": [
      "Java"
    ],
    "description": "Book Description:\n\nJava EE is a technology for developing enterprise class, scalable applications. With recent changes to Java EE specifications, JEE application development has become a lot simpler. However, recent changes have also added many new specifications, some of which compete with existing JEE specification. Along with JEE specifications and APIs, it is also very important to understand the entire application development process and tools that can help simplify and accelerate JEE application development.\n\nThis guide provides a complete overview of developing JEE applications using Eclipse. The many features of the Eclipse IDE are explained. These enable the rapid development, debugging, testing, and deployment of JEE applications. You’ll explore not just different JEE technologies and how to use them (JSP, JSF, JPA, JDBC, EJB, web services etc.), but also suitable technologies for different scenarios.\n\nThe book starts with how to set up the development environment for JEE applications and then goes on to describe many JEE specifications in detail, with an emphasis on examples. You’ll learn how to deploy an example application on Tomcat and Glassfish Application Server.\n\nYou’ll create a simple application that reads from a queue, processes the request, and publishes results to a topic and Eclipse MAT (Memory Analysis Tool) to debug memory issues.\n\nWho This Book Is For\n\nIf you are a Java developer who has little or no experience in JEE application development or you have experience in JEE technology but are looking for tips to simplify and accelerate your development process, then this book is for you.\n\nWhat You Will Learn\n\nSet up Eclipse, Tomcat, and Glassfish server for JEE application development\nUse JSP, Servlet, JSF, and EJBs to create a user interface and write business logic\nCreate JEE database applications using JDBC and JPA\nHandle asynchronous messages using MDBs for better scalability\nDeploy and debug JEE applications and create SOAP and REST web services\nWrite unit tests and calculate code coverage\nTroubleshoot application performance and memory issues",
    "download_link": "http://file.allitebooks.com/20170717/Java%20EE%20Development%20with%20Eclipse,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "17.4 MB",
    "image": "Java-EE-Development-with-Eclipse,-2nd-Edition.jpg",
    "isbn_10": "1785285343",
    "language": "English",
    "pages": 390,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27805",
    "sub_title": "Develop, debug, test, and troubleshoot Java EE 7 applications rapidly with Eclipse",
    "title": "Java EE Development with Eclipse, 2nd Edition",
    "year": 2015,
    "id": 42
  },
  {
    "author": [
      "Josh Juneau"
    ],
    "category": [
      "Java"
    ],
    "description": "Book Description:\n\nQuickly find solutions to dozens of common programming problems encountered while building Java applications. Content is presented in the popular problem-solution format. Look up the programming problem that you want to resolve. Read the solution. Apply the solution directly in your own code. Problem solved!\n\nThis revised edition covers important new features such as Java 9’s JShell and the new modularity features enabling you to separate code into independent modules that perform discrete tasks. Also covered are the new garbage collection algorithm and completely revamped process API. Enhanced JSON coverage is provided as well as a new chapter on JavaServer Faces development for web applications.\n\nWhat You’ll Learn\nDevelop Java SE applications using the latest in Java SE technology\nExploit advanced features like modularity and lambdas\nUse JShell to quickly develop solutions\nBuild dynamic web applications with JavaScript and Project Nashorn\nCreate great-looking web interfaces with JavaServer Faces\nGenerate graphics and work with media such as sound and video\nAdd internationalization support to your Java applications\nWho This Book Is For\nBoth beginning Java programmers and advanced Java developers",
    "download_link": "http://file.allitebooks.com/20170718/Java%209%20Recipes,%203rd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "6.5 MB",
    "image": "Java-9-Recipes,-3rd-Edition.jpg",
    "isbn_10": "1484219759",
    "language": "English",
    "pages": 626,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27808",
    "sub_title": "A Problem-Solution Approach",
    "title": "Java 9 Recipes, 3rd Edition",
    "year": 2017,
    "id": 43
  },
  {
    "author": [
      "Christer Kaitila"
    ],
    "category": [
      "Game Programming"
    ],
    "description": "Book Description:\n\nGame jams are fun. They are a creative, exciting, social experience. The goal of a game jam is to design a video game, either alone or in teams, as fast as is humanly possible; usually in a single weekend.\n\nThe Game Jam Survival Guide, written to help you have more fun and achieve greater results at your next game jam by building a successful game without burning out, leads readers through each 12-hour phase of a 48-hour weekend game jam.\n\nWeekend warriors: dominate your next game jam! If you follow the system shared in this book, you will be able to build an amazing game that you’re proud of and will entertain players, all in just one crazy 48-hour game jam weekend … and survive to tell the tale!.\n\nEmbrace the best practices and techniques of past game jam winners and avoid common pitfalls along the way to the finish line. You too can survive a 48-hour game development marathon with your mind intact and an amazing game to show off to friends and family!\n\nWith The Game Jam Survival Guide you will learn the secret techniques that master game jammers use to create winning entries. It starts by showing you great ways to brainstorm and design a game based on a theme. It then moves on to highlight the best tools and techniques to finish a game in a weekend of coding. Anecdotes and advice from past winners and losers combined with humorous words of encouragement are sure to help you on your way. The author presents a list of game jams around the world, online communities worth checking out, fantastic game engines, and art resources. Finally, learn how to monetize your game by gaining sponsorship from big gaming websites. It’s the fun way to make your own video game in one weekend!\n\nWhat you will learn from this book\n\nPreparing for the jam: conquer the theme, pick design aids, prototype quickly, choose the right tools for the job, and cut the right corners.\nBombastic brainstorming: power up your idea generator and run with a theme, gain more votes and please the masses.\nBuilding a game jam entry: pick your weapons, follow your plan, cut the bells-n-whistles, scramble over “the wall”, submit a game on time, and with a little luck, attain fame and fortune.\nWhy Mike “PoV” Kasprzak (Ludum Dare administrator) thinks game jams are a good introduction to the realities of the game industry.\nThe reasons why Dr. Mike Reddy (organizer of the Global Game Jam) thinks designing on paper is essential.\nThe best ways to find creative inspiration and develop an idea to fit a theme according to Eric McQuiggan (founding member of The Dirty Rectangles) and Chevy Ray Johnston (author of the FlashPunk engine).\nWhat Foaad Khosmood (director of the Global Game Jam) suggests you do to ensure you finish before the deadline.\nThe worst way to prepare according to Pekka “pekuja” Kujansuu and the best way according to Phil Hassey (Ludum Dare administrators)\nWhat one piece of advice Jason P. Kaplan (founder of the Game Prototype Challenge) would give to newcomers.",
    "download_link": "http://file.allitebooks.com/20170716/The%20Game%20Jam%20Survival%20Guide.pdf",
    "file_format": "PDF",
    "file_size": "2.2 MB",
    "image": "The-Game-Jam-Survival-Guide.jpg",
    "isbn_10": "1849692505",
    "language": "English",
    "pages": 114,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27796",
    "sub_title": "Build a game in one crazy weekend and survive to tell the tale!",
    "title": "The Game Jam Survival Guide",
    "year": 2012,
    "id": 44
  },
  {
    "author": [
      "Greg Lukosek"
    ],
    "category": [
      "C#"
    ],
    "description": "Book Description:\n\nUnity is a cross-platform game engine that is used to develop 2D and 3D video games. Unity 5 is the latest version, released in March 2015, and adds a real-time global illumination to the games, and its powerful new features help to improve a game’s efficiency.\n\nThis book will get you started with programming behaviors in C# so you can create 2D games in Unity. You will begin by installing Unity and learning about its features, followed by creating a C# script. We will then deal with topics such as unity scripting for you to understand how codes work so you can create and use C# variables and methods. Moving forward, you will find out how to create, store, and retrieve data from collection of objects.\n\nYou will also develop an understanding of loops and their use, and you’ll perform object-oriented programming. This will help you to turn your idea into a ready-to-code project and set up a Unity project for production. Finally, you will discover how to create the GameManager class to manage the game play loop, generate game levels, and develop a simple UI for the game.\n\nBy the end of this book, you will have mastered the art of applying C# in Unity.\n\nWho This Book Is For\n\nThe book is targeted at beginner level Unity developers with no programming experience. If you are a Unity developer and you wish to learn how to write C# scripts and code by creating games, then this book is for you.\n\nWhat You Will Learn\n\nUnderstand the fundamentals of variables, methods, and code syntax in C#\nGet to know about techniques to turn your game idea into working project\nUse loops and collections efficiently in Unity to reduce the amount of code\nDevelop a game using the object-oriented programming principles\nGenerate infinite levels for your game\nCreate and code a good-looking functional UI system for your game\nPublish and share your game with users",
    "download_link": "http://file.allitebooks.com/20170716/Learning%20C-%20by%20Developing%20Games%20with%20Unity%205.x,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "4.8 MB",
    "image": "Learning-C#-by-Developing-Games-with-Unity-5.x,-2nd-Edition.jpg",
    "isbn_10": "1785287591",
    "language": "English",
    "pages": 230,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27797",
    "sub_title": "Develop your first interactive 2D platformer game by learning the fundamentals of C#",
    "title": "Learning C# by Developing Games with Unity 5.x, 2nd Edition",
    "year": 2016,
    "id": 45
  },
  {
    "author": [
      "Bob Familiar",
      "Jeff Barnes"
    ],
    "category": [
      "Hardware & DIY"
    ],
    "description": "Book Description:\n\nLearn how today’s businesses can transform themselves by leveraging real-time data and advanced machine learning analytics.\nThis book provides prescriptive guidance for architects and developers on the design and development of modern Internet of Things (IoT) and Advanced Analytics solutions. In addition, Business in Real-Time Using Azure IoT and Cortana Intelligence Suite offers patterns and practices for those looking to engage their customers and partners through Software-as-a-Service solutions that work on any device.\nWhether you’re working in Health & Life Sciences, Manufacturing, Retail, Smart Cities and Buildings or Process Control, there exists a common platform from which you can create your targeted vertical solutions. Business in Real-Time Using Azure IoT and Cortana Intelligence Suite uses a reference architecture as a road map. Building on Azure’s PaaS services, you’ll see how a solution architecture unfolds that demonstrates a complete end-to-end IoT and Advanced Analytics scenario.\nWhat You’ll Learn:\nAutomate your software product life cycle using PowerShell, Azure Resource Manager Templates, and Visual Studio Team Services\nImplement smart devices using Node.JS and C#\nUse Azure Streaming Analytics to ingest millions of events\nProvide both “Hot” and “Cold” path outputs for real-time alerts, data transformations, and aggregation analytics\nImplement batch processing using Azure Data Factory\nCreate a new form of Actionable Intelligence (AI) to drive mission critical business processes\nProvide rich Data Visualizations across a wide variety of mobile and web devices\nWho This Book is For:\nSolution Architects, Software Developers, Data Architects, Data Scientists, and CIO/CTA Technical Leadership Professionals",
    "download_link": "http://file.allitebooks.com/20170715/Business%20in%20Real-Time%20Using%20Azure%20IoT%20and%20Cortana%20Intelligence%20Suite.pdf",
    "file_format": "PDF",
    "file_size": "25.2 MB",
    "image": "Business-in-Real-Time-Using-Azure-IoT-and-Cortana-Intelligence-Suite.jpg",
    "isbn_10": "1484226496",
    "language": "English",
    "pages": 525,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27792",
    "sub_title": "Driving Your Digital Transformation",
    "title": "Business in Real-Time Using Azure IoT and Cortana Intelligence Suite",
    "year": 2017,
    "id": 46
  },
  {
    "author": [
      "Andrew Chisholm"
    ],
    "category": [
      "Java",
      "Data Mining"
    ],
    "description": "Book Description:\n\nData is everywhere and the amount is increasing so much that the gap between what people can understand and what is available is widening relentlessly. There is a huge value in data, but much of this value lies untapped. 80% of data mining is about understanding data, exploring it, cleaning it, and structuring it so that it can be mined. RapidMiner is an environment for machine learning, data mining, text mining, predictive analytics, and business analytics. It is used for research, education, training, rapid prototyping, application development, and industrial applications.\n\nExploring Data with RapidMiner is packed with practical examples to help practitioners get to grips with their own data. The chapters within this book are arranged within an overall framework and can additionally be consulted on an ad-hoc basis. It provides simple to intermediate examples showing modeling, visualization, and more using RapidMiner.\n\nExploring Data with RapidMiner is a helpful guide that presents the important steps in a logical order. This book starts with importing data and then lead you through cleaning, handling missing values, visualizing, and extracting additional information, as well as understanding the time constraints that real data places on getting a result. The book uses real examples to help you understand how to set up processes, quickly..\n\nThis book will give you a solid understanding of the possibilities that RapidMiner gives for exploring data and you will be inspired to use it for your own work.\n\nWhat you will learn from this book\n\nImport real data from files in multiple formats and from databases\nExtract features from structured and unstructured data\nRestructure, reduce, and summarize data to help you understand it more easily and process it more quickly\nVisualize data in new ways to help you understand it\nDetect outliers and methods to handle them\nDetect missing data and implement ways to handle it\nUnderstand resource constraints and what to do about them",
    "download_link": "http://file.allitebooks.com/20170712/Exploring%20Data%20with%20RapidMiner.pdf",
    "file_format": "PDF",
    "file_size": "5.1 MB",
    "image": "Exploring-Data-with-RapidMiner.jpg",
    "isbn_10": "1782169334",
    "language": "English",
    "pages": 162,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27780",
    "sub_title": "Explore, understand, and prepare real data using RapidMiner's practical tips and tricks",
    "title": "Exploring Data with RapidMiner",
    "year": 2013,
    "id": 47
  },
  {
    "author": [
      "Cecil Costa"
    ],
    "category": [
      "Swift"
    ],
    "description": "Book Description:\n\nReactive programming helps you write applications that are more powerful and efficient. You can write more software, help more people, and create applications that scale. Reactive programming is a growing paradigm that we will help you set to work in Swift.\n\nReactive Programming with Swift guides you through migrating from the traditional way of developing to the new ReactiveCocoa framework, which uses Swift as its main programming language. You will learn how to develop with this framework, debug code, create unit tests, use additional frameworks, and convert a traditional framework into a ReactiveCocoa one.\n\nStarting with a crash course on the fundamental concepts of Reactive programming, we’ll set you up so you’re ready to create reactive applications. We’ll then move on to topics such as Graphical events, Streaming, and Core data, which will help you dive deeper with advanced programming. The concept of switching your programming concepts from imperative to functional reactive programming will also be covered. By the end of this book, you will be able to successfully create highly functional apps using Swift.\n\nWho This Book Is For\n\nReactive Programming with Swift is for Swift developers who want to start making more powerful and efficient applications. You need a basic understanding of Swift to follow along. This book takes a first-principles approach to what Reactive Programming is and how you can start implementing it in your next iOS applications.\n\nWhat You Will Learn\n\nSwitch your programming concepts from imperative to Functional reactive programming\nImprove your app’s maintenance by developing with a different paradigm\nCreate unit tests and automation tests using the ReactiveCocoa framework\nCreate clear code that is very easy to read\nGet accustomed to migrating mobile apps to the Reactive way of programming\nPerform asynchronous calls and join them later",
    "download_link": "http://file.allitebooks.com/20170711/Reactive%20Programming%20with%20Swift.pdf",
    "file_format": "PDF",
    "file_size": "7.39 MB",
    "image": "Reactive-Programming-with-Swift.jpg",
    "isbn_10": "1785884263",
    "language": "English",
    "pages": 238,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27771",
    "sub_title": "Leverage the power of the Functional Reactive Programming paradigm with Swift to develop robust iOS applications",
    "title": "Reactive Programming with Swift",
    "year": 2016,
    "id": 48
  },
  {
    "author": [
      "Daniele Teti"
    ],
    "category": [
      "Delphi"
    ],
    "description": "Book Description:\n\nDelphi is a cross-platform Integrated Development Environment (IDE) that supports rapid application development for Microsoft Windows, Apple Mac OS X, Google Android, and Apple iOS. It helps you to concentrate on the real business and save yourself the pain of wandering amid GUI widget details, or having to tackle inter-platform incompatibilities. It also has a wide range of drag-and-drop controls, helping you code your business logic into your business model, and it compiles natively for desktop and mobile platforms.\n\nThis book will teach you how to design and develop applications, deploy them on the cloud platform, and distribute them within an organization via Google Play and other similar platforms.\n\nYou will begin with the basics of Delphi and get acquainted with JSON format strings, XSLT transformations, unicode encodings and various types of streams. We then move on to more advanced topics such as developing higher-order functions and using enumerators and RTTI. You will get an understanding of how Delphi RTL functions and how to use FireMonkey in a VCL application. We will then cover topics such as multithreading, using the parallel programming library and putting Delphi on a server. We will also take a look at the new feature of WebBroker Apache modules and then ride the mobile revolution with FireMonkey.\n\nBy the end of the book, you will be able to develop and deploy cross-platform applications using Delphi.\n\nWho This Book Is For\n\nIf you are an intermediate developer with a basic knowledge of Delphi and you want to develop cross-platform applications, then this book is for you. Familiarity with the fundamentals of RAD (Rapid Application Development) Studio is expected.\n\nWhat You Will Learn\n\nDevelop visually stunning applications using FireMonkey\nDeploy LiveBinding effectively with the right OOP approach\nCreate server-side programs to serve RESTful web services and provide data to your mobile apps\nUse well-defined GUI design patterns to build mobile applications that provide a great user experience\nBuild mobile apps that read data from a remote server efficiently\nCall the platform native API on Android and iOS even for an unpublished API\nManage software customization for your customer by making better use of an extended RTTI\nImplement the most popular design pattern without wasting too much time on debugging and bug fixing",
    "download_link": "http://file.allitebooks.com/20170710/Delphi%20Cookbook,%20Second%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "3.9 MB",
    "image": "Delphi-Cookbook,-Second-Edition.jpg",
    "isbn_10": "1785287427",
    "language": "English",
    "pages": 470,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27765",
    "sub_title": "Over 60 hands-on recipes to help you master the power of Delphi for cross-platform and mobile development on multiple platforms",
    "title": "Delphi Cookbook, Second Edition",
    "year": 2016,
    "id": 49
  },
  {
    "author": [
      "Ben Dewey",
      "Kevin Grossnicklaus",
      "Philip Japikse"
    ],
    "category": [
      ".NET"
    ],
    "description": "Book Description:\n\nLearn how to build web applications from three Microsoft MVPs. After building the data application layer using Entity Framework Core and a RESTful service using ASP.NET Core, you will then build the client side web application three ways: first, using ASP.NET Core, then using Angular 2, and, finally, using React.  You will be able to compare and contrast these UI frameworks and select the best one for your needs.\n\n.NET Core is a complete rewrite of the popular .NET and its related frameworks. While many concepts are similar between .NET Core and the .NET 4.6 framework, there are revolutionary changes as well, including updates to Entity Framework Core and ASP.NET Core. The first section of this book covers the three main parts of building applications with C#: Entity Framework, ASP.NET Core Services, and ASP.NET Core Web Applications.\n\nThere is also an explosion in popularity of JavaScript frameworks for client side development, and the authors cover two of the most popular UI frameworks. Start with TypeScript for developing clean JavaScript, along with a client side build tool such as Gulp, Grunt, and WebPack. Using the same data access layer and RESTful service from the .NET Core application, you can rebuild the UI using Angular 2. Then, repeat the process using React, for a true comparison of building client side applications using ASP.NET Core, Angular 2, and React.\n\nWhat You’ll Learn\n\nUnderstand the fundamentals of .NET Core and what that means to the traditional .NET developer\nBuild a data access layer with Entity Framework Core, a RESTful service with ASP.NET Core MVC, and a website with ASP.NET Core MVC and Bootstrap\nAutomate many build tasks with client side build utilities\nWho This Book Is For\nIntermediate to advanced .NET developers",
    "download_link": "http://file.allitebooks.com/20170709/Building%20Web%20Applications%20with%20Visual%20Studio%202017.pdf",
    "file_format": "PDF",
    "file_size": "8.6 MB",
    "image": "Building-Web-Applications-with-Visual-Studio-2017.jpg",
    "isbn_10": "1484224779",
    "language": "English",
    "pages": 393,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27759",
    "sub_title": "Using .NET Core and Modern JavaScript Frameworks",
    "title": "Building Web Applications with Visual Studio 2017",
    "year": 2017,
    "id": 50
  },
  {
    "author": [
      "Nihad A. Hassan",
      "Rami Hijazi"
    ],
    "category": [
      "Security"
    ],
    "description": "Book Description:\n\nUse this hands-on guide to understand the ever growing and complex world of digital security. Learn how to protect yourself from digital crime, secure your communications, and become anonymous online using sophisticated yet practical tools and techniques.\n\nThis book teaches you how to secure your online identity and personal devices, encrypt your digital data and online communications, protect cloud data and Internet of Things (IoT), mitigate social engineering attacks, keep your purchases secret, and conceal your digital footprint. You will understand best practices to harden your operating system and delete digital traces using the most widely used operating system, Windows.\n\nDigital Privacy and Security Using Windows offers a comprehensive list of practical digital privacy tutorials in addition to being a complete repository of free online resources and tools assembled in one place. The book helps you build a robust defense from electronic crime and corporate surveillance. It covers general principles of digital privacy and how to configure and use various security applications to maintain your privacy, such as TOR, VPN, and BitLocker. You will learn to encrypt email communications using Gpg4win and Thunderbird.\n\nWhat You’ll Learn\n\nKnow the various parties interested in having your private data\nDifferentiate between government and corporate surveillance, and the motivations behind each one\nUnderstand how online tracking works technically\nProtect digital data, secure online communications, and become anonymous online\nCover and destroy your digital traces using Windows OS\nSecure your data in transit and at rest\nBe aware of cyber security risks and countermeasures\nWho This Book Is For\n\nEnd users, information security professionals, management, infosec students",
    "download_link": "http://file.allitebooks.com/20170708/Digital%20Privacy%20and%20Security%20Using%20Windows.pdf",
    "file_format": "PDF",
    "file_size": "10.1 MB",
    "image": "Digital-Privacy-and-Security-Using-Windows.jpg",
    "isbn_10": "1484227980",
    "language": "English",
    "pages": 284,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27751",
    "sub_title": "A Practical Guide",
    "title": "Digital Privacy and Security Using Windows",
    "year": 201,
    "id": 51
  },
  {
    "author": [
      "Amir Shevat"
    ],
    "category": [
      "Web Development"
    ],
    "description": "Book Description:\n\nFrom Facebook Messenger to Kik, and from Slack bots to Google Assistant, Amazon Alexa, and email bots, the new conversational apps are revolutionizing the way we interact with software. This practical guide shows you how to design and build great conversational experiences and delightful bots that help people be more productive, whether it’s for a new consumer service or an enterprise efficiency product.\n\nIdeal for designers, product managers, and entrepreneurs, this book explores what works and what doesn’t in real-world bot examples, and provides practical design patterns for your bot-building toolbox. You’ll learn how to use an effective onboarding process, outline different flows, define a bot personality, and choose the right balance of rich control and text.\n\nExplore different bot use-cases and design best practices\nUnderstand bot anatomy—such as brand and personality, conversations, advanced UI controls—and their associated design patterns\nLearn steps for building a Facebook Messenger consumer bot and a Slack business bot\nExplore the lessons learned and shared experiences of designers and entrepreneurs who have built bots\nDesign and prototype your first bot, and experiment with user feedback",
    "download_link": "http://file.allitebooks.com/20170708/Designing%20Bots.pdf",
    "file_format": "PDF",
    "file_size": "11.3 MB",
    "image": "Designing-Bots.jpg",
    "isbn_10": "1491974826",
    "language": "English",
    "pages": 348,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27746",
    "sub_title": "Creating Conversational Experiences",
    "title": "Designing Bots",
    "year": 2017,
    "id": 52
  },
  {
    "author": [
      "Nikhil Pathania"
    ],
    "category": [
      "Hardware & DIY"
    ],
    "description": "Book Description:\n\nFollow this step-by-step guide for creating a continuous delivery pipeline using all of the new features in Jenkins 2.0 such as Pipeline as a Code, multi-branch pipeline, and more. You will learn three crucial elements for achieving a faster software delivery pipeline: a fungible build/test environment, manageable and reproducible pipelines, and a scalable build/test infrastructure.\nPro Continuous Delivery demonstrates how to create a highly available, active/passive Jenkins server using some niche technologies.\nWhat You’ll Learn\nCreate a highly available, active/passive Jenkins server using CoreOS and Docker, and using Pacemaker and Corosync\nUse a Jenkins multi-branch pipeline to automatically perform continuous integration whenever there is a new branch in your source control system\nDescribe your continuous delivery pipeline with Jenkinsfile\nHost Jenkins server on a cloud solution\nRun Jenkins inside a container using Docker\nDiscover how the distributed nature of Git and the “merge before build” feature of Jenkins can be used to implement gated check-in\nImplement a scalable build farm using Docker and Kubernetes\nWho This Book Is For\nYou have experience implementing continuous integration and continuous delivery using Jenkins freestyle Jobs and wish to use the new Pipeline as a Code feature introduced in Jenkins 2.0\nYour source code is on a Git-like version control system (Git, GitHub, GitLab, etc.) and you wish to leverage the advantages of a multi-branch pipeline in Jenkins\nYour infrastructure is on a Unix-like platform and you wish to create a scalable, distributed build/test farm using Docker or Kubernetes\nYou are in need of a highly available system for your Jenkins Server using open source tools and technologies",
    "download_link": "http://file.allitebooks.com/20170707/Pro%20Continuous%20Delivery.pdf",
    "file_format": "PDF",
    "file_size": "14.9 MB",
    "image": "Pro-Continuous-Delivery.jpg",
    "isbn_10": "1484229126",
    "language": "English",
    "pages": 288,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27742",
    "sub_title": "With Jenkins 2.0",
    "title": "Pro Continuous Delivery",
    "year": 2017,
    "id": 53
  },
  {
    "author": [
      "Hanish Bansal",
      "Saurabh Chauhan",
      "Shrey Mehrotra"
    ],
    "category": [
      "Data Mining"
    ],
    "description": "Book Description:\n\nHive was developed by Facebook and later open sourced in Apache community. Hive provides SQL like interface to run queries on Big Data frameworks. Hive provides SQL like syntax also called as HiveQL that includes all SQL capabilities like analytical functions which are the need of the hour in today’s Big Data world.\n\nThis book provides you easy installation steps with different types of metastores supported by Hive. This book has simple and easy to learn recipes for configuring Hive clients and services. You would also learn different Hive optimizations including Partitions and Bucketing. The book also covers the source code explanation of latest Hive version.\n\nHive Query Language is being used by other frameworks including spark. Towards the end you will cover integration of Hive with these frameworks.\n\nWho This Book Is For\n\nThe book is intended for those who want to start in Hive or who have basic understanding of Hive framework. Prior knowledge of basic SQL command is also required\n\nWhat You Will Learn\n\nLearn different features and offering on the latest Hive\nUnderstand the working and structure of the Hive internals\nGet an insight on the latest development in Hive framework\nGrasp the concepts of Hive Data Model\nMaster the key concepts like Partition, Buckets and Statistics\nKnow how to integrate Hive with other frameworks such as Spark, Accumulo, etc",
    "download_link": "http://file.allitebooks.com/20170706/Apache%20Hive%20Cookbook.pdf",
    "file_format": "PDF",
    "file_size": "7.7 MB",
    "image": "Apache-Hive-Cookbook.jpg",
    "isbn_10": "1782161082",
    "language": "English",
    "pages": 268,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27739",
    "sub_title": "Easy, hands-on recipes to help you understand Hive and its integration with frameworks that are used widely in today's big data world",
    "title": "Apache Hive Cookbook",
    "year": 2016,
    "id": 54
  },
  {
    "author": [
      "Aniel Sud",
      "William Cava",
      "William Rogers"
    ],
    "category": [
      "Web Development"
    ],
    "description": "Book Description:\n\nThe first book to cover the Ektron content management system (CMS)\n\nEktron CMS400.NET provides a complete platform that features all the functionality needed to create, deploy, and manage your Web site. The power is in your hands when you use the built-in server controls to deploy a site or customize the deployment with the API. Authored by a trio of Ektron insiders, this book escorts you through the detailed steps of building a prototype company site. Upon completion, you will have a complete and functional coded Web site that you can use as a template for future projects.\n\nIntroduces the Ektron CMS400.NET as well as the Ektron architecture and includes an in-depth explanation of the Ektron framework\nAssumes no prior knowledge of the Ektron platform\nShows you how to install the CMS, software dependencies, and samples sites\nExplains how to implement a social network and construct a storefront\nEktron Users Guide provides you with everything you need to know about the exciting possibilities of working with this popular and powerful platform.",
    "download_link": "http://file.allitebooks.com/20170704/Ektron%20Developer's%20Guide.pdf",
    "file_format": "PDF",
    "file_size": "103 MB",
    "image": "Ektron-Developer’s-Guide.jpg",
    "isbn_10": "0470885696",
    "language": "English",
    "pages": 672,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27736",
    "sub_title": "Building an Ektron Powered Website",
    "title": "Ektron Developer’s Guide",
    "year": 2011,
    "id": 55
  },
  {
    "author": [
      "Andrew Mangogna",
      "Leon Starr",
      "Stephen Mellor"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nLearn how to translate an executable model of your application into running code. This is not a book about theory, good intentions or possible future developments. You’ll benefit from translation technology and solid software engineering principles that are demonstrated with concrete examples using an open source tool chain.\n\nModels don’t deliver enough value if they are not on a direct path to code production. But to waste time building models that are merely pictures of your code doesn’t add much value either. In this book, you’ll translate detailed, yet platform-independent models that solve real application problems.\n\nUsing a pragmatic approach, Models to Code quickly dives into two case studies of Executable UML models. The models and code are extensively annotated and illustrate key principles that are emphasized throughout the book.\n\nYou’ll work with code production using “C” as the implementation language and targeting microcomputer class processors. This might not be your particular target language or platform, but you can use you can use what you learn here to engineer or re-evaluate your own code translation system to dramatically increase the value of both your modeling and code generation solution.\n\nWritten by three leading experts, Models to Code is an exceptional resource for producing software by model translation― add it to your library today.\n\nWhat You’ll Learn\n\nSee how detailed models resolve ambiguity and contradiction common in requirements.\nExamine how a model can be detailed enough to be executable and testable while remaining platform independent\nProduce code from a model, leaving the model intact so it can be redeployed on new platforms or adapted to changing software and hardware technology.\nImplement platform independent model execution rules in platform specific run-time code\nWho This Book Is For\n\nModelers and systems engineers on active MBSE projects (using Executable UML or not), projects using Simulink, Matlab, Dymola, MatrixX and other math modelling tools.\n\nAny developers with current or past model experience, professors, students, systems engineers, embedded systems developers, or anyone interested in learning more about software modelling.",
    "download_link": "http://file.allitebooks.com/20170703/Models%20to%20Code.pdf",
    "file_format": "PDF",
    "file_size": "18.7 MB",
    "image": "Models-to-Code.jpg",
    "isbn_10": "1484222164",
    "language": "English",
    "pages": 305,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27733",
    "sub_title": "With No Mysterious Gaps",
    "title": "Models to Code",
    "year": 2017,
    "id": 56
  },
  {
    "author": [
      "Ayan Chatterjee"
    ],
    "category": [
      "Windows"
    ],
    "description": "Book Description:\n\nDevelop Windows 10 applications faster and more efficiently using the Universal Windows Platform. You will use Xamarin to create apps for macOS, iOS, and Android devices.\n\nBuilding Apps for the Universal Windows Platform is a complete guide covering PCs, tablets, phones, and other devices such as HoloLens. You will use Windows 10 to develop apps for desktop, mobile, holographic, wearable, and IoT devices. You will reuse code to easily create cross-platform apps.\n\nWhat You Will Learn\nDesign and develop apps using Visual Studio and Blend\nCreate Cortana-enabled apps for a hands-free experience\nBuild IoT apps and apps for wearables such as the Microsoft HoloLens\nMonitor apps post-publication to gain insights from actionable data using Windows Store Analytics and Azure\nWho This Book Is For\nProfessional developers working independently or in a team on Windows 10 applications, and students coming into the world of software development",
    "download_link": "http://file.allitebooks.com/20170630/Building%20Apps%20for%20the%20Universal%20Windows%20Platform.pdf",
    "file_format": "PDF",
    "file_size": "10.4 MB",
    "image": "Building-Apps-for-the-Universal-Windows-Platform.jpg",
    "isbn_10": "1484226283",
    "language": "English",
    "pages": 270,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27717",
    "sub_title": "Explore Windows 10 Native, IoT, HoloLens, and Xamarin",
    "title": "Building Apps for the Universal Windows Platform",
    "year": 2017,
    "id": 57
  },
  {
    "author": [
      "Abhishek Mishra"
    ],
    "category": [
      "Swift"
    ],
    "description": "Book Description:\n\nPut into motion practical examples to master Test-Driven Development (TDD) and acceptance testing in Swift.\nThis book uses a pragmatic approach to writing well-tested code and provides techniques that can be used to retrofit tests to legacy code bases. You’ll be introduced to basic principles of TDD, such as Test First, Red-Green-Refactor, Remove Duplicate code, Dependency Injection, and Single Responsibility. Approaches covered include TDD, behavior-driven development (BDD), UI, and acceptance testing with common standard/open source frameworks.\niOS Code Testing offers helpful instruction to teach iOS developers to retrospectively fit tests to legacy code, refactor legacy code so as to make the code more testable, install and configure a popular Swift BDD framework, practice BDD with Xcode, and create automated UI tests with Xcode. Additionally, many projects have legacy code bases. Legacy code is often seen as a blocker when it comes to implementing any kind of testing.\nWhat You Will Learn\n\nFit test to legacy code retrospectively\nInstall and configure popular Swift BDD frameworks\nPractice BDD with Xcode\nWho This Book Is For\n\nSoftware practitioners, such as Swift developers and mobile app testers.",
    "download_link": "http://file.allitebooks.com/20170701/iOS%20Code%20Testing.pdf",
    "file_format": "PDF",
    "file_size": "11.6 MB",
    "image": "iOS-Code-Testing.jpg",
    "isbn_10": "1484226887",
    "language": "English",
    "pages": 440,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27723",
    "sub_title": "Test-Driven Development and Behavior-Driven Development with Swift",
    "title": "iOS Code Testing",
    "year": 2017,
    "id": 58
  },
  {
    "author": [
      "Rehan Zaidi"
    ],
    "category": [
      "JavaScript"
    ],
    "description": "Book Description:\n\nEasily master JavaScript (JS) with this quick guide and develop mobile and desktop applications for SAP Fiori. This book equips ABAP/SAP developers with the essential topics to get started with JS.\n\nThe focus of JavaScript Essentials for SAP ABAP Developers is on the parts of the JS language that are useful from the perspective of an ABAP developer. The book starts with a brief intro to HTML, the basics of JS, and how to create and run a simple JS program. It then dives into the details of the language, showing how to make simple programs. It covers loops in detail, mathematical operations, and string and regular expressions in JS, as well as a taste of functions, followed by objects and object-oriented programming in JavaScript. The book provides:\n\nSample code and screenshots to help you fully understand JS\nA chapter on JS best practices and recommendations\nDifferences and comparisons of the elements and data structures of ABAP and JavaScript to help you quickly master the material\nWhat You’ll Learn\n\nCreate and run a simple JavaScript program\nUnderstand loops, operations, and expressions\nMaster the Create and Use functions\nUse objects and object-oriented programming in JS\nApply the best practices of JS programming\nWho This Book Is For\n\nSAP programmers and developers, ABAP users and developers, and university students learning ABAP and JavaScript",
    "download_link": "http://file.allitebooks.com/20170629/JavaScript%20Essentials%20for%20SAP%20ABAP%20Developers.pdf",
    "file_format": "PDF",
    "file_size": "4.1 MB",
    "image": "JavaScript-Essentials-for-SAP-ABAP-Developers.jpg",
    "isbn_10": "1484222199",
    "language": "English",
    "pages": 169,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27714",
    "sub_title": "A Guide to Mobile and Desktop Application Development",
    "title": "JavaScript Essentials for SAP ABAP Developers",
    "year": 2017,
    "id": 59
  },
  {
    "author": [
      "Sunil Gulabani"
    ],
    "category": [
      "Data Processing"
    ],
    "description": "Book Description:\n\nProvide solutions to all your Amazon EC2, SQS, Kinesis, and S3 problems, including implementation using the AWS Management Console, AWS CLI, and AWS SDK (Java).\n\nYou’ll find recipes on implementation and configuration of Amazon EC2, SQS, Kinesis, and S3 along with the code snippets and AWS CLI commands.\n\nPractical Amazon EC2, SQS, Kinesis, and S3 uses focused examples that include only the details you need to get things done. You’ll see production use cases of Amazon EC2, SQS, Kinesis, and S3 and how to implement cloud watch in projects for these services. Learn how to raise an alarm on Amazon EC2, SQS, Kinesis, and S3 as part of a continuous monitoring system designed to increase performance and avoid side effects in your services.\n\nWhat You’ll Learn\n\nManage Amazon EC2, SQS, Kinesis, and S3 using the AWS Management Console\nUse the AWS CLI\nEmploy the AWS Java SDK\nConfigure alarms on Amazon EC2, SQS, Kinesis, and S3\nWho This Book Is For\n\nSoftware developers and architects, system engineers, and project managers",
    "download_link": "http://file.allitebooks.com/20170629/Practical%20Amazon%20EC2,%20SQS,%20Kinesis,%20and%20S3.pdf",
    "file_format": "PDF",
    "file_size": "16.9 MB",
    "image": "Practical-Amazon-EC2,-SQS,-Kinesis,-and-S3.jpg",
    "isbn_10": "1484228405",
    "language": "English",
    "pages": 312,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27708",
    "sub_title": "A Hands-On Approach to AWS",
    "title": "Practical Amazon EC2, SQS, Kinesis, and S3",
    "year": 2017,
    "id": 60
  },
  {
    "author": [
      "Igor Zhirkov"
    ],
    "category": [
      "Hardware & DIY"
    ],
    "description": "Book Description:\n\nLearn Intel 64 assembly language and architecture, become proficient in C, and understand how the programs are compiled and executed down to machine instructions, enabling you to write robust, high-performance code.\n\nLow-Level Programming explains Intel 64 architecture as the result of von Neumann architecture evolution.  The book teaches the latest version of the C language (C11) and assembly language from scratch.  It covers the entire path from source code to program execution, including generation of ELF object files, and static and dynamic linking. Code examples and exercises are included along with the best code practices. Optimization capabilities and limits of modern compilers are examined, enabling you to balance between program readability and performance. The use of various performance-gain techniques is demonstrated, such as SSE instructions and pre-fetching. Relevant Computer Science topics such as models of computation and formal grammars are addressed, and their practical value explained.\n\nWhat You’ll Learn\n\nLow-Level Programming teaches programmers to:\n\nFreely write in assembly language\nUnderstand the programming model of Intel 64\nWrite maintainable and robust code in C11\nFollow the compilation process and decipher assembly listings\nDebug errors in compiled assembly code\nUse appropriate models of computation to greatly reduce program complexity\nWrite performance-critical code\nComprehend the impact of a weak memory model in multi-threaded applications\nWho This Book Is For\n\nIntermediate to advanced programmers and programming students",
    "download_link": "http://file.allitebooks.com/20170629/Low-Level%20Programming.pdf",
    "file_format": "PDF",
    "file_size": "5.6 MB",
    "image": "Low-Level-Programming.jpg",
    "isbn_10": "1484224027",
    "language": "English",
    "pages": 435,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27705",
    "sub_title": "C, Assembly, and Program Execution on Intel® 64 Architecture",
    "title": "Low-Level Programming",
    "year": 2017,
    "id": 61
  },
  {
    "author": [
      "Matt Cavanagh"
    ],
    "category": [
      "C#"
    ],
    "description": "Book Description:\n\nIn recent years, electronics have gone from something that only electronic engineers can understand, to a common hobby that is accessible to all. Netduino has grown to be a part of this revolution, providing a development board that is both easy to use, and allows existing .NET developers to build on knowledge they already have.\n\nMost developers have wild ideas about all the gadgets they would develop to make the world a better (or easier) place, but have no idea how to get beyond blinking an LED. The topics contained go beyond what most books cover, taking an in-depth look at how to use Netduino for practical projects.\n\nThis book starts off by showing you how to do the “hello world” of electronics – fade an LED in and out. It will take you right through all the fundamentals, including how to control a wide range of electronic sensors.\n\nYou will learn how easy it is to automate various parts of your home. You will learn how to open your gate with your smartphone, automatically water your plants, get emailed when someone invades your territory, connect up a keypad to unlock your door, make your own breathalyzer, control your home theatre, and much more!\n\nWhat you will learn from this book\n\nWrite some simple code for a Netduino\nUse a microphone to determine the noise level of the room\nPower the sensors and components with external power supplies\nControl existing technology and appliances around your house with transistors and relays\nLink your smartphone to your Netduino with Bluetooth as a controller\nDetermine alcohol on your breath\nUse servos to control physical objects\nUse a matrix keypad to secure your house and much more",
    "download_link": "http://file.allitebooks.com/20170625/Netduino%20Home%20Automation%20Projects.pdf",
    "file_format": "PDF",
    "file_size": "1.9 MB",
    "image": "Netduino-Home-Automation-Projects.jpg",
    "isbn_10": "978-1849697828",
    "language": "English",
    "pages": 108,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27680",
    "sub_title": "Automate your house, save lives, and survive the apocalypse with . NET on a Netduino!",
    "title": "Netduino Home Automation Projects",
    "year": 2013,
    "id": 62
  },
  {
    "author": [
      "Ali Asad",
      "Hamza Ali"
    ],
    "category": [
      "Programming",
      "Microsoft"
    ],
    "description": "Book Description:\n\nPrepare for Microsoft Certification Exam 70-483: Programming in C#. The “What, Why, and How” of each concept is presented along with quick summaries, code challenges, and exam questions to review and practice key concepts.\n\nYou will learn how to use:\n\nLambda expressions to write LINQ query expressions\nAsynchronous programming with the Async and Await keywords to maximize performance of slow applications\nRegular expressions to validate user input\nReflection to create and handle types at runtime\nand much more\nThe source code in the book will be available in the form of iCanCSharp notebooks and scripts that allow you to try out examples and extend them in interesting ways.\n\nWhat You Will Learn\nUnderstand the necessary knowledge and skill set to prepare for Microsoft Exam 70-483\nStudy the code challenges and practice questions on C# that are relevant to the exam\n\nMaster the C# programming language\nWho This Book Is For\nExperienced C# and .NET programmers and developers who are ready to take and pass the exam in order to get certified",
    "download_link": "http://file.allitebooks.com/20170624/The%20C-%20Programmer%20s%20Study%20Guide%20(MCSD).pdf",
    "file_format": "PDF",
    "file_size": "5.1 MB",
    "image": "The-C#-Programmer’s-Study-Guide-(MCSD).jpg",
    "isbn_10": "1484228596",
    "language": "English",
    "pages": 475,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27671",
    "sub_title": "Exam: 70-483",
    "title": "The C# Programmer’s Study Guide (MCSD)",
    "year": 2017,
    "id": 63
  },
  {
    "author": [
      "Gary D. Knott"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nLearn Lisp programming in a data structures context, including tables, functions, forms, expressions, typed-pointers, I/O, garbage collection and some applications. This short primer contains a careful description of the data structures manipulated by Lisp functions. These data structures and others, notably hash tables, are also used in constructing a Lisp interpreter.\nInterpreting Lisp will be of special interest to those learning and using programming languages and computer architecture as well as data structures. This book will be useful to autodidacts, professional programmers, and computer enthusiasts in a wide variety of fields.\nWhat You’ll Learn\nUse the atom table and the number table in Lisp\nMaster expressions, typed pointers, arguments and results in typed pointers, and more\nWrite lambda expressions in Lisp\nBind actual values to formal arguments\nDevelop games in Lisp\nWho This Book Is For\nExperienced programmers new to Lisp.",
    "download_link": "http://file.allitebooks.com/20170624/Interpreting%20LISP,%202nd%20Edition.pdf",
    "file_format": "PDF",
    "file_size": "2.4 MB",
    "image": "Interpreting-LISP,-2nd-Edition.jpg",
    "isbn_10": "1484227069",
    "language": "English",
    "pages": 150,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27667",
    "sub_title": "Programming and Data Structures",
    "title": "Interpreting LISP, 2nd Edition",
    "year": 2017,
    "id": 64
  },
  {
    "author": [
      "Thomas Mailund"
    ],
    "category": [
      "Programming"
    ],
    "description": "Book Description:\n\nLearn how to write object-oriented programs in R and how to construct classes and class hierarchies in the three object-oriented systems available in R. This book gives an introduction to object-oriented programming in the R programming language and shows you how to use and apply R in an object-oriented manner. You will then be able to use this powerful programming style in your own statistical programming projects to write flexible and extendable software.\nAfter reading Advanced Object-Oriented Programming in R, you’ll come away with a practical project that you can reuse in your own analytics coding endeavors. You’ll then be able to visualize your data as objects that have state and then manipulate those objects with polymorphic or generic methods. Your projects will benefit from the high degree of flexibility provided by polymorphism, where the choice of concrete method to execute depends on the type of data being manipulated.\nWhat You’ll Learn\nDefine and use classes and generic functions using R\nWork with the R class hierarchies\nBenefit from implementation reuse\nHandle operator overloading\nApply the S4 and R6 classes\nWho This Book Is For\nExperienced programmers and for those with at least some prior experience with R programming language.",
    "download_link": "http://file.allitebooks.com/20170624/Advanced%20Object-Oriented%20Programming%20in%20R.pdf",
    "file_format": "PDF",
    "file_size": "1.1 MB",
    "image": "Advanced-Object-Oriented-Programming-in-R.jpg",
    "isbn_10": "1484229185",
    "language": "English",
    "pages": 110,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27663",
    "sub_title": "Statistical Programming for Data Science, Analysis and Finance",
    "title": "Advanced Object-Oriented Programming in R",
    "year": 2017,
    "id": 65
  },
  {
    "author": [
      "Dale Green"
    ],
    "category": [
      "C & C++",
      "Game Programming",
      "Cloud & Virtualization"
    ],
    "description": "Book Description:\n\nProcedural generation is a growing trend in game development. It allows developers to create games that are bigger and more dynamic, giving the games a higher level of replayability. Procedural generation isn’t just one technique, it’s a collection of techniques and approaches that are used together to create dynamic systems and objects. C++ is the industry-standard programming language to write computer games. It’s at the heart of most engines, and is incredibly powerful. SFML is an easy-to-use, cross-platform, and open-source multimedia library. Access to computer hardware is broken into succinct modules, making it a great choice if you want to develop cross-platform games with ease.\n\nUsing C++ and SFML technologies, this book will guide you through the techniques and approaches used to generate content procedurally within game development.\n\nThroughout the course of this book, we’ll look at examples of these technologies, starting with setting up a roguelike project using the C++ template. We’ll then move on to using RNG with C++ data types and randomly scattering objects within a game map. We will create simple console examples to implement in a real game by creating unique and randomised game items, dynamic sprites, and effects, and procedurally generating game events. Then we will walk you through generating random game maps. At the end, we will have a retrospective look at the project.\n\nBy the end of the book, not only will you have a solid understanding of procedural generation, but you’ll also have a working roguelike game that you will have extended using the examples provided.",
    "download_link": "http://file.allitebooks.com/20170623/Procedural%20Content%20Generation%20for%20C++%20Game%20Development.pdf",
    "file_format": "PDF",
    "file_size": "3.4 MB",
    "image": "Procedural-Content-Generation-for-C++-Game-Development.jpg",
    "isbn_10": "1785886711",
    "language": "English",
    "pages": 304,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27648",
    "sub_title": "Get to know techniques and approaches to procedurally generate game content in C++ using Simple and Fast Multimedia Library",
    "title": "Procedural Content Generation for C++ Game Development",
    "year": 304,
    "id": 66
  },
  {
    "author": [
      "Dr. Joshua F. Wiley"
    ],
    "category": [
      "Algorithms",
      "Data Mining"
    ],
    "description": "Book Description:\n\nDeep learning is a branch of machine learning based on a set of algorithms that attempt to model high-level abstractions in data by using model architectures. With the superb memory management and the full integration with multi-node big data platforms, the H2O engine has become more and more popular among data scientists in the field of deep learning.\n\nThis book will introduce you to the deep learning package H2O with R and help you understand the concepts of deep learning. We will start by setting up important deep learning packages available in R and then move towards building models related to neural networks, prediction, and deep prediction, all of this with the help of real-life examples.\n\nAfter installing the H2O package, you will learn about prediction algorithms. Moving ahead, concepts such as overfitting data, anomalous data, and deep prediction models are explained. Finally, the book will cover concepts relating to tuning and optimizing models.\n\nWhat you will learn\n\nSet up the R package H2O to train deep learning models\nUnderstand the core concepts behind deep learning models\nUse Autoencoders to identify anomalous data or outliers\nPredict or classify data automatically using deep neural networks\nBuild generalizable models using regularization to avoid overfitting the training data",
    "download_link": "http://file.allitebooks.com/20170623/R%20Deep%20Learning%20Essentials.pdf",
    "file_format": "PDF",
    "file_size": "2.1 MB",
    "image": "R-Deep-Learning-Essentials.jpg",
    "isbn_10": "1785280589",
    "language": "English",
    "pages": 170,
    "read_link": "http://www.allitebooks.com/read/index.php?id=27647",
    "sub_title": "Build automatic classfication and predicition models using unsupervised learning",
    "title": "R Deep Learning Essentials",
    "year": 2016,
    "id": 67
  }
]